frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
#ifndef _MC9S12XEP768_H
#define _MC9S12XEP768_H

/*lint -save  -e950 -esym(960,18.4) -e46 -esym(961,19.7) Disable MISRA rule (1.1,18.4,6.4,19.7) checking. */
/* Types definition */
typedef unsigned char byte;
typedef unsigned int word;
typedef unsigned long dword;
typedef unsigned long dlong[2];

#define REG_BASE 0x0000                /* Base address for the I/O register block */


#pragma MESSAGE DISABLE C1106 /* WARNING C1106: Non-standard bitfield type */
#pragma OPTION ADD V30toV31Compatible "-BfaGapLimitBits4294967295" /*this guarantee correct bitfield positions*/

/**************** interrupt vector numbers ****************/
#define VectorNumber_Vsi                119U
#define VectorNumber_Vsyscall           118U
#define VectorNumber_Vmpuaccesserr      117U
#define VectorNumber_Vxsei              116U
#define VectorNumber_VReserved115       115U
#define VectorNumber_VReserved114       114U
#define VectorNumber_VReserved113       113U
#define VectorNumber_VReserved112       112U
#define VectorNumber_VReserved111       111U
#define VectorNumber_VReserved110       110U
#define VectorNumber_VReserved109       109U
#define VectorNumber_VReserved108       108U
#define VectorNumber_VReserved107       107U
#define VectorNumber_VReserved106       106U
#define VectorNumber_VReserved105       105U
#define VectorNumber_VReserved104       104U
#define VectorNumber_VReserved103       103U
#define VectorNumber_VReserved102       102U
#define VectorNumber_VReserved101       101U
#define VectorNumber_VReserved100       100U
#define VectorNumber_VReserved99        99U
#define VectorNumber_VReserved98        98U
#define VectorNumber_Vatd1compare       97U
#define VectorNumber_Vatd0compare       96U
#define VectorNumber_Vtimpaie           95U
#define VectorNumber_Vtimpaaovf         94U
#define VectorNumber_Vtimovf            93U
#define VectorNumber_Vtimch7            92U
#define VectorNumber_Vtimch6            91U
#define VectorNumber_Vtimch5            90U
#define VectorNumber_Vtimch4            89U
#define VectorNumber_Vtimch3            88U
#define VectorNumber_Vtimch2            87U
#define VectorNumber_Vtimch1            86U
#define VectorNumber_Vtimch0            85U
#define VectorNumber_Vsci7              84U
#define VectorNumber_Vpit7              83U
#define VectorNumber_Vpit6              82U
#define VectorNumber_Vpit5              81U
#define VectorNumber_Vpit4              80U
#define VectorNumber_VReserved79        79U
#define VectorNumber_VReserved78        78U
#define VectorNumber_Vxst7              77U
#define VectorNumber_Vxst6              76U
#define VectorNumber_Vxst5              75U
#define VectorNumber_Vxst4              74U
#define VectorNumber_Vxst3              73U
#define VectorNumber_Vxst2              72U
#define VectorNumber_Vxst1              71U
#define VectorNumber_Vxst0              70U
#define VectorNumber_Vpit3              69U
#define VectorNumber_Vpit2              68U
#define VectorNumber_Vpit1              67U
#define VectorNumber_Vpit0              66U
#define VectorNumber_Vhti               65U
#define VectorNumber_Vapi               64U
#define VectorNumber_Vlvi               63U
#define VectorNumber_Viic1              62U
#define VectorNumber_Vsci5              61U
#define VectorNumber_Vsci4              60U
#define VectorNumber_Vsci3              59U
#define VectorNumber_Vsci2              58U
#define VectorNumber_Vpwmesdn           57U
#define VectorNumber_Vportp             56U
#define VectorNumber_Vcan4tx            55U
#define VectorNumber_Vcan4rx            54U
#define VectorNumber_Vcan4err           53U
#define VectorNumber_Vcan4wkup          52U
#define VectorNumber_Vcan3tx            51U
#define VectorNumber_Vcan3rx            50U
#define VectorNumber_Vcan3err           49U
#define VectorNumber_Vcan3wkup          48U
#define VectorNumber_Vcan2tx            47U
#define VectorNumber_Vcan2rx            46U
#define VectorNumber_Vcan2err           45U
#define VectorNumber_Vcan2wkup          44U
#define VectorNumber_Vcan1tx            43U
#define VectorNumber_Vcan1rx            42U
#define VectorNumber_Vcan1err           41U
#define VectorNumber_Vcan1wkup          40U
#define VectorNumber_Vcan0tx            39U
#define VectorNumber_Vcan0rx            38U
#define VectorNumber_Vcan0err           37U
#define VectorNumber_Vcan0wkup          36U
#define VectorNumber_Vflash             35U
#define VectorNumber_Vflashfd           34U
#define VectorNumber_Vspi2              33U
#define VectorNumber_Vspi1              32U
#define VectorNumber_Viic0              31U
#define VectorNumber_Vsci6              30U
#define VectorNumber_Vcrgscm            29U
#define VectorNumber_Vcrgplllck         28U
#define VectorNumber_Vectpabovf         27U
#define VectorNumber_Vectmdcu           26U
#define VectorNumber_Vporth             25U
#define VectorNumber_Vportj             24U
#define VectorNumber_Vatd1              23U
#define VectorNumber_Vatd0              22U
#define VectorNumber_Vsci1              21U
#define VectorNumber_Vsci0              20U
#define VectorNumber_Vspi0              19U
#define VectorNumber_Vectpaie           18U
#define VectorNumber_Vectpaaovf         17U
#define VectorNumber_Vectovf            16U
#define VectorNumber_Vectch7            15U
#define VectorNumber_Vectch6            14U
#define VectorNumber_Vectch5            13U
#define VectorNumber_Vectch4            12U
#define VectorNumber_Vectch3            11U
#define VectorNumber_Vectch2            10U
#define VectorNumber_Vectch1            9U
#define VectorNumber_Vectch0            8U
#define VectorNumber_Vrti               7U
#define VectorNumber_Virq               6U
#define VectorNumber_Vxirq              5U
#define VectorNumber_Vswi               4U
#define VectorNumber_Vtrap              3U
#define VectorNumber_Vcop               2U
#define VectorNumber_Vclkmon            1U
#define VectorNumber_Vreset             0U

/**************** interrupt vector table ****************/
#define Vsi                             0xFF10U
#define Vsyscall                        0xFF12U
#define Vmpuaccesserr                   0xFF14U
#define Vxsei                           0xFF16U
#define VReserved115                    0xFF18U
#define VReserved114                    0xFF1AU
#define VReserved113                    0xFF1CU
#define VReserved112                    0xFF1EU
#define VReserved111                    0xFF20U
#define VReserved110                    0xFF22U
#define VReserved109                    0xFF24U
#define VReserved108                    0xFF26U
#define VReserved107                    0xFF28U
#define VReserved106                    0xFF2AU
#define VReserved105                    0xFF2CU
#define VReserved104                    0xFF2EU
#define VReserved103                    0xFF30U
#define VReserved102                    0xFF32U
#define VReserved101                    0xFF34U
#define VReserved100                    0xFF36U
#define VReserved99                     0xFF38U
#define VReserved98                     0xFF3AU
#define Vatd1compare                    0xFF3CU
#define Vatd0compare                    0xFF3EU
#define Vtimpaie                        0xFF40U
#define Vtimpaaovf                      0xFF42U
#define Vtimovf                         0xFF44U
#define Vtimch7                         0xFF46U
#define Vtimch6                         0xFF48U
#define Vtimch5                         0xFF4AU
#define Vtimch4                         0xFF4CU
#define Vtimch3                         0xFF4EU
#define Vtimch2                         0xFF50U
#define Vtimch1                         0xFF52U
#define Vtimch0                         0xFF54U
#define Vsci7                           0xFF56U
#define Vpit7                           0xFF58U
#define Vpit6                           0xFF5AU
#define Vpit5                           0xFF5CU
#define Vpit4                           0xFF5EU
#define VReserved79                     0xFF60U
#define VReserved78                     0xFF62U
#define Vxst7                           0xFF64U
#define Vxst6                           0xFF66U
#define Vxst5                           0xFF68U
#define Vxst4                           0xFF6AU
#define Vxst3                           0xFF6CU
#define Vxst2                           0xFF6EU
#define Vxst1                           0xFF70U
#define Vxst0                           0xFF72U
#define Vpit3                           0xFF74U
#define Vpit2                           0xFF76U
#define Vpit1                           0xFF78U
#define Vpit0                           0xFF7AU
#define Vhti                            0xFF7CU
#define Vapi                            0xFF7EU
#define Vlvi                            0xFF80U
#define Viic1                           0xFF82U
#define Vsci5                           0xFF84U
#define Vsci4                           0xFF86U
#define Vsci3                           0xFF88U
#define Vsci2                           0xFF8AU
#define Vpwmesdn                        0xFF8CU
#define Vportp                          0xFF8EU
#define Vcan4tx                         0xFF90U
#define Vcan4rx                         0xFF92U
#define Vcan4err                        0xFF94U
#define Vcan4wkup                       0xFF96U
#define Vcan3tx                         0xFF98U
#define Vcan3rx                         0xFF9AU
#define Vcan3err                        0xFF9CU
#define Vcan3wkup                       0xFF9EU
#define Vcan2tx                         0xFFA0U
#define Vcan2rx                         0xFFA2U
#define Vcan2err                        0xFFA4U
#define Vcan2wkup                       0xFFA6U
#define Vcan1tx                         0xFFA8U
#define Vcan1rx                         0xFFAAU
#define Vcan1err                        0xFFACU
#define Vcan1wkup                       0xFFAEU
#define Vcan0tx                         0xFFB0U
#define Vcan0rx                         0xFFB2U
#define Vcan0err                        0xFFB4U
#define Vcan0wkup                       0xFFB6U
#define Vflash                          0xFFB8U
#define Vflashfd                        0xFFBAU
#define Vspi2                           0xFFBCU
#define Vspi1                           0xFFBEU
#define Viic0                           0xFFC0U
#define Vsci6                           0xFFC2U
#define Vcrgscm                         0xFFC4U
#define Vcrgplllck                      0xFFC6U
#define Vectpabovf                      0xFFC8U
#define Vectmdcu                        0xFFCAU
#define Vporth                          0xFFCCU
#define Vportj                          0xFFCEU
#define Vatd1                           0xFFD0U
#define Vatd0                           0xFFD2U
#define Vsci1                           0xFFD4U
#define Vsci0                           0xFFD6U
#define Vspi0                           0xFFD8U
#define Vectpaie                        0xFFDAU
#define Vectpaaovf                      0xFFDCU
#define Vectovf                         0xFFDEU
#define Vectch7                         0xFFE0U
#define Vectch6                         0xFFE2U
#define Vectch5                         0xFFE4U
#define Vectch4                         0xFFE6U
#define Vectch3                         0xFFE8U
#define Vectch2                         0xFFEAU
#define Vectch1                         0xFFECU
#define Vectch0                         0xFFEEU
#define Vrti                            0xFFF0U
#define Virq                            0xFFF2U
#define Vxirq                           0xFFF4U
#define Vswi                            0xFFF6U
#define Vtrap                           0xFFF8U
#define Vcop                            0xFFFAU
#define Vclkmon                         0xFFFCU
#define Vreset                          0xFFFEU

/**************** registers I/O map ****************/

