frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
/*** ARMCOP - CRG COP Timer Arm/Reset Register; 0x0000003F ***/
typedef union {
  byte Byte;
  struct {
    byte BIT0        :1;                                       /* CRG COP Timer Arm/Reset Bit 0 */
    byte BIT1        :1;                                       /* CRG COP Timer Arm/Reset Bit 1 */
    byte BIT2        :1;                                       /* CRG COP Timer Arm/Reset Bit 2 */
    byte BIT3        :1;                                       /* CRG COP Timer Arm/Reset Bit 3 */
    byte BIT4        :1;                                       /* CRG COP Timer Arm/Reset Bit 4 */
    byte BIT5        :1;                                       /* CRG COP Timer Arm/Reset Bit 5 */
    byte BIT6        :1;                                       /* CRG COP Timer Arm/Reset Bit 6 */
    byte BIT7        :1;                                       /* CRG COP Timer Arm/Reset Bit 7 */
  } Bits;
} ARMCOPSTR;
extern volatile ARMCOPSTR _ARMCOP @(REG_BASE + 0x0000003FUL);
#define ARMCOP                          _ARMCOP.Byte
#define ARMCOP_BIT0                     _ARMCOP.Bits.BIT0
#define ARMCOP_BIT1                     _ARMCOP.Bits.BIT1
#define ARMCOP_BIT2                     _ARMCOP.Bits.BIT2
#define ARMCOP_BIT3                     _ARMCOP.Bits.BIT3
#define ARMCOP_BIT4                     _ARMCOP.Bits.BIT4
#define ARMCOP_BIT5                     _ARMCOP.Bits.BIT5
#define ARMCOP_BIT6                     _ARMCOP.Bits.BIT6
#define ARMCOP_BIT7                     _ARMCOP.Bits.BIT7

#define ARMCOP_BIT0_MASK                1U
#define ARMCOP_BIT1_MASK                2U
#define ARMCOP_BIT2_MASK                4U
#define ARMCOP_BIT3_MASK                8U
#define ARMCOP_BIT4_MASK                16U
#define ARMCOP_BIT5_MASK                32U
#define ARMCOP_BIT6_MASK                64U
#define ARMCOP_BIT7_MASK                128U


/*** ECT_TIOS - Timer Input Capture/Output Compare Select; 0x00000040 ***/
typedef union {
  byte Byte;
  struct {
    byte IOS0        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 0 */
    byte IOS1        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 1 */
    byte IOS2        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 2 */
    byte IOS3        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 3 */
    byte IOS4        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 4 */
    byte IOS5        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 5 */
    byte IOS6        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 6 */
    byte IOS7        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 7 */
  } Bits;
} ECT_TIOSSTR;
extern volatile ECT_TIOSSTR _ECT_TIOS @(REG_BASE + 0x00000040UL);
#define ECT_TIOS                        _ECT_TIOS.Byte
#define ECT_TIOS_IOS0                   _ECT_TIOS.Bits.IOS0
#define ECT_TIOS_IOS1                   _ECT_TIOS.Bits.IOS1
#define ECT_TIOS_IOS2                   _ECT_TIOS.Bits.IOS2
#define ECT_TIOS_IOS3                   _ECT_TIOS.Bits.IOS3
#define ECT_TIOS_IOS4                   _ECT_TIOS.Bits.IOS4
#define ECT_TIOS_IOS5                   _ECT_TIOS.Bits.IOS5
#define ECT_TIOS_IOS6                   _ECT_TIOS.Bits.IOS6
#define ECT_TIOS_IOS7                   _ECT_TIOS.Bits.IOS7

#define ECT_TIOS_IOS0_MASK              1U
#define ECT_TIOS_IOS1_MASK              2U
#define ECT_TIOS_IOS2_MASK              4U
#define ECT_TIOS_IOS3_MASK              8U
#define ECT_TIOS_IOS4_MASK              16U
#define ECT_TIOS_IOS5_MASK              32U
#define ECT_TIOS_IOS6_MASK              64U
#define ECT_TIOS_IOS7_MASK              128U


/*** ECT_CFORC - Timer Compare Force Register; 0x00000041 ***/
typedef union {
  byte Byte;
  struct {
    byte FOC0        :1;                                       /* Force Output Compare Action for Channel 0 */
    byte FOC1        :1;                                       /* Force Output Compare Action for Channel 1 */
    byte FOC2        :1;                                       /* Force Output Compare Action for Channel 2 */
    byte FOC3        :1;                                       /* Force Output Compare Action for Channel 3 */
    byte FOC4        :1;                                       /* Force Output Compare Action for Channel 4 */
    byte FOC5        :1;                                       /* Force Output Compare Action for Channel 5 */
    byte FOC6        :1;                                       /* Force Output Compare Action for Channel 6 */
    byte FOC7        :1;                                       /* Force Output Compare Action for Channel 7 */
  } Bits;
} ECT_CFORCSTR;
extern volatile ECT_CFORCSTR _ECT_CFORC @(REG_BASE + 0x00000041UL);
#define ECT_CFORC                       _ECT_CFORC.Byte
#define ECT_CFORC_FOC0                  _ECT_CFORC.Bits.FOC0
#define ECT_CFORC_FOC1                  _ECT_CFORC.Bits.FOC1
#define ECT_CFORC_FOC2                  _ECT_CFORC.Bits.FOC2
#define ECT_CFORC_FOC3                  _ECT_CFORC.Bits.FOC3
#define ECT_CFORC_FOC4                  _ECT_CFORC.Bits.FOC4
#define ECT_CFORC_FOC5                  _ECT_CFORC.Bits.FOC5
#define ECT_CFORC_FOC6                  _ECT_CFORC.Bits.FOC6
#define ECT_CFORC_FOC7                  _ECT_CFORC.Bits.FOC7

#define ECT_CFORC_FOC0_MASK             1U
#define ECT_CFORC_FOC1_MASK             2U
#define ECT_CFORC_FOC2_MASK             4U
#define ECT_CFORC_FOC3_MASK             8U
#define ECT_CFORC_FOC4_MASK             16U
#define ECT_CFORC_FOC5_MASK             32U
#define ECT_CFORC_FOC6_MASK             64U
#define ECT_CFORC_FOC7_MASK             128U


/*** ECT_OC7M - Output Compare 7 Mask Register; 0x00000042 ***/
typedef union {
  byte Byte;
  struct {
    byte OC7M0       :1;                                       /* Output Compare 7 Mask Bit 0 */
    byte OC7M1       :1;                                       /* Output Compare 7 Mask Bit 1 */
    byte OC7M2       :1;                                       /* Output Compare 7 Mask Bit 2 */
    byte OC7M3       :1;                                       /* Output Compare 7 Mask Bit 3 */
    byte OC7M4       :1;                                       /* Output Compare 7 Mask Bit 4 */
    byte OC7M5       :1;                                       /* Output Compare 7 Mask Bit 5 */
    byte OC7M6       :1;                                       /* Output Compare 7 Mask Bit 6 */
    byte OC7M7       :1;                                       /* Output Compare 7 Mask Bit 7 */
  } Bits;
} ECT_OC7MSTR;
extern volatile ECT_OC7MSTR _ECT_OC7M @(REG_BASE + 0x00000042UL);
#define ECT_OC7M                        _ECT_OC7M.Byte
#define ECT_OC7M_OC7M0                  _ECT_OC7M.Bits.OC7M0
#define ECT_OC7M_OC7M1                  _ECT_OC7M.Bits.OC7M1
#define ECT_OC7M_OC7M2                  _ECT_OC7M.Bits.OC7M2
#define ECT_OC7M_OC7M3                  _ECT_OC7M.Bits.OC7M3
#define ECT_OC7M_OC7M4                  _ECT_OC7M.Bits.OC7M4
#define ECT_OC7M_OC7M5                  _ECT_OC7M.Bits.OC7M5
#define ECT_OC7M_OC7M6                  _ECT_OC7M.Bits.OC7M6
#define ECT_OC7M_OC7M7                  _ECT_OC7M.Bits.OC7M7

