frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
/*** ECT_TC0 - Timer Input Capture/Output Compare Register 0; 0x00000050 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC0Hi - Timer Input Capture/Output Compare Register 0 High; 0x00000050 ***/
    union {
      byte Byte;
    } ECT_TC0HiSTR;
    #define ECT_TC0Hi                   _ECT_TC0.Overlap_STR.ECT_TC0HiSTR.Byte
    

    /*** ECT_TC0Lo - Timer Input Capture/Output Compare Register 0 Low; 0x00000051 ***/
    union {
      byte Byte;
    } ECT_TC0LoSTR;
    #define ECT_TC0Lo                   _ECT_TC0.Overlap_STR.ECT_TC0LoSTR.Byte
    
  } Overlap_STR;

} ECT_TC0STR;
extern volatile ECT_TC0STR _ECT_TC0 @(REG_BASE + 0x00000050UL);
#define ECT_TC0                         _ECT_TC0.Word
/* ECT_TC_ARR: Access 8 ECT_TCx registers in an array */
#define ECT_TC_ARR                      ((volatile word *) &ECT_TC0)


/*** ECT_TC1 - Timer Input Capture/Output Compare Register 1; 0x00000052 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC1Hi - Timer Input Capture/Output Compare Register 1 High; 0x00000052 ***/
    union {
      byte Byte;
    } ECT_TC1HiSTR;
    #define ECT_TC1Hi                   _ECT_TC1.Overlap_STR.ECT_TC1HiSTR.Byte
    

    /*** ECT_TC1Lo - Timer Input Capture/Output Compare Register 1 Low; 0x00000053 ***/
    union {
      byte Byte;
    } ECT_TC1LoSTR;
    #define ECT_TC1Lo                   _ECT_TC1.Overlap_STR.ECT_TC1LoSTR.Byte
    
  } Overlap_STR;

} ECT_TC1STR;
extern volatile ECT_TC1STR _ECT_TC1 @(REG_BASE + 0x00000052UL);
#define ECT_TC1                         _ECT_TC1.Word


/*** ECT_TC2 - Timer Input Capture/Output Compare Register 2; 0x00000054 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC2Hi - Timer Input Capture/Output Compare Register 2 High; 0x00000054 ***/
    union {
      byte Byte;
    } ECT_TC2HiSTR;
    #define ECT_TC2Hi                   _ECT_TC2.Overlap_STR.ECT_TC2HiSTR.Byte
    

    /*** ECT_TC2Lo - Timer Input Capture/Output Compare Register 2 Low; 0x00000055 ***/
    union {
      byte Byte;
    } ECT_TC2LoSTR;
    #define ECT_TC2Lo                   _ECT_TC2.Overlap_STR.ECT_TC2LoSTR.Byte
    
  } Overlap_STR;

} ECT_TC2STR;
extern volatile ECT_TC2STR _ECT_TC2 @(REG_BASE + 0x00000054UL);
#define ECT_TC2                         _ECT_TC2.Word


/*** ECT_TC3 - Timer Input Capture/Output Compare Register 3; 0x00000056 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC3Hi - Timer Input Capture/Output Compare Register 3 High; 0x00000056 ***/
    union {
      byte Byte;
    } ECT_TC3HiSTR;
    #define ECT_TC3Hi                   _ECT_TC3.Overlap_STR.ECT_TC3HiSTR.Byte
    

    /*** ECT_TC3Lo - Timer Input Capture/Output Compare Register 3 Low; 0x00000057 ***/
    union {
      byte Byte;
    } ECT_TC3LoSTR;
    #define ECT_TC3Lo                   _ECT_TC3.Overlap_STR.ECT_TC3LoSTR.Byte
    
  } Overlap_STR;

} ECT_TC3STR;
extern volatile ECT_TC3STR _ECT_TC3 @(REG_BASE + 0x00000056UL);
#define ECT_TC3                         _ECT_TC3.Word


/*** ECT_TC4 - Timer Input Capture/Output Compare Register 4; 0x00000058 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC4Hi - Timer Input Capture/Output Compare Register 4 High; 0x00000058 ***/
    union {
      byte Byte;
    } ECT_TC4HiSTR;
    #define ECT_TC4Hi                   _ECT_TC4.Overlap_STR.ECT_TC4HiSTR.Byte
    

    /*** ECT_TC4Lo - Timer Input Capture/Output Compare Register 4 Low; 0x00000059 ***/
    union {
      byte Byte;
    } ECT_TC4LoSTR;
    #define ECT_TC4Lo                   _ECT_TC4.Overlap_STR.ECT_TC4LoSTR.Byte
    
  } Overlap_STR;

} ECT_TC4STR;
extern volatile ECT_TC4STR _ECT_TC4 @(REG_BASE + 0x00000058UL);
#define ECT_TC4                         _ECT_TC4.Word


/*** ECT_TC5 - Timer Input Capture/Output Compare Register 5; 0x0000005A ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC5Hi - Timer Input Capture/Output Compare Register 5 High; 0x0000005A ***/
    union {
      byte Byte;
    } ECT_TC5HiSTR;
    #define ECT_TC5Hi                   _ECT_TC5.Overlap_STR.ECT_TC5HiSTR.Byte
    

    /*** ECT_TC5Lo - Timer Input Capture/Output Compare Register 5 Low; 0x0000005B ***/
    union {
      byte Byte;
    } ECT_TC5LoSTR;
    #define ECT_TC5Lo                   _ECT_TC5.Overlap_STR.ECT_TC5LoSTR.Byte
    
  } Overlap_STR;

} ECT_TC5STR;
extern volatile ECT_TC5STR _ECT_TC5 @(REG_BASE + 0x0000005AUL);
#define ECT_TC5                         _ECT_TC5.Word


/*** ECT_TC6 - Timer Input Capture/Output Compare Register 6; 0x0000005C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC6Hi - Timer Input Capture/Output Compare Register 6 High; 0x0000005C ***/
    union {
      byte Byte;
    } ECT_TC6HiSTR;
    #define ECT_TC6Hi                   _ECT_TC6.Overlap_STR.ECT_TC6HiSTR.Byte
    

    /*** ECT_TC6Lo - Timer Input Capture/Output Compare Register 6 Low; 0x0000005D ***/
    union {
      byte Byte;
    } ECT_TC6LoSTR;
    #define ECT_TC6Lo                   _ECT_TC6.Overlap_STR.ECT_TC6LoSTR.Byte
    
  } Overlap_STR;

} ECT_TC6STR;
extern volatile ECT_TC6STR _ECT_TC6 @(REG_BASE + 0x0000005CUL);
#define ECT_TC6                         _ECT_TC6.Word


/*** ECT_TC7 - Timer Input Capture/Output Compare Register 7; 0x0000005E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC7Hi - Timer Input Capture/Output Compare Register 7 High; 0x0000005E ***/
    union {
      byte Byte;
    } ECT_TC7HiSTR;
    #define ECT_TC7Hi                   _ECT_TC7.Overlap_STR.ECT_TC7HiSTR.Byte
    

    /*** ECT_TC7Lo - Timer Input Capture/Output Compare Register 7 Low; 0x0000005F ***/
    union {
      byte Byte;
    } ECT_TC7LoSTR;
    #define ECT_TC7Lo                   _ECT_TC7.Overlap_STR.ECT_TC7LoSTR.Byte
    
  } Overlap_STR;

} ECT_TC7STR;
extern volatile ECT_TC7STR _ECT_TC7 @(REG_BASE + 0x0000005EUL);
#define ECT_TC7                         _ECT_TC7.Word


/*** ECT_PACTL - 16-Bit Pulse Accumulator A Control Register; 0x00000060 ***/
typedef union {
  byte Byte;
  struct {
    byte PAI         :1;                                       /* Pulse Accumulator Input Interrupt enable */
    byte PAOVI       :1;                                       /* Pulse Accumulator A Overflow Interrupt enable */
    byte CLK0        :1;                                       /* Clock Select Bit 0 */
    byte CLK1        :1;                                       /* Clock Select Bit 1 */
    byte PEDGE       :1;                                       /* Pulse Accumulator Edge Control */
    byte PAMOD       :1;                                       /* Pulse Accumulator Mode */
    byte PAEN        :1;                                       /* Pulse Accumulator A System Enable */
    byte             :1; 
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpCLK  :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ECT_PACTLSTR;
