frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
/*** ECT_DLYCT - Delay Counter Control Register; 0x00000069 ***/
typedef union {
  byte Byte;
  struct {
    byte DLY0        :1;                                       /* Delay Counter Select 0 */
    byte DLY1        :1;                                       /* Delay Counter Select 1 */
    byte DLY2        :1;                                       /* Delay Counter Select 2 */
    byte DLY3        :1;                                       /* Delay Counter Select 3 */
    byte DLY4        :1;                                       /* Delay Counter Select 4 */
    byte DLY5        :1;                                       /* Delay Counter Select 5 */
    byte DLY6        :1;                                       /* Delay Counter Select 6 */
    byte DLY7        :1;                                       /* Delay Counter Select 7 */
  } Bits;
} ECT_DLYCTSTR;
extern volatile ECT_DLYCTSTR _ECT_DLYCT @(REG_BASE + 0x00000069UL);
#define ECT_DLYCT                       _ECT_DLYCT.Byte
#define ECT_DLYCT_DLY0                  _ECT_DLYCT.Bits.DLY0
#define ECT_DLYCT_DLY1                  _ECT_DLYCT.Bits.DLY1
#define ECT_DLYCT_DLY2                  _ECT_DLYCT.Bits.DLY2
#define ECT_DLYCT_DLY3                  _ECT_DLYCT.Bits.DLY3
#define ECT_DLYCT_DLY4                  _ECT_DLYCT.Bits.DLY4
#define ECT_DLYCT_DLY5                  _ECT_DLYCT.Bits.DLY5
#define ECT_DLYCT_DLY6                  _ECT_DLYCT.Bits.DLY6
#define ECT_DLYCT_DLY7                  _ECT_DLYCT.Bits.DLY7

#define ECT_DLYCT_DLY0_MASK             1U
#define ECT_DLYCT_DLY1_MASK             2U
#define ECT_DLYCT_DLY2_MASK             4U
#define ECT_DLYCT_DLY3_MASK             8U
#define ECT_DLYCT_DLY4_MASK             16U
#define ECT_DLYCT_DLY5_MASK             32U
#define ECT_DLYCT_DLY6_MASK             64U
#define ECT_DLYCT_DLY7_MASK             128U


/*** ECT_ICOVW - Input Control Overwrite Register; 0x0000006A ***/
typedef union {
  byte Byte;
  struct {
    byte NOVW0       :1;                                       /* No Input Capture Overwrite 0 */
    byte NOVW1       :1;                                       /* No Input Capture Overwrite 1 */
    byte NOVW2       :1;                                       /* No Input Capture Overwrite 2 */
    byte NOVW3       :1;                                       /* No Input Capture Overwrite 3 */
    byte NOVW4       :1;                                       /* No Input Capture Overwrite 4 */
    byte NOVW5       :1;                                       /* No Input Capture Overwrite 5 */
    byte NOVW6       :1;                                       /* No Input Capture Overwrite 6 */
    byte NOVW7       :1;                                       /* No Input Capture Overwrite 7 */
  } Bits;
} ECT_ICOVWSTR;
extern volatile ECT_ICOVWSTR _ECT_ICOVW @(REG_BASE + 0x0000006AUL);
#define ECT_ICOVW                       _ECT_ICOVW.Byte
#define ECT_ICOVW_NOVW0                 _ECT_ICOVW.Bits.NOVW0
#define ECT_ICOVW_NOVW1                 _ECT_ICOVW.Bits.NOVW1
#define ECT_ICOVW_NOVW2                 _ECT_ICOVW.Bits.NOVW2
#define ECT_ICOVW_NOVW3                 _ECT_ICOVW.Bits.NOVW3
#define ECT_ICOVW_NOVW4                 _ECT_ICOVW.Bits.NOVW4
#define ECT_ICOVW_NOVW5                 _ECT_ICOVW.Bits.NOVW5
#define ECT_ICOVW_NOVW6                 _ECT_ICOVW.Bits.NOVW6
#define ECT_ICOVW_NOVW7                 _ECT_ICOVW.Bits.NOVW7

#define ECT_ICOVW_NOVW0_MASK            1U
#define ECT_ICOVW_NOVW1_MASK            2U
#define ECT_ICOVW_NOVW2_MASK            4U
#define ECT_ICOVW_NOVW3_MASK            8U
#define ECT_ICOVW_NOVW4_MASK            16U
#define ECT_ICOVW_NOVW5_MASK            32U
#define ECT_ICOVW_NOVW6_MASK            64U
#define ECT_ICOVW_NOVW7_MASK            128U


/*** ECT_ICSYS - Input Control System Control Register; 0x0000006B ***/
typedef union {
  byte Byte;
  struct {
    byte LATQ        :1;                                       /* Input Control Latch or Queue Mode Enable */
    byte BUFEN       :1;                                       /* IC Buffer Enable */
    byte PACMX       :1;                                       /* 8-Bit Pulse Accumulators Maximum Count */
    byte TFMOD       :1;                                       /* Timer Flag-setting Mode */
    byte SH04        :1;                                       /* Share Input action of Input Capture Channels 0 and 4 */
    byte SH15        :1;                                       /* Share Input action of Input Capture Channels 1 and 5 */
    byte SH26        :1;                                       /* Share Input action of Input Capture Channels 2 and 6 */
    byte SH37        :1;                                       /* Share Input action of Input Capture Channels 3 and 7 */
  } Bits;
} ECT_ICSYSSTR;
extern volatile ECT_ICSYSSTR _ECT_ICSYS @(REG_BASE + 0x0000006BUL);
#define ECT_ICSYS                       _ECT_ICSYS.Byte
#define ECT_ICSYS_LATQ                  _ECT_ICSYS.Bits.LATQ
#define ECT_ICSYS_BUFEN                 _ECT_ICSYS.Bits.BUFEN
#define ECT_ICSYS_PACMX                 _ECT_ICSYS.Bits.PACMX
#define ECT_ICSYS_TFMOD                 _ECT_ICSYS.Bits.TFMOD
#define ECT_ICSYS_SH04                  _ECT_ICSYS.Bits.SH04
#define ECT_ICSYS_SH15                  _ECT_ICSYS.Bits.SH15
#define ECT_ICSYS_SH26                  _ECT_ICSYS.Bits.SH26
#define ECT_ICSYS_SH37                  _ECT_ICSYS.Bits.SH37

#define ECT_ICSYS_LATQ_MASK             1U
#define ECT_ICSYS_BUFEN_MASK            2U
#define ECT_ICSYS_PACMX_MASK            4U
#define ECT_ICSYS_TFMOD_MASK            8U
#define ECT_ICSYS_SH04_MASK             16U
#define ECT_ICSYS_SH15_MASK             32U
#define ECT_ICSYS_SH26_MASK             64U
#define ECT_ICSYS_SH37_MASK             128U


/*** ECT_OCPD - Output Compare Pin Disconnect Register; 0x0000006C ***/
typedef union {
  byte Byte;
  struct {
    byte OCPD0       :1;                                       /* Output Compare Pin Disconnect Bit 0 */
    byte OCPD1       :1;                                       /* Output Compare Pin Disconnect Bit 1 */
    byte OCPD2       :1;                                       /* Output Compare Pin Disconnect Bit 2 */
    byte OCPD3       :1;                                       /* Output Compare Pin Disconnect Bit 3 */
    byte OCPD4       :1;                                       /* Output Compare Pin Disconnect Bit 4 */
    byte OCPD5       :1;                                       /* Output Compare Pin Disconnect Bit 5 */
    byte OCPD6       :1;                                       /* Output Compare Pin Disconnect Bit 6 */
    byte OCPD7       :1;                                       /* Output Compare Pin Disconnect Bit 7 */
  } Bits;
} ECT_OCPDSTR;
extern volatile ECT_OCPDSTR _ECT_OCPD @(REG_BASE + 0x0000006CUL);
#define ECT_OCPD                        _ECT_OCPD.Byte
#define ECT_OCPD_OCPD0                  _ECT_OCPD.Bits.OCPD0
#define ECT_OCPD_OCPD1                  _ECT_OCPD.Bits.OCPD1
#define ECT_OCPD_OCPD2                  _ECT_OCPD.Bits.OCPD2
#define ECT_OCPD_OCPD3                  _ECT_OCPD.Bits.OCPD3
#define ECT_OCPD_OCPD4                  _ECT_OCPD.Bits.OCPD4
#define ECT_OCPD_OCPD5                  _ECT_OCPD.Bits.OCPD5
#define ECT_OCPD_OCPD6                  _ECT_OCPD.Bits.OCPD6
#define ECT_OCPD_OCPD7                  _ECT_OCPD.Bits.OCPD7

#define ECT_OCPD_OCPD0_MASK             1U
#define ECT_OCPD_OCPD1_MASK             2U
#define ECT_OCPD_OCPD2_MASK             4U
#define ECT_OCPD_OCPD3_MASK             8U
#define ECT_OCPD_OCPD4_MASK             16U
#define ECT_OCPD_OCPD5_MASK             32U
#define ECT_OCPD_OCPD6_MASK             64U
#define ECT_OCPD_OCPD7_MASK             128U


/*** ECT_PTPSR - Precision Timer Prescaler Select Register; 0x0000006E ***/
typedef union {
  byte Byte;
  struct {
    byte PTPS0       :1;                                       /* Precision Timer Prescaler Select, bit 0 */
    byte PTPS1       :1;                                       /* Precision Timer Prescaler Select, bit 1 */
    byte PTPS2       :1;                                       /* Precision Timer Prescaler Select, bit 2 */
    byte PTPS3       :1;                                       /* Precision Timer Prescaler Select, bit 3 */
    byte PTPS4       :1;                                       /* Precision Timer Prescaler Select, bit 4 */
    byte PTPS5       :1;                                       /* Precision Timer Prescaler Select, bit 5 */
    byte PTPS6       :1;                                       /* Precision Timer Prescaler Select, bit 6 */
    byte PTPS7       :1;                                       /* Precision Timer Prescaler Select, bit 7 */
  } Bits;
} ECT_PTPSRSTR;
extern volatile ECT_PTPSRSTR _ECT_PTPSR @(REG_BASE + 0x0000006EUL);
#define ECT_PTPSR                       _ECT_PTPSR.Byte
#define ECT_PTPSR_PTPS0                 _ECT_PTPSR.Bits.PTPS0
#define ECT_PTPSR_PTPS1                 _ECT_PTPSR.Bits.PTPS1
#define ECT_PTPSR_PTPS2                 _ECT_PTPSR.Bits.PTPS2
#define ECT_PTPSR_PTPS3                 _ECT_PTPSR.Bits.PTPS3
#define ECT_PTPSR_PTPS4                 _ECT_PTPSR.Bits.PTPS4
#define ECT_PTPSR_PTPS5                 _ECT_PTPSR.Bits.PTPS5
#define ECT_PTPSR_PTPS6                 _ECT_PTPSR.Bits.PTPS6
#define ECT_PTPSR_PTPS7                 _ECT_PTPSR.Bits.PTPS7

#define ECT_PTPSR_PTPS0_MASK            1U
#define ECT_PTPSR_PTPS1_MASK            2U
#define ECT_PTPSR_PTPS2_MASK            4U
#define ECT_PTPSR_PTPS3_MASK            8U
#define ECT_PTPSR_PTPS4_MASK            16U
#define ECT_PTPSR_PTPS5_MASK            32U
#define ECT_PTPSR_PTPS6_MASK            64U
#define ECT_PTPSR_PTPS7_MASK            128U


