frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
/*** ECT_PTMCPSR - Precision Timer Modulus Counter Prescaler Select Register; 0x0000006F ***/
typedef union {
  byte Byte;
  struct {
    byte PTMPS0      :1;                                       /* Precision Timer Modulus Counter Prescaler Select, bit 0 */
    byte PTMPS1      :1;                                       /* Precision Timer Modulus Counter Prescaler Select, bit 1 */
    byte PTMPS2      :1;                                       /* Precision Timer Modulus Counter Prescaler Select, bit 2 */
    byte PTMPS3      :1;                                       /* Precision Timer Modulus Counter Prescaler Select, bit 3 */
    byte PTMPS4      :1;                                       /* Precision Timer Modulus Counter Prescaler Select, bit 4 */
    byte PTMPS5      :1;                                       /* Precision Timer Modulus Counter Prescaler Select, bit 5 */
    byte PTMPS6      :1;                                       /* Precision Timer Modulus Counter Prescaler Select, bit 6 */
    byte PTMPS7      :1;                                       /* Precision Timer Modulus Counter Prescaler Select, bit 7 */
  } Bits;
} ECT_PTMCPSRSTR;
extern volatile ECT_PTMCPSRSTR _ECT_PTMCPSR @(REG_BASE + 0x0000006FUL);
#define ECT_PTMCPSR                     _ECT_PTMCPSR.Byte
#define ECT_PTMCPSR_PTMPS0              _ECT_PTMCPSR.Bits.PTMPS0
#define ECT_PTMCPSR_PTMPS1              _ECT_PTMCPSR.Bits.PTMPS1
#define ECT_PTMCPSR_PTMPS2              _ECT_PTMCPSR.Bits.PTMPS2
#define ECT_PTMCPSR_PTMPS3              _ECT_PTMCPSR.Bits.PTMPS3
#define ECT_PTMCPSR_PTMPS4              _ECT_PTMCPSR.Bits.PTMPS4
#define ECT_PTMCPSR_PTMPS5              _ECT_PTMCPSR.Bits.PTMPS5
#define ECT_PTMCPSR_PTMPS6              _ECT_PTMCPSR.Bits.PTMPS6
#define ECT_PTMCPSR_PTMPS7              _ECT_PTMCPSR.Bits.PTMPS7

#define ECT_PTMCPSR_PTMPS0_MASK         1U
#define ECT_PTMCPSR_PTMPS1_MASK         2U
#define ECT_PTMCPSR_PTMPS2_MASK         4U
#define ECT_PTMCPSR_PTMPS3_MASK         8U
#define ECT_PTMCPSR_PTMPS4_MASK         16U
#define ECT_PTMCPSR_PTMPS5_MASK         32U
#define ECT_PTMCPSR_PTMPS6_MASK         64U
#define ECT_PTMCPSR_PTMPS7_MASK         128U


/*** ECT_PBCTL - 16-Bit Pulse Accumulator B Control Register; 0x00000070 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte PBOVI       :1;                                       /* Pulse Accumulator B Overflow Interrupt enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PBEN        :1;                                       /* Pulse Accumulator B System Enable */
    byte             :1; 
  } Bits;
} ECT_PBCTLSTR;
extern volatile ECT_PBCTLSTR _ECT_PBCTL @(REG_BASE + 0x00000070UL);
#define ECT_PBCTL                       _ECT_PBCTL.Byte
#define ECT_PBCTL_PBOVI                 _ECT_PBCTL.Bits.PBOVI
#define ECT_PBCTL_PBEN                  _ECT_PBCTL.Bits.PBEN

#define ECT_PBCTL_PBOVI_MASK            2U
#define ECT_PBCTL_PBEN_MASK             64U


/*** ECT_PBFLG - Pulse Accumulator B Flag Register; 0x00000071 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte PBOVF       :1;                                       /* Pulse Accumulator B Overflow Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} ECT_PBFLGSTR;
extern volatile ECT_PBFLGSTR _ECT_PBFLG @(REG_BASE + 0x00000071UL);
#define ECT_PBFLG                       _ECT_PBFLG.Byte
#define ECT_PBFLG_PBOVF                 _ECT_PBFLG.Bits.PBOVF

#define ECT_PBFLG_PBOVF_MASK            2U


/*** ECT_PA32H - 8-Bit Pulse Accumulators Holding 32 Register; 0x00000072 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_PA3H - 8-Bit Pulse Accumulators Holding 3 Register; 0x00000072 ***/
    union {
      byte Byte;
    } ECT_PA3HSTR;
    #define ECT_PA3H                    _ECT_PA32H.Overlap_STR.ECT_PA3HSTR.Byte
    

    /*** ECT_PA2H - 8-Bit Pulse Accumulators Holding 2 Register; 0x00000073 ***/
    union {
      byte Byte;
    } ECT_PA2HSTR;
    #define ECT_PA2H                    _ECT_PA32H.Overlap_STR.ECT_PA2HSTR.Byte
    
  } Overlap_STR;

} ECT_PA32HSTR;
extern volatile ECT_PA32HSTR _ECT_PA32H @(REG_BASE + 0x00000072UL);
#define ECT_PA32H                       _ECT_PA32H.Word


/*** ECT_PA10H - 8-Bit Pulse Accumulators Holding 10 Register; 0x00000074 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_PA1H - 8-Bit Pulse Accumulators Holding 1 Register; 0x00000074 ***/
    union {
      byte Byte;
    } ECT_PA1HSTR;
    #define ECT_PA1H                    _ECT_PA10H.Overlap_STR.ECT_PA1HSTR.Byte
    

    /*** ECT_PA0H - 8-Bit Pulse Accumulators Holding 0 Register; 0x00000075 ***/
    union {
      byte Byte;
    } ECT_PA0HSTR;
    #define ECT_PA0H                    _ECT_PA10H.Overlap_STR.ECT_PA0HSTR.Byte
    
  } Overlap_STR;

} ECT_PA10HSTR;
extern volatile ECT_PA10HSTR _ECT_PA10H @(REG_BASE + 0x00000074UL);
#define ECT_PA10H                       _ECT_PA10H.Word


/*** ECT_MCCNT - Modulus Down-Counter Count Register; 0x00000076 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_MCCNThi - Modulus Down-Counter Count Register High; 0x00000076 ***/
    union {
      byte Byte;
    } ECT_MCCNThiSTR;
    #define ECT_MCCNThi                 _ECT_MCCNT.Overlap_STR.ECT_MCCNThiSTR.Byte
    

    /*** ECT_MCCNTlo - Modulus Down-Counter Count Register Low; 0x00000077 ***/
    union {
      byte Byte;
    } ECT_MCCNTloSTR;
    #define ECT_MCCNTlo                 _ECT_MCCNT.Overlap_STR.ECT_MCCNTloSTR.Byte
    
  } Overlap_STR;

} ECT_MCCNTSTR;
extern volatile ECT_MCCNTSTR _ECT_MCCNT @(REG_BASE + 0x00000076UL);
#define ECT_MCCNT                       _ECT_MCCNT.Word


/*** ECT_TC0H - Timer Input Capture Holding Registers 0; 0x00000078 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC0Hhi - Timer Input Capture Holding Registers High; 0x00000078 ***/
    union {
      byte Byte;
    } ECT_TC0HhiSTR;
    #define ECT_TC0Hhi                  _ECT_TC0H.Overlap_STR.ECT_TC0HhiSTR.Byte
    

    /*** ECT_TC0Hlo - Timer Input Capture Holding Registers 0 Low; 0x00000079 ***/
    union {
      byte Byte;
    } ECT_TC0HloSTR;
    #define ECT_TC0Hlo                  _ECT_TC0H.Overlap_STR.ECT_TC0HloSTR.Byte
    
  } Overlap_STR;

