frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
    #define ATD1CMPEH_CMPE8_MASK        1U
    #define ATD1CMPEH_CMPE9_MASK        2U
    #define ATD1CMPEH_CMPE10_MASK       4U
    #define ATD1CMPEH_CMPE11_MASK       8U
    #define ATD1CMPEH_CMPE12_MASK       16U
    #define ATD1CMPEH_CMPE13_MASK       32U
    #define ATD1CMPEH_CMPE14_MASK       64U
    #define ATD1CMPEH_CMPE15_MASK       128U
    

    /*** ATD1CMPEL - ATD 1 Compare Enable Register Low; 0x00000089 ***/
    union {
      byte Byte;
      struct {
        byte CMPE0       :1;                                       /* Compare Enable for Conversion Number 0 of a Sequence */
        byte CMPE1       :1;                                       /* Compare Enable for Conversion Number 1 of a Sequence */
        byte CMPE2       :1;                                       /* Compare Enable for Conversion Number 2 of a Sequence */
        byte CMPE3       :1;                                       /* Compare Enable for Conversion Number 3 of a Sequence */
        byte CMPE4       :1;                                       /* Compare Enable for Conversion Number 4 of a Sequence */
        byte CMPE5       :1;                                       /* Compare Enable for Conversion Number 5 of a Sequence */
        byte CMPE6       :1;                                       /* Compare Enable for Conversion Number 6 of a Sequence */
        byte CMPE7       :1;                                       /* Compare Enable for Conversion Number 7 of a Sequence */
      } Bits;
    } ATD1CMPELSTR;
    #define ATD1CMPEL                   _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Byte
    #define ATD1CMPEL_CMPE0             _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Bits.CMPE0
    #define ATD1CMPEL_CMPE1             _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Bits.CMPE1
    #define ATD1CMPEL_CMPE2             _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Bits.CMPE2
    #define ATD1CMPEL_CMPE3             _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Bits.CMPE3
    #define ATD1CMPEL_CMPE4             _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Bits.CMPE4
    #define ATD1CMPEL_CMPE5             _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Bits.CMPE5
    #define ATD1CMPEL_CMPE6             _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Bits.CMPE6
    #define ATD1CMPEL_CMPE7             _ATD1CMPE.Overlap_STR.ATD1CMPELSTR.Bits.CMPE7
    
    #define ATD1CMPEL_CMPE0_MASK        1U
    #define ATD1CMPEL_CMPE1_MASK        2U
    #define ATD1CMPEL_CMPE2_MASK        4U
    #define ATD1CMPEL_CMPE3_MASK        8U
    #define ATD1CMPEL_CMPE4_MASK        16U
    #define ATD1CMPEL_CMPE5_MASK        32U
    #define ATD1CMPEL_CMPE6_MASK        64U
    #define ATD1CMPEL_CMPE7_MASK        128U
    
  } Overlap_STR;

  struct {
    word CMPE0       :1;                                       /* Compare Enable for Conversion Number 0 of a Sequence */
    word CMPE1       :1;                                       /* Compare Enable for Conversion Number 1 of a Sequence */
    word CMPE2       :1;                                       /* Compare Enable for Conversion Number 2 of a Sequence */
    word CMPE3       :1;                                       /* Compare Enable for Conversion Number 3 of a Sequence */
    word CMPE4       :1;                                       /* Compare Enable for Conversion Number 4 of a Sequence */
    word CMPE5       :1;                                       /* Compare Enable for Conversion Number 5 of a Sequence */
    word CMPE6       :1;                                       /* Compare Enable for Conversion Number 6 of a Sequence */
    word CMPE7       :1;                                       /* Compare Enable for Conversion Number 7 of a Sequence */
    word CMPE8       :1;                                       /* Compare Enable for Conversion Number 8 of a Sequence */
    word CMPE9       :1;                                       /* Compare Enable for Conversion Number 9 of a Sequence */
    word CMPE10      :1;                                       /* Compare Enable for Conversion Number 10 of a Sequence */
    word CMPE11      :1;                                       /* Compare Enable for Conversion Number 11 of a Sequence */
    word CMPE12      :1;                                       /* Compare Enable for Conversion Number 12 of a Sequence */
    word CMPE13      :1;                                       /* Compare Enable for Conversion Number 13 of a Sequence */
    word CMPE14      :1;                                       /* Compare Enable for Conversion Number 14 of a Sequence */
    word CMPE15      :1;                                       /* Compare Enable for Conversion Number 15 of a Sequence */
  } Bits;
} ATD1CMPESTR;
extern volatile ATD1CMPESTR _ATD1CMPE @(REG_BASE + 0x00000088UL);
#define ATD1CMPE                        _ATD1CMPE.Word
#define ATD1CMPE_CMPE0                  _ATD1CMPE.Bits.CMPE0
#define ATD1CMPE_CMPE1                  _ATD1CMPE.Bits.CMPE1
#define ATD1CMPE_CMPE2                  _ATD1CMPE.Bits.CMPE2
#define ATD1CMPE_CMPE3                  _ATD1CMPE.Bits.CMPE3
#define ATD1CMPE_CMPE4                  _ATD1CMPE.Bits.CMPE4
#define ATD1CMPE_CMPE5                  _ATD1CMPE.Bits.CMPE5
#define ATD1CMPE_CMPE6                  _ATD1CMPE.Bits.CMPE6
#define ATD1CMPE_CMPE7                  _ATD1CMPE.Bits.CMPE7
#define ATD1CMPE_CMPE8                  _ATD1CMPE.Bits.CMPE8
#define ATD1CMPE_CMPE9                  _ATD1CMPE.Bits.CMPE9
#define ATD1CMPE_CMPE10                 _ATD1CMPE.Bits.CMPE10
#define ATD1CMPE_CMPE11                 _ATD1CMPE.Bits.CMPE11
#define ATD1CMPE_CMPE12                 _ATD1CMPE.Bits.CMPE12
#define ATD1CMPE_CMPE13                 _ATD1CMPE.Bits.CMPE13
#define ATD1CMPE_CMPE14                 _ATD1CMPE.Bits.CMPE14
#define ATD1CMPE_CMPE15                 _ATD1CMPE.Bits.CMPE15

#define ATD1CMPE_CMPE0_MASK             1U
#define ATD1CMPE_CMPE1_MASK             2U
#define ATD1CMPE_CMPE2_MASK             4U
#define ATD1CMPE_CMPE3_MASK             8U
#define ATD1CMPE_CMPE4_MASK             16U
#define ATD1CMPE_CMPE5_MASK             32U
#define ATD1CMPE_CMPE6_MASK             64U
#define ATD1CMPE_CMPE7_MASK             128U
#define ATD1CMPE_CMPE8_MASK             256U
#define ATD1CMPE_CMPE9_MASK             512U
#define ATD1CMPE_CMPE10_MASK            1024U
#define ATD1CMPE_CMPE11_MASK            2048U
#define ATD1CMPE_CMPE12_MASK            4096U
#define ATD1CMPE_CMPE13_MASK            8192U
#define ATD1CMPE_CMPE14_MASK            16384U
#define ATD1CMPE_CMPE15_MASK            32768U


/*** ATD1STAT2 - ATD 1 Status Register 2; 0x0000008A ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1STAT2H - ATD 1 Status Register 2 High; 0x0000008A ***/
    union {
      byte Byte;
      struct {
        byte CCF8        :1;                                       /* Conversion Complete Flag 8 */
        byte CCF9        :1;                                       /* Conversion Complete Flag 9 */
        byte CCF10       :1;                                       /* Conversion Complete Flag 10 */
        byte CCF11       :1;                                       /* Conversion Complete Flag 11 */
        byte CCF12       :1;                                       /* Conversion Complete Flag 12 */
        byte CCF13       :1;                                       /* Conversion Complete Flag 13 */
        byte CCF14       :1;                                       /* Conversion Complete Flag 14 */
        byte CCF15       :1;                                       /* Conversion Complete Flag 15 */
      } Bits;
    } ATD1STAT2HSTR;
    #define ATD1STAT2H                  _ATD1STAT2.Overlap_STR.ATD1STAT2HSTR.Byte
    #define ATD1STAT2H_CCF8             _ATD1STAT2.Overlap_STR.ATD1STAT2HSTR.Bits.CCF8
    #define ATD1STAT2H_CCF9             _ATD1STAT2.Overlap_STR.ATD1STAT2HSTR.Bits.CCF9
    #define ATD1STAT2H_CCF10            _ATD1STAT2.Overlap_STR.ATD1STAT2HSTR.Bits.CCF10
    #define ATD1STAT2H_CCF11            _ATD1STAT2.Overlap_STR.ATD1STAT2HSTR.Bits.CCF11
    #define ATD1STAT2H_CCF12            _ATD1STAT2.Overlap_STR.ATD1STAT2HSTR.Bits.CCF12
    #define ATD1STAT2H_CCF13            _ATD1STAT2.Overlap_STR.ATD1STAT2HSTR.Bits.CCF13
    #define ATD1STAT2H_CCF14            _ATD1STAT2.Overlap_STR.ATD1STAT2HSTR.Bits.CCF14
    #define ATD1STAT2H_CCF15            _ATD1STAT2.Overlap_STR.ATD1STAT2HSTR.Bits.CCF15
    
    #define ATD1STAT2H_CCF8_MASK        1U
    #define ATD1STAT2H_CCF9_MASK        2U
    #define ATD1STAT2H_CCF10_MASK       4U
    #define ATD1STAT2H_CCF11_MASK       8U
    #define ATD1STAT2H_CCF12_MASK       16U
    #define ATD1STAT2H_CCF13_MASK       32U
    #define ATD1STAT2H_CCF14_MASK       64U
    #define ATD1STAT2H_CCF15_MASK       128U
    

    /*** ATD1STAT2L - ATD 1 Status Register 2 Low; 0x0000008B ***/
    union {
      byte Byte;
      struct {
        byte CCF0        :1;                                       /* Conversion Complete Flag 0 */
        byte CCF1        :1;                                       /* Conversion Complete Flag 1 */
        byte CCF2        :1;                                       /* Conversion Complete Flag 2 */
        byte CCF3        :1;                                       /* Conversion Complete Flag 3 */
        byte CCF4        :1;                                       /* Conversion Complete Flag 4 */
        byte CCF5        :1;                                       /* Conversion Complete Flag 5 */
        byte CCF6        :1;                                       /* Conversion Complete Flag 6 */
        byte CCF7        :1;                                       /* Conversion Complete Flag 7 */
      } Bits;
    } ATD1STAT2LSTR;
    #define ATD1STAT2L                  _ATD1STAT2.Overlap_STR.ATD1STAT2LSTR.Byte
    #define ATD1STAT2L_CCF0             _ATD1STAT2.Overlap_STR.ATD1STAT2LSTR.Bits.CCF0
    #define ATD1STAT2L_CCF1             _ATD1STAT2.Overlap_STR.ATD1STAT2LSTR.Bits.CCF1
    #define ATD1STAT2L_CCF2             _ATD1STAT2.Overlap_STR.ATD1STAT2LSTR.Bits.CCF2
    #define ATD1STAT2L_CCF3             _ATD1STAT2.Overlap_STR.ATD1STAT2LSTR.Bits.CCF3
    #define ATD1STAT2L_CCF4             _ATD1STAT2.Overlap_STR.ATD1STAT2LSTR.Bits.CCF4
    #define ATD1STAT2L_CCF5             _ATD1STAT2.Overlap_STR.ATD1STAT2LSTR.Bits.CCF5
    #define ATD1STAT2L_CCF6             _ATD1STAT2.Overlap_STR.ATD1STAT2LSTR.Bits.CCF6
    #define ATD1STAT2L_CCF7             _ATD1STAT2.Overlap_STR.ATD1STAT2LSTR.Bits.CCF7
    
    #define ATD1STAT2L_CCF0_MASK        1U
    #define ATD1STAT2L_CCF1_MASK        2U
    #define ATD1STAT2L_CCF2_MASK        4U
    #define ATD1STAT2L_CCF3_MASK        8U
    #define ATD1STAT2L_CCF4_MASK        16U
    #define ATD1STAT2L_CCF5_MASK        32U
    #define ATD1STAT2L_CCF6_MASK        64U
    #define ATD1STAT2L_CCF7_MASK        128U
    
  } Overlap_STR;

