frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
    #define ATD1DIENL_IEN0_MASK         1U
    #define ATD1DIENL_IEN1_MASK         2U
    #define ATD1DIENL_IEN2_MASK         4U
    #define ATD1DIENL_IEN3_MASK         8U
    #define ATD1DIENL_IEN4_MASK         16U
    #define ATD1DIENL_IEN5_MASK         32U
    #define ATD1DIENL_IEN6_MASK         64U
    #define ATD1DIENL_IEN7_MASK         128U
    
  } Overlap_STR;

  struct {
    word IEN0        :1;                                       /* ATD Digital Input Enable on channel 0 */
    word IEN1        :1;                                       /* ATD Digital Input Enable on channel 1 */
    word IEN2        :1;                                       /* ATD Digital Input Enable on channel 2 */
    word IEN3        :1;                                       /* ATD Digital Input Enable on channel 3 */
    word IEN4        :1;                                       /* ATD Digital Input Enable on channel 4 */
    word IEN5        :1;                                       /* ATD Digital Input Enable on channel 5 */
    word IEN6        :1;                                       /* ATD Digital Input Enable on channel 6 */
    word IEN7        :1;                                       /* ATD Digital Input Enable on channel 7 */
    word IEN8        :1;                                       /* ATD Digital Input Enable on channel 8 */
    word IEN9        :1;                                       /* ATD Digital Input Enable on channel 9 */
    word IEN10       :1;                                       /* ATD Digital Input Enable on channel 10 */
    word IEN11       :1;                                       /* ATD Digital Input Enable on channel 11 */
    word IEN12       :1;                                       /* ATD Digital Input Enable on channel 12 */
    word IEN13       :1;                                       /* ATD Digital Input Enable on channel 13 */
    word IEN14       :1;                                       /* ATD Digital Input Enable on channel 14 */
    word IEN15       :1;                                       /* ATD Digital Input Enable on channel 15 */
  } Bits;
} ATD1DIENSTR;
extern volatile ATD1DIENSTR _ATD1DIEN @(REG_BASE + 0x0000008CUL);
#define ATD1DIEN                        _ATD1DIEN.Word
#define ATD1DIEN_IEN0                   _ATD1DIEN.Bits.IEN0
#define ATD1DIEN_IEN1                   _ATD1DIEN.Bits.IEN1
#define ATD1DIEN_IEN2                   _ATD1DIEN.Bits.IEN2
#define ATD1DIEN_IEN3                   _ATD1DIEN.Bits.IEN3
#define ATD1DIEN_IEN4                   _ATD1DIEN.Bits.IEN4
#define ATD1DIEN_IEN5                   _ATD1DIEN.Bits.IEN5
#define ATD1DIEN_IEN6                   _ATD1DIEN.Bits.IEN6
#define ATD1DIEN_IEN7                   _ATD1DIEN.Bits.IEN7
#define ATD1DIEN_IEN8                   _ATD1DIEN.Bits.IEN8
#define ATD1DIEN_IEN9                   _ATD1DIEN.Bits.IEN9
#define ATD1DIEN_IEN10                  _ATD1DIEN.Bits.IEN10
#define ATD1DIEN_IEN11                  _ATD1DIEN.Bits.IEN11
#define ATD1DIEN_IEN12                  _ATD1DIEN.Bits.IEN12
#define ATD1DIEN_IEN13                  _ATD1DIEN.Bits.IEN13
#define ATD1DIEN_IEN14                  _ATD1DIEN.Bits.IEN14
#define ATD1DIEN_IEN15                  _ATD1DIEN.Bits.IEN15

#define ATD1DIEN_IEN0_MASK              1U
#define ATD1DIEN_IEN1_MASK              2U
#define ATD1DIEN_IEN2_MASK              4U
#define ATD1DIEN_IEN3_MASK              8U
#define ATD1DIEN_IEN4_MASK              16U
#define ATD1DIEN_IEN5_MASK              32U
#define ATD1DIEN_IEN6_MASK              64U
#define ATD1DIEN_IEN7_MASK              128U
#define ATD1DIEN_IEN8_MASK              256U
#define ATD1DIEN_IEN9_MASK              512U
#define ATD1DIEN_IEN10_MASK             1024U
#define ATD1DIEN_IEN11_MASK             2048U
#define ATD1DIEN_IEN12_MASK             4096U
#define ATD1DIEN_IEN13_MASK             8192U
#define ATD1DIEN_IEN14_MASK             16384U
#define ATD1DIEN_IEN15_MASK             32768U


/*** ATD1CMPHT - ATD 1 Compare Higher Than Register; 0x0000008E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1CMPHTH - ATD 1 Compare Higher Than Register High; 0x0000008E ***/
    union {
      byte Byte;
      struct {
        byte CMPHT8      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 8 of a Sequence */
        byte CMPHT9      :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 9 of a Sequence */
        byte CMPHT10     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 10 of a Sequence */
        byte CMPHT11     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 11 of a Sequence */
        byte CMPHT12     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 12 of a Sequence */
        byte CMPHT13     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 13 of a Sequence */
        byte CMPHT14     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 14 of a Sequence */
        byte CMPHT15     :1;                                       /* Compare Operation Higher Than Enable for Conversion Number 15 of a Sequence */
      } Bits;
    } ATD1CMPHTHSTR;
    #define ATD1CMPHTH                  _ATD1CMPHT.Overlap_STR.ATD1CMPHTHSTR.Byte
    #define ATD1CMPHTH_CMPHT8           _ATD1CMPHT.Overlap_STR.ATD1CMPHTHSTR.Bits.CMPHT8
    #define ATD1CMPHTH_CMPHT9           _ATD1CMPHT.Overlap_STR.ATD1CMPHTHSTR.Bits.CMPHT9
    #define ATD1CMPHTH_CMPHT10          _ATD1CMPHT.Overlap_STR.ATD1CMPHTHSTR.Bits.CMPHT10
    #define ATD1CMPHTH_CMPHT11          _ATD1CMPHT.Overlap_STR.ATD1CMPHTHSTR.Bits.CMPHT11
    #define ATD1CMPHTH_CMPHT12          _ATD1CMPHT.Overlap_STR.ATD1CMPHTHSTR.Bits.CMPHT12
    #define ATD1CMPHTH_CMPHT13          _ATD1CMPHT.Overlap_STR.ATD1CMPHTHSTR.Bits.CMPHT13
    #define ATD1CMPHTH_CMPHT14          _ATD1CMPHT.Overlap_STR.ATD1CMPHTHSTR.Bits.CMPHT14
    #define ATD1CMPHTH_CMPHT15          _ATD1CMPHT.Overlap_STR.ATD1CMPHTHSTR.Bits.CMPHT15
    
    #define ATD1CMPHTH_CMPHT8_MASK      1U
    #define ATD1CMPHTH_CMPHT9_MASK      2U
    #define ATD1CMPHTH_CMPHT10_MASK     4U
    #define ATD1CMPHTH_CMPHT11_MASK     8U
    #define ATD1CMPHTH_CMPHT12_MASK     16U
    #define ATD1CMPHTH_CMPHT13_MASK     32U
    #define ATD1CMPHTH_CMPHT14_MASK     64U
    #define ATD1CMPHTH_CMPHT15_MASK     128U
    

