frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
#define SCI4BD_SBR0_MASK                1U
#define SCI4BD_SBR1_MASK                2U
#define SCI4BD_SBR2_MASK                4U
#define SCI4BD_SBR3_MASK                8U
#define SCI4BD_SBR4_MASK                16U
#define SCI4BD_SBR5_MASK                32U
#define SCI4BD_SBR6_MASK                64U
#define SCI4BD_SBR7_MASK                128U
#define SCI4BD_SBR8_MASK                256U
#define SCI4BD_SBR9_MASK                512U
#define SCI4BD_SBR10_MASK               1024U
#define SCI4BD_SBR11_MASK               2048U
#define SCI4BD_SBR12_MASK               4096U
#define SCI4BD_TNP0_MASK                8192U
#define SCI4BD_TNP1_MASK                16384U
#define SCI4BD_IREN_MASK                32768U
#define SCI4BD_SBR_MASK                 8191U
#define SCI4BD_SBR_BITNUM               0U
#define SCI4BD_TNP_MASK                 24576U
#define SCI4BD_TNP_BITNUM               13U


/*** SCI4ACR2 - SCI 4 Alternative Control Register 2; 0x00000132 ***/
typedef union {
  byte Byte;
  union { /* Several registers at the same address */
    /*** SCI4ACR2 - SCI 4 Alternative Control Register 2; Several registers at the same address ***/
    union {
      struct {
        byte BKDFE       :1;                                       /* Break Detect Feature Enable */
        byte BERRM0      :1;                                       /* Bit Error Mode 0 */
        byte BERRM1      :1;                                       /* Bit Error Mode 1 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte     :1;
        byte grpBERRM :2;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } SCI4ACR2STR;
    #define SCI4ACR2                    _SCI4ACR2.Byte
    #define SCI4ACR2_BKDFE              _SCI4ACR2.SameAddr_STR.SCI4ACR2STR.Bits.BKDFE
    #define SCI4ACR2_BERRM0             _SCI4ACR2.SameAddr_STR.SCI4ACR2STR.Bits.BERRM0
    #define SCI4ACR2_BERRM1             _SCI4ACR2.SameAddr_STR.SCI4ACR2STR.Bits.BERRM1
    #define SCI4ACR2_BERRM              _SCI4ACR2.SameAddr_STR.SCI4ACR2STR.MergedBits.grpBERRM
    
    #define SCI4ACR2_BKDFE_MASK         1U
    #define SCI4ACR2_BERRM0_MASK        2U
    #define SCI4ACR2_BERRM1_MASK        4U
    #define SCI4ACR2_BERRM_MASK         6U
    #define SCI4ACR2_BERRM_BITNUM       1U
    
    /*** SCI4CR1 - SCI 4 Control Register 1; Several registers at the same address ***/
    union {
      struct {
        byte PT          :1;                                       /* Parity Type Bit */
        byte PE          :1;                                       /* Parity Enable Bit */
        byte ILT         :1;                                       /* Idle Line Type Bit */
        byte WAKE        :1;                                       /* Wakeup Condition Bit */
        byte M           :1;                                       /* Data Format Mode Bit */
        byte RSRC        :1;                                       /* Receiver Source Bit */
        byte SCISWAI     :1;                                       /* SCI Stop in Wait Mode Bit */
        byte LOOPS       :1;                                       /* Loop Select Bit */
      } Bits;
    } SCI4CR1STR;
    #define SCI4CR1                     _SCI4ACR2.Byte
    #define SCI4CR1_PT                  _SCI4ACR2.SameAddr_STR.SCI4CR1STR.Bits.PT
    #define SCI4CR1_PE                  _SCI4ACR2.SameAddr_STR.SCI4CR1STR.Bits.PE
    #define SCI4CR1_ILT                 _SCI4ACR2.SameAddr_STR.SCI4CR1STR.Bits.ILT
    #define SCI4CR1_WAKE                _SCI4ACR2.SameAddr_STR.SCI4CR1STR.Bits.WAKE
    #define SCI4CR1_M                   _SCI4ACR2.SameAddr_STR.SCI4CR1STR.Bits.M
    #define SCI4CR1_RSRC                _SCI4ACR2.SameAddr_STR.SCI4CR1STR.Bits.RSRC
    #define SCI4CR1_SCISWAI             _SCI4ACR2.SameAddr_STR.SCI4CR1STR.Bits.SCISWAI
    #define SCI4CR1_LOOPS               _SCI4ACR2.SameAddr_STR.SCI4CR1STR.Bits.LOOPS
    
    #define SCI4CR1_PT_MASK             1U
    #define SCI4CR1_PE_MASK             2U
    #define SCI4CR1_ILT_MASK            4U
    #define SCI4CR1_WAKE_MASK           8U
    #define SCI4CR1_M_MASK              16U
    #define SCI4CR1_RSRC_MASK           32U
    #define SCI4CR1_SCISWAI_MASK        64U
    #define SCI4CR1_LOOPS_MASK          128U
    
  } SameAddr_STR; /*Several registers at the same address */

} SCI4ACR2STR;
extern volatile SCI4ACR2STR _SCI4ACR2 @(REG_BASE + 0x00000132UL);


/*** SCI4CR2 - SCI 4 Control Register 2; 0x00000133 ***/
typedef union {
  byte Byte;
  struct {
    byte SBK         :1;                                       /* Send Break Bit */
    byte RWU         :1;                                       /* Receiver Wakeup Bit */
    byte RE          :1;                                       /* Receiver Enable Bit */
    byte TE          :1;                                       /* Transmitter Enable Bit */
    byte ILIE        :1;                                       /* Idle Line Interrupt Enable Bit */
    byte RIE         :1;                                       /* Receiver Full Interrupt Enable Bit */
    byte TCIE        :1;                                       /* Transmission Complete Interrupt Enable Bit */
    byte TIE         :1;                                       /* Transmitter Interrupt Enable Bit */
  } Bits;
} SCI4CR2STR;
extern volatile SCI4CR2STR _SCI4CR2 @(REG_BASE + 0x00000133UL);
#define SCI4CR2                         _SCI4CR2.Byte
#define SCI4CR2_SBK                     _SCI4CR2.Bits.SBK
#define SCI4CR2_RWU                     _SCI4CR2.Bits.RWU
#define SCI4CR2_RE                      _SCI4CR2.Bits.RE
#define SCI4CR2_TE                      _SCI4CR2.Bits.TE
#define SCI4CR2_ILIE                    _SCI4CR2.Bits.ILIE
#define SCI4CR2_RIE                     _SCI4CR2.Bits.RIE
#define SCI4CR2_TCIE                    _SCI4CR2.Bits.TCIE
#define SCI4CR2_TIE                     _SCI4CR2.Bits.TIE

#define SCI4CR2_SBK_MASK                1U
#define SCI4CR2_RWU_MASK                2U
#define SCI4CR2_RE_MASK                 4U
#define SCI4CR2_TE_MASK                 8U
#define SCI4CR2_ILIE_MASK               16U
#define SCI4CR2_RIE_MASK                32U
#define SCI4CR2_TCIE_MASK               64U
#define SCI4CR2_TIE_MASK                128U


