frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
extern volatile CAN2TIERSTR _CAN2TIER @(REG_BASE + 0x000001C7UL);
#define CAN2TIER                        _CAN2TIER.Byte
#define CAN2TIER_TXEIE0                 _CAN2TIER.Bits.TXEIE0
#define CAN2TIER_TXEIE1                 _CAN2TIER.Bits.TXEIE1
#define CAN2TIER_TXEIE2                 _CAN2TIER.Bits.TXEIE2
#define CAN2TIER_TXEIE                  _CAN2TIER.MergedBits.grpTXEIE

#define CAN2TIER_TXEIE0_MASK            1U
#define CAN2TIER_TXEIE1_MASK            2U
#define CAN2TIER_TXEIE2_MASK            4U
#define CAN2TIER_TXEIE_MASK             7U
#define CAN2TIER_TXEIE_BITNUM           0U


/*** CAN2TARQ - MSCAN2 Transmitter Message Abort Request; 0x000001C8 ***/
typedef union {
  byte Byte;
  struct {
    byte ABTRQ0      :1;                                       /* Abort Request 0 */
    byte ABTRQ1      :1;                                       /* Abort Request 1 */
    byte ABTRQ2      :1;                                       /* Abort Request 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpABTRQ :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2TARQSTR;
extern volatile CAN2TARQSTR _CAN2TARQ @(REG_BASE + 0x000001C8UL);
#define CAN2TARQ                        _CAN2TARQ.Byte
#define CAN2TARQ_ABTRQ0                 _CAN2TARQ.Bits.ABTRQ0
#define CAN2TARQ_ABTRQ1                 _CAN2TARQ.Bits.ABTRQ1
#define CAN2TARQ_ABTRQ2                 _CAN2TARQ.Bits.ABTRQ2
#define CAN2TARQ_ABTRQ                  _CAN2TARQ.MergedBits.grpABTRQ

#define CAN2TARQ_ABTRQ0_MASK            1U
#define CAN2TARQ_ABTRQ1_MASK            2U
#define CAN2TARQ_ABTRQ2_MASK            4U
#define CAN2TARQ_ABTRQ_MASK             7U
#define CAN2TARQ_ABTRQ_BITNUM           0U


/*** CAN2TAAK - MSCAN2 Transmitter Message Abort Acknowledge; 0x000001C9 ***/
typedef union {
  byte Byte;
  struct {
    byte ABTAK0      :1;                                       /* Abort Acknowledge 0 */
    byte ABTAK1      :1;                                       /* Abort Acknowledge 1 */
    byte ABTAK2      :1;                                       /* Abort Acknowledge 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpABTAK :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2TAAKSTR;
extern volatile CAN2TAAKSTR _CAN2TAAK @(REG_BASE + 0x000001C9UL);
#define CAN2TAAK                        _CAN2TAAK.Byte
#define CAN2TAAK_ABTAK0                 _CAN2TAAK.Bits.ABTAK0
#define CAN2TAAK_ABTAK1                 _CAN2TAAK.Bits.ABTAK1
#define CAN2TAAK_ABTAK2                 _CAN2TAAK.Bits.ABTAK2
#define CAN2TAAK_ABTAK                  _CAN2TAAK.MergedBits.grpABTAK

#define CAN2TAAK_ABTAK0_MASK            1U
#define CAN2TAAK_ABTAK1_MASK            2U
#define CAN2TAAK_ABTAK2_MASK            4U
#define CAN2TAAK_ABTAK_MASK             7U
#define CAN2TAAK_ABTAK_BITNUM           0U


/*** CAN2TBSEL - MSCAN2 Transmit Buffer Selection; 0x000001CA ***/
typedef union {
  byte Byte;
  struct {
    byte TX0         :1;                                       /* Transmit Buffer Select 0 */
    byte TX1         :1;                                       /* Transmit Buffer Select 1 */
    byte TX2         :1;                                       /* Transmit Buffer Select 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTX   :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2TBSELSTR;
extern volatile CAN2TBSELSTR _CAN2TBSEL @(REG_BASE + 0x000001CAUL);
#define CAN2TBSEL                       _CAN2TBSEL.Byte
#define CAN2TBSEL_TX0                   _CAN2TBSEL.Bits.TX0
#define CAN2TBSEL_TX1                   _CAN2TBSEL.Bits.TX1
#define CAN2TBSEL_TX2                   _CAN2TBSEL.Bits.TX2
#define CAN2TBSEL_TX                    _CAN2TBSEL.MergedBits.grpTX

#define CAN2TBSEL_TX0_MASK              1U
#define CAN2TBSEL_TX1_MASK              2U
#define CAN2TBSEL_TX2_MASK              4U
#define CAN2TBSEL_TX_MASK               7U
#define CAN2TBSEL_TX_BITNUM             0U


/*** CAN2IDAC - MSCAN2 Identifier Acceptance Control Register; 0x000001CB ***/
typedef union {
  byte Byte;
  struct {
    byte IDHIT0      :1;                                       /* Identifier Acceptance Hit Indicator 0 */
    byte IDHIT1      :1;                                       /* Identifier Acceptance Hit Indicator 1 */
    byte IDHIT2      :1;                                       /* Identifier Acceptance Hit Indicator 2 */
    byte             :1; 
    byte IDAM0       :1;                                       /* Identifier Acceptance Mode 0 */
    byte IDAM1       :1;                                       /* Identifier Acceptance Mode 1 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpIDHIT :3;
    byte         :1;
    byte grpIDAM :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN2IDACSTR;
extern volatile CAN2IDACSTR _CAN2IDAC @(REG_BASE + 0x000001CBUL);
#define CAN2IDAC                        _CAN2IDAC.Byte
#define CAN2IDAC_IDHIT0                 _CAN2IDAC.Bits.IDHIT0
#define CAN2IDAC_IDHIT1                 _CAN2IDAC.Bits.IDHIT1
#define CAN2IDAC_IDHIT2                 _CAN2IDAC.Bits.IDHIT2
#define CAN2IDAC_IDAM0                  _CAN2IDAC.Bits.IDAM0
#define CAN2IDAC_IDAM1                  _CAN2IDAC.Bits.IDAM1
#define CAN2IDAC_IDHIT                  _CAN2IDAC.MergedBits.grpIDHIT
#define CAN2IDAC_IDAM                   _CAN2IDAC.MergedBits.grpIDAM

#define CAN2IDAC_IDHIT0_MASK            1U
#define CAN2IDAC_IDHIT1_MASK            2U
#define CAN2IDAC_IDHIT2_MASK            4U
#define CAN2IDAC_IDAM0_MASK             16U
#define CAN2IDAC_IDAM1_MASK             32U
#define CAN2IDAC_IDHIT_MASK             7U
#define CAN2IDAC_IDHIT_BITNUM           0U
#define CAN2IDAC_IDAM_MASK              48U
#define CAN2IDAC_IDAM_BITNUM            4U


/*** CAN2MISC - MSCAN2 Miscellaneous Register; 0x000001CD ***/
typedef union {
  byte Byte;
  struct {
    byte BOHOLD      :1;                                       /* Bus-off State Hold Until User Request */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} CAN2MISCSTR;
extern volatile CAN2MISCSTR _CAN2MISC @(REG_BASE + 0x000001CDUL);
#define CAN2MISC                        _CAN2MISC.Byte
#define CAN2MISC_BOHOLD                 _CAN2MISC.Bits.BOHOLD

#define CAN2MISC_BOHOLD_MASK            1U


/*** CAN2RXERR - MSCAN2 Receive Error Counter Register; 0x000001CE ***/
typedef union {
  byte Byte;
  struct {
    byte RXERR0      :1;                                       /* Bit 0 */
    byte RXERR1      :1;                                       /* Bit 1 */
    byte RXERR2      :1;                                       /* Bit 2 */
    byte RXERR3      :1;                                       /* Bit 3 */
    byte RXERR4      :1;                                       /* Bit 4 */
    byte RXERR5      :1;                                       /* Bit 5 */
    byte RXERR6      :1;                                       /* Bit 6 */
    byte RXERR7      :1;                                       /* Bit 7 */
  } Bits;
} CAN2RXERRSTR;
