frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
extern volatile CAN2IDAR2STR _CAN2IDAR2 @(REG_BASE + 0x000001D2UL);
#define CAN2IDAR2                       _CAN2IDAR2.Byte
#define CAN2IDAR2_AC0                   _CAN2IDAR2.Bits.AC0
#define CAN2IDAR2_AC1                   _CAN2IDAR2.Bits.AC1
#define CAN2IDAR2_AC2                   _CAN2IDAR2.Bits.AC2
#define CAN2IDAR2_AC3                   _CAN2IDAR2.Bits.AC3
#define CAN2IDAR2_AC4                   _CAN2IDAR2.Bits.AC4
#define CAN2IDAR2_AC5                   _CAN2IDAR2.Bits.AC5
#define CAN2IDAR2_AC6                   _CAN2IDAR2.Bits.AC6
#define CAN2IDAR2_AC7                   _CAN2IDAR2.Bits.AC7

#define CAN2IDAR2_AC0_MASK              1U
#define CAN2IDAR2_AC1_MASK              2U
#define CAN2IDAR2_AC2_MASK              4U
#define CAN2IDAR2_AC3_MASK              8U
#define CAN2IDAR2_AC4_MASK              16U
#define CAN2IDAR2_AC5_MASK              32U
#define CAN2IDAR2_AC6_MASK              64U
#define CAN2IDAR2_AC7_MASK              128U


/*** CAN2IDAR3 - MSCAN2 Identifier Acceptance Register 3; 0x000001D3 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN2IDAR3STR;
extern volatile CAN2IDAR3STR _CAN2IDAR3 @(REG_BASE + 0x000001D3UL);
#define CAN2IDAR3                       _CAN2IDAR3.Byte
#define CAN2IDAR3_AC0                   _CAN2IDAR3.Bits.AC0
#define CAN2IDAR3_AC1                   _CAN2IDAR3.Bits.AC1
#define CAN2IDAR3_AC2                   _CAN2IDAR3.Bits.AC2
#define CAN2IDAR3_AC3                   _CAN2IDAR3.Bits.AC3
#define CAN2IDAR3_AC4                   _CAN2IDAR3.Bits.AC4
#define CAN2IDAR3_AC5                   _CAN2IDAR3.Bits.AC5
#define CAN2IDAR3_AC6                   _CAN2IDAR3.Bits.AC6
#define CAN2IDAR3_AC7                   _CAN2IDAR3.Bits.AC7

#define CAN2IDAR3_AC0_MASK              1U
#define CAN2IDAR3_AC1_MASK              2U
#define CAN2IDAR3_AC2_MASK              4U
#define CAN2IDAR3_AC3_MASK              8U
#define CAN2IDAR3_AC4_MASK              16U
#define CAN2IDAR3_AC5_MASK              32U
#define CAN2IDAR3_AC6_MASK              64U
#define CAN2IDAR3_AC7_MASK              128U


/*** CAN2IDMR0 - MSCAN2 Identifier Mask Register 0; 0x000001D4 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN2IDMR0STR;
extern volatile CAN2IDMR0STR _CAN2IDMR0 @(REG_BASE + 0x000001D4UL);
#define CAN2IDMR0                       _CAN2IDMR0.Byte
#define CAN2IDMR0_AM0                   _CAN2IDMR0.Bits.AM0
#define CAN2IDMR0_AM1                   _CAN2IDMR0.Bits.AM1
#define CAN2IDMR0_AM2                   _CAN2IDMR0.Bits.AM2
#define CAN2IDMR0_AM3                   _CAN2IDMR0.Bits.AM3
#define CAN2IDMR0_AM4                   _CAN2IDMR0.Bits.AM4
#define CAN2IDMR0_AM5                   _CAN2IDMR0.Bits.AM5
#define CAN2IDMR0_AM6                   _CAN2IDMR0.Bits.AM6
#define CAN2IDMR0_AM7                   _CAN2IDMR0.Bits.AM7
/* CAN2IDMR_ARR: Access 4 CAN2IDMRx registers in an array */
#define CAN2IDMR_ARR                    ((volatile byte *) &CAN2IDMR0)

#define CAN2IDMR0_AM0_MASK              1U
#define CAN2IDMR0_AM1_MASK              2U
#define CAN2IDMR0_AM2_MASK              4U
#define CAN2IDMR0_AM3_MASK              8U
#define CAN2IDMR0_AM4_MASK              16U
#define CAN2IDMR0_AM5_MASK              32U
#define CAN2IDMR0_AM6_MASK              64U
#define CAN2IDMR0_AM7_MASK              128U


/*** CAN2IDMR1 - MSCAN2 Identifier Mask Register 1; 0x000001D5 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN2IDMR1STR;
extern volatile CAN2IDMR1STR _CAN2IDMR1 @(REG_BASE + 0x000001D5UL);
#define CAN2IDMR1                       _CAN2IDMR1.Byte
#define CAN2IDMR1_AM0                   _CAN2IDMR1.Bits.AM0
#define CAN2IDMR1_AM1                   _CAN2IDMR1.Bits.AM1
#define CAN2IDMR1_AM2                   _CAN2IDMR1.Bits.AM2
#define CAN2IDMR1_AM3                   _CAN2IDMR1.Bits.AM3
#define CAN2IDMR1_AM4                   _CAN2IDMR1.Bits.AM4
#define CAN2IDMR1_AM5                   _CAN2IDMR1.Bits.AM5
#define CAN2IDMR1_AM6                   _CAN2IDMR1.Bits.AM6
#define CAN2IDMR1_AM7                   _CAN2IDMR1.Bits.AM7

#define CAN2IDMR1_AM0_MASK              1U
#define CAN2IDMR1_AM1_MASK              2U
#define CAN2IDMR1_AM2_MASK              4U
#define CAN2IDMR1_AM3_MASK              8U
#define CAN2IDMR1_AM4_MASK              16U
#define CAN2IDMR1_AM5_MASK              32U
#define CAN2IDMR1_AM6_MASK              64U
#define CAN2IDMR1_AM7_MASK              128U


