frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
extern volatile CAN2IDAR5STR _CAN2IDAR5 @(REG_BASE + 0x000001D9UL);
#define CAN2IDAR5                       _CAN2IDAR5.Byte
#define CAN2IDAR5_AC0                   _CAN2IDAR5.Bits.AC0
#define CAN2IDAR5_AC1                   _CAN2IDAR5.Bits.AC1
#define CAN2IDAR5_AC2                   _CAN2IDAR5.Bits.AC2
#define CAN2IDAR5_AC3                   _CAN2IDAR5.Bits.AC3
#define CAN2IDAR5_AC4                   _CAN2IDAR5.Bits.AC4
#define CAN2IDAR5_AC5                   _CAN2IDAR5.Bits.AC5
#define CAN2IDAR5_AC6                   _CAN2IDAR5.Bits.AC6
#define CAN2IDAR5_AC7                   _CAN2IDAR5.Bits.AC7

#define CAN2IDAR5_AC0_MASK              1U
#define CAN2IDAR5_AC1_MASK              2U
#define CAN2IDAR5_AC2_MASK              4U
#define CAN2IDAR5_AC3_MASK              8U
#define CAN2IDAR5_AC4_MASK              16U
#define CAN2IDAR5_AC5_MASK              32U
#define CAN2IDAR5_AC6_MASK              64U
#define CAN2IDAR5_AC7_MASK              128U


/*** CAN2IDAR6 - MSCAN2 Identifier Acceptance Register 6; 0x000001DA ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN2IDAR6STR;
extern volatile CAN2IDAR6STR _CAN2IDAR6 @(REG_BASE + 0x000001DAUL);
#define CAN2IDAR6                       _CAN2IDAR6.Byte
#define CAN2IDAR6_AC0                   _CAN2IDAR6.Bits.AC0
#define CAN2IDAR6_AC1                   _CAN2IDAR6.Bits.AC1
#define CAN2IDAR6_AC2                   _CAN2IDAR6.Bits.AC2
#define CAN2IDAR6_AC3                   _CAN2IDAR6.Bits.AC3
#define CAN2IDAR6_AC4                   _CAN2IDAR6.Bits.AC4
#define CAN2IDAR6_AC5                   _CAN2IDAR6.Bits.AC5
#define CAN2IDAR6_AC6                   _CAN2IDAR6.Bits.AC6
#define CAN2IDAR6_AC7                   _CAN2IDAR6.Bits.AC7

#define CAN2IDAR6_AC0_MASK              1U
#define CAN2IDAR6_AC1_MASK              2U
#define CAN2IDAR6_AC2_MASK              4U
#define CAN2IDAR6_AC3_MASK              8U
#define CAN2IDAR6_AC4_MASK              16U
#define CAN2IDAR6_AC5_MASK              32U
#define CAN2IDAR6_AC6_MASK              64U
#define CAN2IDAR6_AC7_MASK              128U


/*** CAN2IDAR7 - MSCAN2 Identifier Acceptance Register 7; 0x000001DB ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN2IDAR7STR;
extern volatile CAN2IDAR7STR _CAN2IDAR7 @(REG_BASE + 0x000001DBUL);
#define CAN2IDAR7                       _CAN2IDAR7.Byte
#define CAN2IDAR7_AC0                   _CAN2IDAR7.Bits.AC0
#define CAN2IDAR7_AC1                   _CAN2IDAR7.Bits.AC1
#define CAN2IDAR7_AC2                   _CAN2IDAR7.Bits.AC2
#define CAN2IDAR7_AC3                   _CAN2IDAR7.Bits.AC3
#define CAN2IDAR7_AC4                   _CAN2IDAR7.Bits.AC4
#define CAN2IDAR7_AC5                   _CAN2IDAR7.Bits.AC5
#define CAN2IDAR7_AC6                   _CAN2IDAR7.Bits.AC6
#define CAN2IDAR7_AC7                   _CAN2IDAR7.Bits.AC7

#define CAN2IDAR7_AC0_MASK              1U
#define CAN2IDAR7_AC1_MASK              2U
#define CAN2IDAR7_AC2_MASK              4U
#define CAN2IDAR7_AC3_MASK              8U
#define CAN2IDAR7_AC4_MASK              16U
#define CAN2IDAR7_AC5_MASK              32U
#define CAN2IDAR7_AC6_MASK              64U
#define CAN2IDAR7_AC7_MASK              128U


/*** CAN2IDMR4 - MSCAN2 Identifier Mask Register 4; 0x000001DC ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN2IDMR4STR;
extern volatile CAN2IDMR4STR _CAN2IDMR4 @(REG_BASE + 0x000001DCUL);
#define CAN2IDMR4                       _CAN2IDMR4.Byte
#define CAN2IDMR4_AM0                   _CAN2IDMR4.Bits.AM0
#define CAN2IDMR4_AM1                   _CAN2IDMR4.Bits.AM1
#define CAN2IDMR4_AM2                   _CAN2IDMR4.Bits.AM2
#define CAN2IDMR4_AM3                   _CAN2IDMR4.Bits.AM3
#define CAN2IDMR4_AM4                   _CAN2IDMR4.Bits.AM4
#define CAN2IDMR4_AM5                   _CAN2IDMR4.Bits.AM5
#define CAN2IDMR4_AM6                   _CAN2IDMR4.Bits.AM6
#define CAN2IDMR4_AM7                   _CAN2IDMR4.Bits.AM7

