frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
#define CAN2IDMR4_AM0_MASK              1U
#define CAN2IDMR4_AM1_MASK              2U
#define CAN2IDMR4_AM2_MASK              4U
#define CAN2IDMR4_AM3_MASK              8U
#define CAN2IDMR4_AM4_MASK              16U
#define CAN2IDMR4_AM5_MASK              32U
#define CAN2IDMR4_AM6_MASK              64U
#define CAN2IDMR4_AM7_MASK              128U


/*** CAN2IDMR5 - MSCAN2 Identifier Mask Register 5; 0x000001DD ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN2IDMR5STR;
extern volatile CAN2IDMR5STR _CAN2IDMR5 @(REG_BASE + 0x000001DDUL);
#define CAN2IDMR5                       _CAN2IDMR5.Byte
#define CAN2IDMR5_AM0                   _CAN2IDMR5.Bits.AM0
#define CAN2IDMR5_AM1                   _CAN2IDMR5.Bits.AM1
#define CAN2IDMR5_AM2                   _CAN2IDMR5.Bits.AM2
#define CAN2IDMR5_AM3                   _CAN2IDMR5.Bits.AM3
#define CAN2IDMR5_AM4                   _CAN2IDMR5.Bits.AM4
#define CAN2IDMR5_AM5                   _CAN2IDMR5.Bits.AM5
#define CAN2IDMR5_AM6                   _CAN2IDMR5.Bits.AM6
#define CAN2IDMR5_AM7                   _CAN2IDMR5.Bits.AM7

#define CAN2IDMR5_AM0_MASK              1U
#define CAN2IDMR5_AM1_MASK              2U
#define CAN2IDMR5_AM2_MASK              4U
#define CAN2IDMR5_AM3_MASK              8U
#define CAN2IDMR5_AM4_MASK              16U
#define CAN2IDMR5_AM5_MASK              32U
#define CAN2IDMR5_AM6_MASK              64U
#define CAN2IDMR5_AM7_MASK              128U


/*** CAN2IDMR6 - MSCAN2 Identifier Mask Register 6; 0x000001DE ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN2IDMR6STR;
extern volatile CAN2IDMR6STR _CAN2IDMR6 @(REG_BASE + 0x000001DEUL);
#define CAN2IDMR6                       _CAN2IDMR6.Byte
#define CAN2IDMR6_AM0                   _CAN2IDMR6.Bits.AM0
#define CAN2IDMR6_AM1                   _CAN2IDMR6.Bits.AM1
#define CAN2IDMR6_AM2                   _CAN2IDMR6.Bits.AM2
#define CAN2IDMR6_AM3                   _CAN2IDMR6.Bits.AM3
#define CAN2IDMR6_AM4                   _CAN2IDMR6.Bits.AM4
#define CAN2IDMR6_AM5                   _CAN2IDMR6.Bits.AM5
#define CAN2IDMR6_AM6                   _CAN2IDMR6.Bits.AM6
#define CAN2IDMR6_AM7                   _CAN2IDMR6.Bits.AM7

#define CAN2IDMR6_AM0_MASK              1U
#define CAN2IDMR6_AM1_MASK              2U
#define CAN2IDMR6_AM2_MASK              4U
#define CAN2IDMR6_AM3_MASK              8U
#define CAN2IDMR6_AM4_MASK              16U
#define CAN2IDMR6_AM5_MASK              32U
#define CAN2IDMR6_AM6_MASK              64U
#define CAN2IDMR6_AM7_MASK              128U


/*** CAN2IDMR7 - MSCAN2 Identifier Mask Register 7; 0x000001DF ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN2IDMR7STR;
extern volatile CAN2IDMR7STR _CAN2IDMR7 @(REG_BASE + 0x000001DFUL);
#define CAN2IDMR7                       _CAN2IDMR7.Byte
#define CAN2IDMR7_AM0                   _CAN2IDMR7.Bits.AM0
#define CAN2IDMR7_AM1                   _CAN2IDMR7.Bits.AM1
#define CAN2IDMR7_AM2                   _CAN2IDMR7.Bits.AM2
#define CAN2IDMR7_AM3                   _CAN2IDMR7.Bits.AM3
#define CAN2IDMR7_AM4                   _CAN2IDMR7.Bits.AM4
#define CAN2IDMR7_AM5                   _CAN2IDMR7.Bits.AM5
#define CAN2IDMR7_AM6                   _CAN2IDMR7.Bits.AM6
#define CAN2IDMR7_AM7                   _CAN2IDMR7.Bits.AM7

#define CAN2IDMR7_AM0_MASK              1U
#define CAN2IDMR7_AM1_MASK              2U
#define CAN2IDMR7_AM2_MASK              4U
#define CAN2IDMR7_AM3_MASK              8U
#define CAN2IDMR7_AM4_MASK              16U
#define CAN2IDMR7_AM5_MASK              32U
#define CAN2IDMR7_AM6_MASK              64U
#define CAN2IDMR7_AM7_MASK              128U


/*** CAN2RXIDR0 - MSCAN2 Receive Identifier Register 0; 0x000001E0 ***/
typedef union {
  byte Byte;
  struct {
    byte ID21        :1;                                       /* Extended format identifier Bit 21 */
    byte ID22        :1;                                       /* Extended format identifier Bit 22 */
    byte ID23        :1;                                       /* Extended format identifier Bit 23 */
    byte ID24        :1;                                       /* Extended format identifier Bit 24 */
    byte ID25        :1;                                       /* Extended format identifier Bit 25 */
    byte ID26        :1;                                       /* Extended format identifier Bit 26 */
    byte ID27        :1;                                       /* Extended format identifier Bit 27 */
    byte ID28        :1;                                       /* Extended format identifier Bit 28 */
  } Bits;
} CAN2RXIDR0STR;
extern volatile CAN2RXIDR0STR _CAN2RXIDR0 @(REG_BASE + 0x000001E0UL);
#define CAN2RXIDR0                      _CAN2RXIDR0.Byte
#define CAN2RXIDR0_ID21                 _CAN2RXIDR0.Bits.ID21
#define CAN2RXIDR0_ID22                 _CAN2RXIDR0.Bits.ID22
#define CAN2RXIDR0_ID23                 _CAN2RXIDR0.Bits.ID23
#define CAN2RXIDR0_ID24                 _CAN2RXIDR0.Bits.ID24
#define CAN2RXIDR0_ID25                 _CAN2RXIDR0.Bits.ID25
#define CAN2RXIDR0_ID26                 _CAN2RXIDR0.Bits.ID26
#define CAN2RXIDR0_ID27                 _CAN2RXIDR0.Bits.ID27
#define CAN2RXIDR0_ID28                 _CAN2RXIDR0.Bits.ID28
/* CAN2RXIDR_ARR: Access 4 CAN2RXIDRx registers in an array */
#define CAN2RXIDR_ARR                   ((volatile byte *) &CAN2RXIDR0)

