frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
/*** CAN2RXDSR0 - MSCAN2 Receive Data Segment Register 0; 0x000001E4 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2RXDSR0STR;
extern volatile CAN2RXDSR0STR _CAN2RXDSR0 @(REG_BASE + 0x000001E4UL);
#define CAN2RXDSR0                      _CAN2RXDSR0.Byte
#define CAN2RXDSR0_DB0                  _CAN2RXDSR0.Bits.DB0
#define CAN2RXDSR0_DB1                  _CAN2RXDSR0.Bits.DB1
#define CAN2RXDSR0_DB2                  _CAN2RXDSR0.Bits.DB2
#define CAN2RXDSR0_DB3                  _CAN2RXDSR0.Bits.DB3
#define CAN2RXDSR0_DB4                  _CAN2RXDSR0.Bits.DB4
#define CAN2RXDSR0_DB5                  _CAN2RXDSR0.Bits.DB5
#define CAN2RXDSR0_DB6                  _CAN2RXDSR0.Bits.DB6
#define CAN2RXDSR0_DB7                  _CAN2RXDSR0.Bits.DB7
/* CAN2RXDSR_ARR: Access 8 CAN2RXDSRx registers in an array */
#define CAN2RXDSR_ARR                   ((volatile byte *) &CAN2RXDSR0)

#define CAN2RXDSR0_DB0_MASK             1U
#define CAN2RXDSR0_DB1_MASK             2U
#define CAN2RXDSR0_DB2_MASK             4U
#define CAN2RXDSR0_DB3_MASK             8U
#define CAN2RXDSR0_DB4_MASK             16U
#define CAN2RXDSR0_DB5_MASK             32U
#define CAN2RXDSR0_DB6_MASK             64U
#define CAN2RXDSR0_DB7_MASK             128U


/*** CAN2RXDSR1 - MSCAN2 Receive Data Segment Register 1; 0x000001E5 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2RXDSR1STR;
extern volatile CAN2RXDSR1STR _CAN2RXDSR1 @(REG_BASE + 0x000001E5UL);
#define CAN2RXDSR1                      _CAN2RXDSR1.Byte
#define CAN2RXDSR1_DB0                  _CAN2RXDSR1.Bits.DB0
#define CAN2RXDSR1_DB1                  _CAN2RXDSR1.Bits.DB1
#define CAN2RXDSR1_DB2                  _CAN2RXDSR1.Bits.DB2
#define CAN2RXDSR1_DB3                  _CAN2RXDSR1.Bits.DB3
#define CAN2RXDSR1_DB4                  _CAN2RXDSR1.Bits.DB4
#define CAN2RXDSR1_DB5                  _CAN2RXDSR1.Bits.DB5
#define CAN2RXDSR1_DB6                  _CAN2RXDSR1.Bits.DB6
#define CAN2RXDSR1_DB7                  _CAN2RXDSR1.Bits.DB7

#define CAN2RXDSR1_DB0_MASK             1U
#define CAN2RXDSR1_DB1_MASK             2U
#define CAN2RXDSR1_DB2_MASK             4U
#define CAN2RXDSR1_DB3_MASK             8U
#define CAN2RXDSR1_DB4_MASK             16U
#define CAN2RXDSR1_DB5_MASK             32U
#define CAN2RXDSR1_DB6_MASK             64U
#define CAN2RXDSR1_DB7_MASK             128U


/*** CAN2RXDSR2 - MSCAN2 Receive Data Segment Register 2; 0x000001E6 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2RXDSR2STR;
extern volatile CAN2RXDSR2STR _CAN2RXDSR2 @(REG_BASE + 0x000001E6UL);
#define CAN2RXDSR2                      _CAN2RXDSR2.Byte
#define CAN2RXDSR2_DB0                  _CAN2RXDSR2.Bits.DB0
#define CAN2RXDSR2_DB1                  _CAN2RXDSR2.Bits.DB1
#define CAN2RXDSR2_DB2                  _CAN2RXDSR2.Bits.DB2
#define CAN2RXDSR2_DB3                  _CAN2RXDSR2.Bits.DB3
#define CAN2RXDSR2_DB4                  _CAN2RXDSR2.Bits.DB4
#define CAN2RXDSR2_DB5                  _CAN2RXDSR2.Bits.DB5
#define CAN2RXDSR2_DB6                  _CAN2RXDSR2.Bits.DB6
#define CAN2RXDSR2_DB7                  _CAN2RXDSR2.Bits.DB7

#define CAN2RXDSR2_DB0_MASK             1U
#define CAN2RXDSR2_DB1_MASK             2U
#define CAN2RXDSR2_DB2_MASK             4U
#define CAN2RXDSR2_DB3_MASK             8U
#define CAN2RXDSR2_DB4_MASK             16U
#define CAN2RXDSR2_DB5_MASK             32U
#define CAN2RXDSR2_DB6_MASK             64U
#define CAN2RXDSR2_DB7_MASK             128U


/*** CAN2RXDSR3 - MSCAN2 Receive Data Segment Register 3; 0x000001E7 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN2RXDSR3STR;
extern volatile CAN2RXDSR3STR _CAN2RXDSR3 @(REG_BASE + 0x000001E7UL);
#define CAN2RXDSR3                      _CAN2RXDSR3.Byte
#define CAN2RXDSR3_DB0                  _CAN2RXDSR3.Bits.DB0
#define CAN2RXDSR3_DB1                  _CAN2RXDSR3.Bits.DB1
#define CAN2RXDSR3_DB2                  _CAN2RXDSR3.Bits.DB2
#define CAN2RXDSR3_DB3                  _CAN2RXDSR3.Bits.DB3
#define CAN2RXDSR3_DB4                  _CAN2RXDSR3.Bits.DB4
#define CAN2RXDSR3_DB5                  _CAN2RXDSR3.Bits.DB5
#define CAN2RXDSR3_DB6                  _CAN2RXDSR3.Bits.DB6
#define CAN2RXDSR3_DB7                  _CAN2RXDSR3.Bits.DB7

