frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
extern volatile CAN2TXTBPRSTR _CAN2TXTBPR @(REG_BASE + 0x000001FDUL);
#define CAN2TXTBPR                      _CAN2TXTBPR.Byte
#define CAN2TXTBPR_PRIO0                _CAN2TXTBPR.Bits.PRIO0
#define CAN2TXTBPR_PRIO1                _CAN2TXTBPR.Bits.PRIO1
#define CAN2TXTBPR_PRIO2                _CAN2TXTBPR.Bits.PRIO2
#define CAN2TXTBPR_PRIO3                _CAN2TXTBPR.Bits.PRIO3
#define CAN2TXTBPR_PRIO4                _CAN2TXTBPR.Bits.PRIO4
#define CAN2TXTBPR_PRIO5                _CAN2TXTBPR.Bits.PRIO5
#define CAN2TXTBPR_PRIO6                _CAN2TXTBPR.Bits.PRIO6
#define CAN2TXTBPR_PRIO7                _CAN2TXTBPR.Bits.PRIO7

#define CAN2TXTBPR_PRIO0_MASK           1U
#define CAN2TXTBPR_PRIO1_MASK           2U
#define CAN2TXTBPR_PRIO2_MASK           4U
#define CAN2TXTBPR_PRIO3_MASK           8U
#define CAN2TXTBPR_PRIO4_MASK           16U
#define CAN2TXTBPR_PRIO5_MASK           32U
#define CAN2TXTBPR_PRIO6_MASK           64U
#define CAN2TXTBPR_PRIO7_MASK           128U


/*** CAN2TXTSR - MSCAN2 Transmit Time Stamp Register; 0x000001FE ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CAN2TXTSRH - MSCAN2 Transmit Time Stamp Register High; 0x000001FE ***/
    union {
      byte Byte;
      struct {
        byte TSR8        :1;                                       /* Time Stamp Bit 8 */
        byte TSR9        :1;                                       /* Time Stamp Bit 9 */
        byte TSR10       :1;                                       /* Time Stamp Bit 10 */
        byte TSR11       :1;                                       /* Time Stamp Bit 11 */
        byte TSR12       :1;                                       /* Time Stamp Bit 12 */
        byte TSR13       :1;                                       /* Time Stamp Bit 13 */
        byte TSR14       :1;                                       /* Time Stamp Bit 14 */
        byte TSR15       :1;                                       /* Time Stamp Bit 15 */
      } Bits;
    } CAN2TXTSRHSTR;
    #define CAN2TXTSRH                  _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Byte
    #define CAN2TXTSRH_TSR8             _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR8
    #define CAN2TXTSRH_TSR9             _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR9
    #define CAN2TXTSRH_TSR10            _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR10
    #define CAN2TXTSRH_TSR11            _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR11
    #define CAN2TXTSRH_TSR12            _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR12
    #define CAN2TXTSRH_TSR13            _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR13
    #define CAN2TXTSRH_TSR14            _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR14
    #define CAN2TXTSRH_TSR15            _CAN2TXTSR.Overlap_STR.CAN2TXTSRHSTR.Bits.TSR15
    
    #define CAN2TXTSRH_TSR8_MASK        1U
    #define CAN2TXTSRH_TSR9_MASK        2U
    #define CAN2TXTSRH_TSR10_MASK       4U
    #define CAN2TXTSRH_TSR11_MASK       8U
    #define CAN2TXTSRH_TSR12_MASK       16U
    #define CAN2TXTSRH_TSR13_MASK       32U
    #define CAN2TXTSRH_TSR14_MASK       64U
    #define CAN2TXTSRH_TSR15_MASK       128U
    

    /*** CAN2TXTSRL - MSCAN2 Transmit Time Stamp Register Low; 0x000001FF ***/
    union {
      byte Byte;
      struct {
        byte TSR0        :1;                                       /* Time Stamp Bit 0 */
        byte TSR1        :1;                                       /* Time Stamp Bit 1 */
        byte TSR2        :1;                                       /* Time Stamp Bit 2 */
        byte TSR3        :1;                                       /* Time Stamp Bit 3 */
        byte TSR4        :1;                                       /* Time Stamp Bit 4 */
        byte TSR5        :1;                                       /* Time Stamp Bit 5 */
        byte TSR6        :1;                                       /* Time Stamp Bit 6 */
        byte TSR7        :1;                                       /* Time Stamp Bit 7 */
      } Bits;
    } CAN2TXTSRLSTR;
    #define CAN2TXTSRL                  _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Byte
    #define CAN2TXTSRL_TSR0             _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR0
    #define CAN2TXTSRL_TSR1             _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR1
    #define CAN2TXTSRL_TSR2             _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR2
    #define CAN2TXTSRL_TSR3             _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR3
    #define CAN2TXTSRL_TSR4             _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR4
    #define CAN2TXTSRL_TSR5             _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR5
    #define CAN2TXTSRL_TSR6             _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR6
    #define CAN2TXTSRL_TSR7             _CAN2TXTSR.Overlap_STR.CAN2TXTSRLSTR.Bits.TSR7
    
    #define CAN2TXTSRL_TSR0_MASK        1U
    #define CAN2TXTSRL_TSR1_MASK        2U
    #define CAN2TXTSRL_TSR2_MASK        4U
    #define CAN2TXTSRL_TSR3_MASK        8U
    #define CAN2TXTSRL_TSR4_MASK        16U
    #define CAN2TXTSRL_TSR5_MASK        32U
    #define CAN2TXTSRL_TSR6_MASK        64U
    #define CAN2TXTSRL_TSR7_MASK        128U
    
  } Overlap_STR;

  struct {
    word TSR0        :1;                                       /* Time Stamp Bit 0 */
    word TSR1        :1;                                       /* Time Stamp Bit 1 */
    word TSR2        :1;                                       /* Time Stamp Bit 2 */
    word TSR3        :1;                                       /* Time Stamp Bit 3 */
    word TSR4        :1;                                       /* Time Stamp Bit 4 */
    word TSR5        :1;                                       /* Time Stamp Bit 5 */
    word TSR6        :1;                                       /* Time Stamp Bit 6 */
    word TSR7        :1;                                       /* Time Stamp Bit 7 */
    word TSR8        :1;                                       /* Time Stamp Bit 8 */
    word TSR9        :1;                                       /* Time Stamp Bit 9 */
    word TSR10       :1;                                       /* Time Stamp Bit 10 */
    word TSR11       :1;                                       /* Time Stamp Bit 11 */
    word TSR12       :1;                                       /* Time Stamp Bit 12 */
    word TSR13       :1;                                       /* Time Stamp Bit 13 */
    word TSR14       :1;                                       /* Time Stamp Bit 14 */
    word TSR15       :1;                                       /* Time Stamp Bit 15 */
  } Bits;
} CAN2TXTSRSTR;
extern volatile CAN2TXTSRSTR _CAN2TXTSR @(REG_BASE + 0x000001FEUL);
#define CAN2TXTSR                       _CAN2TXTSR.Word
#define CAN2TXTSR_TSR0                  _CAN2TXTSR.Bits.TSR0
#define CAN2TXTSR_TSR1                  _CAN2TXTSR.Bits.TSR1
#define CAN2TXTSR_TSR2                  _CAN2TXTSR.Bits.TSR2
#define CAN2TXTSR_TSR3                  _CAN2TXTSR.Bits.TSR3
#define CAN2TXTSR_TSR4                  _CAN2TXTSR.Bits.TSR4
#define CAN2TXTSR_TSR5                  _CAN2TXTSR.Bits.TSR5
#define CAN2TXTSR_TSR6                  _CAN2TXTSR.Bits.TSR6
#define CAN2TXTSR_TSR7                  _CAN2TXTSR.Bits.TSR7
#define CAN2TXTSR_TSR8                  _CAN2TXTSR.Bits.TSR8
#define CAN2TXTSR_TSR9                  _CAN2TXTSR.Bits.TSR9
#define CAN2TXTSR_TSR10                 _CAN2TXTSR.Bits.TSR10
#define CAN2TXTSR_TSR11                 _CAN2TXTSR.Bits.TSR11
#define CAN2TXTSR_TSR12                 _CAN2TXTSR.Bits.TSR12
#define CAN2TXTSR_TSR13                 _CAN2TXTSR.Bits.TSR13
#define CAN2TXTSR_TSR14                 _CAN2TXTSR.Bits.TSR14
#define CAN2TXTSR_TSR15                 _CAN2TXTSR.Bits.TSR15

