frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
#define CAN2TXTSR_TSR0_MASK             1U
#define CAN2TXTSR_TSR1_MASK             2U
#define CAN2TXTSR_TSR2_MASK             4U
#define CAN2TXTSR_TSR3_MASK             8U
#define CAN2TXTSR_TSR4_MASK             16U
#define CAN2TXTSR_TSR5_MASK             32U
#define CAN2TXTSR_TSR6_MASK             64U
#define CAN2TXTSR_TSR7_MASK             128U
#define CAN2TXTSR_TSR8_MASK             256U
#define CAN2TXTSR_TSR9_MASK             512U
#define CAN2TXTSR_TSR10_MASK            1024U
#define CAN2TXTSR_TSR11_MASK            2048U
#define CAN2TXTSR_TSR12_MASK            4096U
#define CAN2TXTSR_TSR13_MASK            8192U
#define CAN2TXTSR_TSR14_MASK            16384U
#define CAN2TXTSR_TSR15_MASK            32768U


/*** CAN3CTL0 - MSCAN3 Control 0 Register; 0x00000200 ***/
typedef union {
  byte Byte;
  struct {
    byte INITRQ      :1;                                       /* Initialization Mode Request */
    byte SLPRQ       :1;                                       /* Sleep Mode Request */
    byte WUPE        :1;                                       /* Wake-Up Enable */
    byte TIME        :1;                                       /* Timer Enable */
    byte SYNCH       :1;                                       /* Synchronized Status */
    byte CSWAI       :1;                                       /* CAN Stops in Wait Mode */
    byte RXACT       :1;                                       /* Receiver Active Status */
    byte RXFRM       :1;                                       /* Received Frame Flag */
  } Bits;
} CAN3CTL0STR;
extern volatile CAN3CTL0STR _CAN3CTL0 @(REG_BASE + 0x00000200UL);
#define CAN3CTL0                        _CAN3CTL0.Byte
#define CAN3CTL0_INITRQ                 _CAN3CTL0.Bits.INITRQ
#define CAN3CTL0_SLPRQ                  _CAN3CTL0.Bits.SLPRQ
#define CAN3CTL0_WUPE                   _CAN3CTL0.Bits.WUPE
#define CAN3CTL0_TIME                   _CAN3CTL0.Bits.TIME
#define CAN3CTL0_SYNCH                  _CAN3CTL0.Bits.SYNCH
#define CAN3CTL0_CSWAI                  _CAN3CTL0.Bits.CSWAI
#define CAN3CTL0_RXACT                  _CAN3CTL0.Bits.RXACT
#define CAN3CTL0_RXFRM                  _CAN3CTL0.Bits.RXFRM
/* CAN3CTL_ARR: Access 2 CAN3CTLx registers in an array */
#define CAN3CTL_ARR                     ((volatile byte *) &CAN3CTL0)

#define CAN3CTL0_INITRQ_MASK            1U
#define CAN3CTL0_SLPRQ_MASK             2U
#define CAN3CTL0_WUPE_MASK              4U
#define CAN3CTL0_TIME_MASK              8U
#define CAN3CTL0_SYNCH_MASK             16U
#define CAN3CTL0_CSWAI_MASK             32U
#define CAN3CTL0_RXACT_MASK             64U
#define CAN3CTL0_RXFRM_MASK             128U


/*** CAN3CTL1 - MSCAN3 Control 1 Register; 0x00000201 ***/
typedef union {
  byte Byte;
  struct {
    byte INITAK      :1;                                       /* Initialization Mode Acknowledge */
    byte SLPAK       :1;                                       /* Sleep Mode Acknowledge */
    byte WUPM        :1;                                       /* Wake-Up Mode */
    byte BORM        :1;                                       /* Bus-Off Recovery Mode */
    byte LISTEN      :1;                                       /* Listen Only Mode */
    byte LOOPB       :1;                                       /* Loop Back Self Test Mode */
    byte CLKSRC      :1;                                       /* MSCAN Clock Source */
    byte CANE        :1;                                       /* MSCAN Enable */
  } Bits;
} CAN3CTL1STR;
extern volatile CAN3CTL1STR _CAN3CTL1 @(REG_BASE + 0x00000201UL);
#define CAN3CTL1                        _CAN3CTL1.Byte
#define CAN3CTL1_INITAK                 _CAN3CTL1.Bits.INITAK
#define CAN3CTL1_SLPAK                  _CAN3CTL1.Bits.SLPAK
#define CAN3CTL1_WUPM                   _CAN3CTL1.Bits.WUPM
#define CAN3CTL1_BORM                   _CAN3CTL1.Bits.BORM
#define CAN3CTL1_LISTEN                 _CAN3CTL1.Bits.LISTEN
#define CAN3CTL1_LOOPB                  _CAN3CTL1.Bits.LOOPB
#define CAN3CTL1_CLKSRC                 _CAN3CTL1.Bits.CLKSRC
#define CAN3CTL1_CANE                   _CAN3CTL1.Bits.CANE

#define CAN3CTL1_INITAK_MASK            1U
#define CAN3CTL1_SLPAK_MASK             2U
#define CAN3CTL1_WUPM_MASK              4U
#define CAN3CTL1_BORM_MASK              8U
#define CAN3CTL1_LISTEN_MASK            16U
#define CAN3CTL1_LOOPB_MASK             32U
#define CAN3CTL1_CLKSRC_MASK            64U
#define CAN3CTL1_CANE_MASK              128U


/*** CAN3BTR0 - MSCAN3 Bus Timing Register 0; 0x00000202 ***/
typedef union {
  byte Byte;
  struct {
    byte BRP0        :1;                                       /* Baud Rate Prescaler 0 */
    byte BRP1        :1;                                       /* Baud Rate Prescaler 1 */
    byte BRP2        :1;                                       /* Baud Rate Prescaler 2 */
    byte BRP3        :1;                                       /* Baud Rate Prescaler 3 */
    byte BRP4        :1;                                       /* Baud Rate Prescaler 4 */
    byte BRP5        :1;                                       /* Baud Rate Prescaler 5 */
    byte SJW0        :1;                                       /* Synchronization Jump Width 0 */
    byte SJW1        :1;                                       /* Synchronization Jump Width 1 */
  } Bits;
  struct {
    byte grpBRP  :6;
    byte grpSJW  :2;
  } MergedBits;
} CAN3BTR0STR;
extern volatile CAN3BTR0STR _CAN3BTR0 @(REG_BASE + 0x00000202UL);
#define CAN3BTR0                        _CAN3BTR0.Byte
#define CAN3BTR0_BRP0                   _CAN3BTR0.Bits.BRP0
#define CAN3BTR0_BRP1                   _CAN3BTR0.Bits.BRP1
#define CAN3BTR0_BRP2                   _CAN3BTR0.Bits.BRP2
#define CAN3BTR0_BRP3                   _CAN3BTR0.Bits.BRP3
#define CAN3BTR0_BRP4                   _CAN3BTR0.Bits.BRP4
#define CAN3BTR0_BRP5                   _CAN3BTR0.Bits.BRP5
#define CAN3BTR0_SJW0                   _CAN3BTR0.Bits.SJW0
#define CAN3BTR0_SJW1                   _CAN3BTR0.Bits.SJW1
/* CAN3BTR_ARR: Access 2 CAN3BTRx registers in an array */
#define CAN3BTR_ARR                     ((volatile byte *) &CAN3BTR0)
#define CAN3BTR0_BRP                    _CAN3BTR0.MergedBits.grpBRP
#define CAN3BTR0_SJW                    _CAN3BTR0.MergedBits.grpSJW

#define CAN3BTR0_BRP0_MASK              1U
#define CAN3BTR0_BRP1_MASK              2U
#define CAN3BTR0_BRP2_MASK              4U
#define CAN3BTR0_BRP3_MASK              8U
#define CAN3BTR0_BRP4_MASK              16U
#define CAN3BTR0_BRP5_MASK              32U
#define CAN3BTR0_SJW0_MASK              64U
#define CAN3BTR0_SJW1_MASK              128U
#define CAN3BTR0_BRP_MASK               63U
#define CAN3BTR0_BRP_BITNUM             0U
#define CAN3BTR0_SJW_MASK               192U
#define CAN3BTR0_SJW_BITNUM             6U


/*** CAN3BTR1 - MSCAN3 Bus Timing Register 1; 0x00000203 ***/
typedef union {
  byte Byte;
  struct {
    byte TSEG10      :1;                                       /* Time Segment 10 */
    byte TSEG11      :1;                                       /* Time Segment 11 */
    byte TSEG12      :1;                                       /* Time Segment 12 */
    byte TSEG13      :1;                                       /* Time Segment 13 */
    byte TSEG20      :1;                                       /* Time Segment 20 */
    byte TSEG21      :1;                                       /* Time Segment 21 */
    byte TSEG22      :1;                                       /* Time Segment 22 */
    byte SAMP        :1;                                       /* Sampling */
  } Bits;
  struct {
    byte grpTSEG_10 :4;
    byte grpTSEG_20 :3;
    byte         :1;
  } MergedBits;
} CAN3BTR1STR;
extern volatile CAN3BTR1STR _CAN3BTR1 @(REG_BASE + 0x00000203UL);
#define CAN3BTR1                        _CAN3BTR1.Byte
#define CAN3BTR1_TSEG10                 _CAN3BTR1.Bits.TSEG10
#define CAN3BTR1_TSEG11                 _CAN3BTR1.Bits.TSEG11
#define CAN3BTR1_TSEG12                 _CAN3BTR1.Bits.TSEG12
#define CAN3BTR1_TSEG13                 _CAN3BTR1.Bits.TSEG13
#define CAN3BTR1_TSEG20                 _CAN3BTR1.Bits.TSEG20
#define CAN3BTR1_TSEG21                 _CAN3BTR1.Bits.TSEG21
#define CAN3BTR1_TSEG22                 _CAN3BTR1.Bits.TSEG22
#define CAN3BTR1_SAMP                   _CAN3BTR1.Bits.SAMP
#define CAN3BTR1_TSEG_10                _CAN3BTR1.MergedBits.grpTSEG_10
#define CAN3BTR1_TSEG_20                _CAN3BTR1.MergedBits.grpTSEG_20
#define CAN3BTR1_TSEG                   CAN3BTR1_TSEG_10

#define CAN3BTR1_TSEG10_MASK            1U
#define CAN3BTR1_TSEG11_MASK            2U
#define CAN3BTR1_TSEG12_MASK            4U
#define CAN3BTR1_TSEG13_MASK            8U
#define CAN3BTR1_TSEG20_MASK            16U
#define CAN3BTR1_TSEG21_MASK            32U
#define CAN3BTR1_TSEG22_MASK            64U
#define CAN3BTR1_SAMP_MASK              128U
#define CAN3BTR1_TSEG_10_MASK           15U
#define CAN3BTR1_TSEG_10_BITNUM         0U
#define CAN3BTR1_TSEG_20_MASK           112U
#define CAN3BTR1_TSEG_20_BITNUM         4U


