frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
/*** CAN3RFLG - MSCAN3 Receiver Flag Register; 0x00000204 ***/
typedef union {
  byte Byte;
  struct {
    byte RXF         :1;                                       /* Receive Buffer Full */
    byte OVRIF       :1;                                       /* Overrun Interrupt Flag */
    byte TSTAT0      :1;                                       /* Transmitter Status Bit 0 */
    byte TSTAT1      :1;                                       /* Transmitter Status Bit 1 */
    byte RSTAT0      :1;                                       /* Receiver Status Bit 0 */
    byte RSTAT1      :1;                                       /* Receiver Status Bit 1 */
    byte CSCIF       :1;                                       /* CAN Status Change Interrupt Flag */
    byte WUPIF       :1;                                       /* Wake-up Interrupt Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTSTAT :2;
    byte grpRSTAT :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3RFLGSTR;
extern volatile CAN3RFLGSTR _CAN3RFLG @(REG_BASE + 0x00000204UL);
#define CAN3RFLG                        _CAN3RFLG.Byte
#define CAN3RFLG_RXF                    _CAN3RFLG.Bits.RXF
#define CAN3RFLG_OVRIF                  _CAN3RFLG.Bits.OVRIF
#define CAN3RFLG_TSTAT0                 _CAN3RFLG.Bits.TSTAT0
#define CAN3RFLG_TSTAT1                 _CAN3RFLG.Bits.TSTAT1
#define CAN3RFLG_RSTAT0                 _CAN3RFLG.Bits.RSTAT0
#define CAN3RFLG_RSTAT1                 _CAN3RFLG.Bits.RSTAT1
#define CAN3RFLG_CSCIF                  _CAN3RFLG.Bits.CSCIF
#define CAN3RFLG_WUPIF                  _CAN3RFLG.Bits.WUPIF
#define CAN3RFLG_TSTAT                  _CAN3RFLG.MergedBits.grpTSTAT
#define CAN3RFLG_RSTAT                  _CAN3RFLG.MergedBits.grpRSTAT

#define CAN3RFLG_RXF_MASK               1U
#define CAN3RFLG_OVRIF_MASK             2U
#define CAN3RFLG_TSTAT0_MASK            4U
#define CAN3RFLG_TSTAT1_MASK            8U
#define CAN3RFLG_RSTAT0_MASK            16U
#define CAN3RFLG_RSTAT1_MASK            32U
#define CAN3RFLG_CSCIF_MASK             64U
#define CAN3RFLG_WUPIF_MASK             128U
#define CAN3RFLG_TSTAT_MASK             12U
#define CAN3RFLG_TSTAT_BITNUM           2U
#define CAN3RFLG_RSTAT_MASK             48U
#define CAN3RFLG_RSTAT_BITNUM           4U


/*** CAN3RIER - MSCAN3 Receiver Interrupt Enable Register; 0x00000205 ***/
typedef union {
  byte Byte;
  struct {
    byte RXFIE       :1;                                       /* Receiver Full Interrupt Enable */
    byte OVRIE       :1;                                       /* Overrun Interrupt Enable */
    byte TSTATE0     :1;                                       /* Transmitter Status Change Enable 0 */
    byte TSTATE1     :1;                                       /* Transmitter Status Change Enable 1 */
    byte RSTATE0     :1;                                       /* Receiver Status Change Enable 0 */
    byte RSTATE1     :1;                                       /* Receiver Status Change Enable 1 */
    byte CSCIE       :1;                                       /* CAN Status Change Interrupt Enable */
    byte WUPIE       :1;                                       /* Wake-up Interrupt Enable */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTSTATE :2;
    byte grpRSTATE :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3RIERSTR;
extern volatile CAN3RIERSTR _CAN3RIER @(REG_BASE + 0x00000205UL);
#define CAN3RIER                        _CAN3RIER.Byte
#define CAN3RIER_RXFIE                  _CAN3RIER.Bits.RXFIE
#define CAN3RIER_OVRIE                  _CAN3RIER.Bits.OVRIE
#define CAN3RIER_TSTATE0                _CAN3RIER.Bits.TSTATE0
#define CAN3RIER_TSTATE1                _CAN3RIER.Bits.TSTATE1
#define CAN3RIER_RSTATE0                _CAN3RIER.Bits.RSTATE0
#define CAN3RIER_RSTATE1                _CAN3RIER.Bits.RSTATE1
#define CAN3RIER_CSCIE                  _CAN3RIER.Bits.CSCIE
#define CAN3RIER_WUPIE                  _CAN3RIER.Bits.WUPIE
#define CAN3RIER_TSTATE                 _CAN3RIER.MergedBits.grpTSTATE
#define CAN3RIER_RSTATE                 _CAN3RIER.MergedBits.grpRSTATE

#define CAN3RIER_RXFIE_MASK             1U
#define CAN3RIER_OVRIE_MASK             2U
#define CAN3RIER_TSTATE0_MASK           4U
#define CAN3RIER_TSTATE1_MASK           8U
#define CAN3RIER_RSTATE0_MASK           16U
#define CAN3RIER_RSTATE1_MASK           32U
#define CAN3RIER_CSCIE_MASK             64U
#define CAN3RIER_WUPIE_MASK             128U
#define CAN3RIER_TSTATE_MASK            12U
#define CAN3RIER_TSTATE_BITNUM          2U
#define CAN3RIER_RSTATE_MASK            48U
#define CAN3RIER_RSTATE_BITNUM          4U


/*** CAN3TFLG - MSCAN3 Transmitter Flag Register; 0x00000206 ***/
typedef union {
  byte Byte;
  struct {
    byte TXE0        :1;                                       /* Transmitter Buffer Empty 0 */
    byte TXE1        :1;                                       /* Transmitter Buffer Empty 1 */
    byte TXE2        :1;                                       /* Transmitter Buffer Empty 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTXE  :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3TFLGSTR;
extern volatile CAN3TFLGSTR _CAN3TFLG @(REG_BASE + 0x00000206UL);
#define CAN3TFLG                        _CAN3TFLG.Byte
#define CAN3TFLG_TXE0                   _CAN3TFLG.Bits.TXE0
#define CAN3TFLG_TXE1                   _CAN3TFLG.Bits.TXE1
#define CAN3TFLG_TXE2                   _CAN3TFLG.Bits.TXE2
#define CAN3TFLG_TXE                    _CAN3TFLG.MergedBits.grpTXE

#define CAN3TFLG_TXE0_MASK              1U
#define CAN3TFLG_TXE1_MASK              2U
#define CAN3TFLG_TXE2_MASK              4U
#define CAN3TFLG_TXE_MASK               7U
#define CAN3TFLG_TXE_BITNUM             0U


/*** CAN3TIER - MSCAN3 Transmitter Interrupt Enable Register; 0x00000207 ***/
typedef union {
  byte Byte;
  struct {
    byte TXEIE0      :1;                                       /* Transmitter Empty Interrupt Enable 0 */
    byte TXEIE1      :1;                                       /* Transmitter Empty Interrupt Enable 1 */
    byte TXEIE2      :1;                                       /* Transmitter Empty Interrupt Enable 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTXEIE :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3TIERSTR;
extern volatile CAN3TIERSTR _CAN3TIER @(REG_BASE + 0x00000207UL);
#define CAN3TIER                        _CAN3TIER.Byte
#define CAN3TIER_TXEIE0                 _CAN3TIER.Bits.TXEIE0
#define CAN3TIER_TXEIE1                 _CAN3TIER.Bits.TXEIE1
#define CAN3TIER_TXEIE2                 _CAN3TIER.Bits.TXEIE2
#define CAN3TIER_TXEIE                  _CAN3TIER.MergedBits.grpTXEIE

