frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
#define CAN3TIER_TXEIE0_MASK            1U
#define CAN3TIER_TXEIE1_MASK            2U
#define CAN3TIER_TXEIE2_MASK            4U
#define CAN3TIER_TXEIE_MASK             7U
#define CAN3TIER_TXEIE_BITNUM           0U


/*** CAN3TARQ - MSCAN3 Transmitter Message Abort Request; 0x00000208 ***/
typedef union {
  byte Byte;
  struct {
    byte ABTRQ0      :1;                                       /* Abort Request 0 */
    byte ABTRQ1      :1;                                       /* Abort Request 1 */
    byte ABTRQ2      :1;                                       /* Abort Request 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpABTRQ :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3TARQSTR;
extern volatile CAN3TARQSTR _CAN3TARQ @(REG_BASE + 0x00000208UL);
#define CAN3TARQ                        _CAN3TARQ.Byte
#define CAN3TARQ_ABTRQ0                 _CAN3TARQ.Bits.ABTRQ0
#define CAN3TARQ_ABTRQ1                 _CAN3TARQ.Bits.ABTRQ1
#define CAN3TARQ_ABTRQ2                 _CAN3TARQ.Bits.ABTRQ2
#define CAN3TARQ_ABTRQ                  _CAN3TARQ.MergedBits.grpABTRQ

#define CAN3TARQ_ABTRQ0_MASK            1U
#define CAN3TARQ_ABTRQ1_MASK            2U
#define CAN3TARQ_ABTRQ2_MASK            4U
#define CAN3TARQ_ABTRQ_MASK             7U
#define CAN3TARQ_ABTRQ_BITNUM           0U


/*** CAN3TAAK - MSCAN3 Transmitter Message Abort Acknowledge; 0x00000209 ***/
typedef union {
  byte Byte;
  struct {
    byte ABTAK0      :1;                                       /* Abort Acknowledge 0 */
    byte ABTAK1      :1;                                       /* Abort Acknowledge 1 */
    byte ABTAK2      :1;                                       /* Abort Acknowledge 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpABTAK :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3TAAKSTR;
extern volatile CAN3TAAKSTR _CAN3TAAK @(REG_BASE + 0x00000209UL);
#define CAN3TAAK                        _CAN3TAAK.Byte
#define CAN3TAAK_ABTAK0                 _CAN3TAAK.Bits.ABTAK0
#define CAN3TAAK_ABTAK1                 _CAN3TAAK.Bits.ABTAK1
#define CAN3TAAK_ABTAK2                 _CAN3TAAK.Bits.ABTAK2
#define CAN3TAAK_ABTAK                  _CAN3TAAK.MergedBits.grpABTAK

#define CAN3TAAK_ABTAK0_MASK            1U
#define CAN3TAAK_ABTAK1_MASK            2U
#define CAN3TAAK_ABTAK2_MASK            4U
#define CAN3TAAK_ABTAK_MASK             7U
#define CAN3TAAK_ABTAK_BITNUM           0U


/*** CAN3TBSEL - MSCAN3 Transmit Buffer Selection; 0x0000020A ***/
typedef union {
  byte Byte;
  struct {
    byte TX0         :1;                                       /* Transmit Buffer Select 0 */
    byte TX1         :1;                                       /* Transmit Buffer Select 1 */
    byte TX2         :1;                                       /* Transmit Buffer Select 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTX   :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3TBSELSTR;
extern volatile CAN3TBSELSTR _CAN3TBSEL @(REG_BASE + 0x0000020AUL);
#define CAN3TBSEL                       _CAN3TBSEL.Byte
#define CAN3TBSEL_TX0                   _CAN3TBSEL.Bits.TX0
#define CAN3TBSEL_TX1                   _CAN3TBSEL.Bits.TX1
#define CAN3TBSEL_TX2                   _CAN3TBSEL.Bits.TX2
#define CAN3TBSEL_TX                    _CAN3TBSEL.MergedBits.grpTX

#define CAN3TBSEL_TX0_MASK              1U
#define CAN3TBSEL_TX1_MASK              2U
#define CAN3TBSEL_TX2_MASK              4U
#define CAN3TBSEL_TX_MASK               7U
#define CAN3TBSEL_TX_BITNUM             0U


/*** CAN3IDAC - MSCAN3 Identifier Acceptance Control Register; 0x0000020B ***/
typedef union {
  byte Byte;
  struct {
    byte IDHIT0      :1;                                       /* Identifier Acceptance Hit Indicator 0 */
    byte IDHIT1      :1;                                       /* Identifier Acceptance Hit Indicator 1 */
    byte IDHIT2      :1;                                       /* Identifier Acceptance Hit Indicator 2 */
    byte             :1; 
    byte IDAM0       :1;                                       /* Identifier Acceptance Mode 0 */
    byte IDAM1       :1;                                       /* Identifier Acceptance Mode 1 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpIDHIT :3;
    byte         :1;
    byte grpIDAM :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3IDACSTR;
extern volatile CAN3IDACSTR _CAN3IDAC @(REG_BASE + 0x0000020BUL);
#define CAN3IDAC                        _CAN3IDAC.Byte
#define CAN3IDAC_IDHIT0                 _CAN3IDAC.Bits.IDHIT0
#define CAN3IDAC_IDHIT1                 _CAN3IDAC.Bits.IDHIT1
#define CAN3IDAC_IDHIT2                 _CAN3IDAC.Bits.IDHIT2
#define CAN3IDAC_IDAM0                  _CAN3IDAC.Bits.IDAM0
#define CAN3IDAC_IDAM1                  _CAN3IDAC.Bits.IDAM1
#define CAN3IDAC_IDHIT                  _CAN3IDAC.MergedBits.grpIDHIT
#define CAN3IDAC_IDAM                   _CAN3IDAC.MergedBits.grpIDAM

#define CAN3IDAC_IDHIT0_MASK            1U
#define CAN3IDAC_IDHIT1_MASK            2U
#define CAN3IDAC_IDHIT2_MASK            4U
#define CAN3IDAC_IDAM0_MASK             16U
#define CAN3IDAC_IDAM1_MASK             32U
#define CAN3IDAC_IDHIT_MASK             7U
#define CAN3IDAC_IDHIT_BITNUM           0U
#define CAN3IDAC_IDAM_MASK              48U
#define CAN3IDAC_IDAM_BITNUM            4U


/*** CAN3MISC - MSCAN3 Miscellaneous Register; 0x0000020D ***/
typedef union {
  byte Byte;
  struct {
    byte BOHOLD      :1;                                       /* Bus-off State Hold Until User Request */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} CAN3MISCSTR;
extern volatile CAN3MISCSTR _CAN3MISC @(REG_BASE + 0x0000020DUL);
#define CAN3MISC                        _CAN3MISC.Byte
#define CAN3MISC_BOHOLD                 _CAN3MISC.Bits.BOHOLD

#define CAN3MISC_BOHOLD_MASK            1U


/*** CAN3RXERR - MSCAN3 Receive Error Counter Register; 0x0000020E ***/
typedef union {
  byte Byte;
  struct {
    byte RXERR0      :1;                                       /* Bit 0 */
    byte RXERR1      :1;                                       /* Bit 1 */
    byte RXERR2      :1;                                       /* Bit 2 */
    byte RXERR3      :1;                                       /* Bit 3 */
    byte RXERR4      :1;                                       /* Bit 4 */
    byte RXERR5      :1;                                       /* Bit 5 */
    byte RXERR6      :1;                                       /* Bit 6 */
    byte RXERR7      :1;                                       /* Bit 7 */
  } Bits;
} CAN3RXERRSTR;
