frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
#define CAN3IDAR1_AC0_MASK              1U
#define CAN3IDAR1_AC1_MASK              2U
#define CAN3IDAR1_AC2_MASK              4U
#define CAN3IDAR1_AC3_MASK              8U
#define CAN3IDAR1_AC4_MASK              16U
#define CAN3IDAR1_AC5_MASK              32U
#define CAN3IDAR1_AC6_MASK              64U
#define CAN3IDAR1_AC7_MASK              128U


/*** CAN3IDAR2 - MSCAN3 Identifier Acceptance Register 2; 0x00000212 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN3IDAR2STR;
extern volatile CAN3IDAR2STR _CAN3IDAR2 @(REG_BASE + 0x00000212UL);
#define CAN3IDAR2                       _CAN3IDAR2.Byte
#define CAN3IDAR2_AC0                   _CAN3IDAR2.Bits.AC0
#define CAN3IDAR2_AC1                   _CAN3IDAR2.Bits.AC1
#define CAN3IDAR2_AC2                   _CAN3IDAR2.Bits.AC2
#define CAN3IDAR2_AC3                   _CAN3IDAR2.Bits.AC3
#define CAN3IDAR2_AC4                   _CAN3IDAR2.Bits.AC4
#define CAN3IDAR2_AC5                   _CAN3IDAR2.Bits.AC5
#define CAN3IDAR2_AC6                   _CAN3IDAR2.Bits.AC6
#define CAN3IDAR2_AC7                   _CAN3IDAR2.Bits.AC7

#define CAN3IDAR2_AC0_MASK              1U
#define CAN3IDAR2_AC1_MASK              2U
#define CAN3IDAR2_AC2_MASK              4U
#define CAN3IDAR2_AC3_MASK              8U
#define CAN3IDAR2_AC4_MASK              16U
#define CAN3IDAR2_AC5_MASK              32U
#define CAN3IDAR2_AC6_MASK              64U
#define CAN3IDAR2_AC7_MASK              128U


/*** CAN3IDAR3 - MSCAN3 Identifier Acceptance Register 3; 0x00000213 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN3IDAR3STR;
extern volatile CAN3IDAR3STR _CAN3IDAR3 @(REG_BASE + 0x00000213UL);
#define CAN3IDAR3                       _CAN3IDAR3.Byte
#define CAN3IDAR3_AC0                   _CAN3IDAR3.Bits.AC0
#define CAN3IDAR3_AC1                   _CAN3IDAR3.Bits.AC1
#define CAN3IDAR3_AC2                   _CAN3IDAR3.Bits.AC2
#define CAN3IDAR3_AC3                   _CAN3IDAR3.Bits.AC3
#define CAN3IDAR3_AC4                   _CAN3IDAR3.Bits.AC4
#define CAN3IDAR3_AC5                   _CAN3IDAR3.Bits.AC5
#define CAN3IDAR3_AC6                   _CAN3IDAR3.Bits.AC6
#define CAN3IDAR3_AC7                   _CAN3IDAR3.Bits.AC7

#define CAN3IDAR3_AC0_MASK              1U
#define CAN3IDAR3_AC1_MASK              2U
#define CAN3IDAR3_AC2_MASK              4U
#define CAN3IDAR3_AC3_MASK              8U
#define CAN3IDAR3_AC4_MASK              16U
#define CAN3IDAR3_AC5_MASK              32U
#define CAN3IDAR3_AC6_MASK              64U
#define CAN3IDAR3_AC7_MASK              128U


/*** CAN3IDMR0 - MSCAN3 Identifier Mask Register 0; 0x00000214 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN3IDMR0STR;
extern volatile CAN3IDMR0STR _CAN3IDMR0 @(REG_BASE + 0x00000214UL);
#define CAN3IDMR0                       _CAN3IDMR0.Byte
#define CAN3IDMR0_AM0                   _CAN3IDMR0.Bits.AM0
#define CAN3IDMR0_AM1                   _CAN3IDMR0.Bits.AM1
#define CAN3IDMR0_AM2                   _CAN3IDMR0.Bits.AM2
#define CAN3IDMR0_AM3                   _CAN3IDMR0.Bits.AM3
#define CAN3IDMR0_AM4                   _CAN3IDMR0.Bits.AM4
#define CAN3IDMR0_AM5                   _CAN3IDMR0.Bits.AM5
#define CAN3IDMR0_AM6                   _CAN3IDMR0.Bits.AM6
#define CAN3IDMR0_AM7                   _CAN3IDMR0.Bits.AM7
/* CAN3IDMR_ARR: Access 4 CAN3IDMRx registers in an array */
#define CAN3IDMR_ARR                    ((volatile byte *) &CAN3IDMR0)

#define CAN3IDMR0_AM0_MASK              1U
#define CAN3IDMR0_AM1_MASK              2U
#define CAN3IDMR0_AM2_MASK              4U
#define CAN3IDMR0_AM3_MASK              8U
#define CAN3IDMR0_AM4_MASK              16U
#define CAN3IDMR0_AM5_MASK              32U
#define CAN3IDMR0_AM6_MASK              64U
#define CAN3IDMR0_AM7_MASK              128U


/*** CAN3IDMR1 - MSCAN3 Identifier Mask Register 1; 0x00000215 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN3IDMR1STR;
