frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
/*** CAN3IDAR5 - MSCAN3 Identifier Acceptance Register 5; 0x00000219 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN3IDAR5STR;
extern volatile CAN3IDAR5STR _CAN3IDAR5 @(REG_BASE + 0x00000219UL);
#define CAN3IDAR5                       _CAN3IDAR5.Byte
#define CAN3IDAR5_AC0                   _CAN3IDAR5.Bits.AC0
#define CAN3IDAR5_AC1                   _CAN3IDAR5.Bits.AC1
#define CAN3IDAR5_AC2                   _CAN3IDAR5.Bits.AC2
#define CAN3IDAR5_AC3                   _CAN3IDAR5.Bits.AC3
#define CAN3IDAR5_AC4                   _CAN3IDAR5.Bits.AC4
#define CAN3IDAR5_AC5                   _CAN3IDAR5.Bits.AC5
#define CAN3IDAR5_AC6                   _CAN3IDAR5.Bits.AC6
#define CAN3IDAR5_AC7                   _CAN3IDAR5.Bits.AC7

#define CAN3IDAR5_AC0_MASK              1U
#define CAN3IDAR5_AC1_MASK              2U
#define CAN3IDAR5_AC2_MASK              4U
#define CAN3IDAR5_AC3_MASK              8U
#define CAN3IDAR5_AC4_MASK              16U
#define CAN3IDAR5_AC5_MASK              32U
#define CAN3IDAR5_AC6_MASK              64U
#define CAN3IDAR5_AC7_MASK              128U


/*** CAN3IDAR6 - MSCAN3 Identifier Acceptance Register 6; 0x0000021A ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN3IDAR6STR;
extern volatile CAN3IDAR6STR _CAN3IDAR6 @(REG_BASE + 0x0000021AUL);
#define CAN3IDAR6                       _CAN3IDAR6.Byte
#define CAN3IDAR6_AC0                   _CAN3IDAR6.Bits.AC0
#define CAN3IDAR6_AC1                   _CAN3IDAR6.Bits.AC1
#define CAN3IDAR6_AC2                   _CAN3IDAR6.Bits.AC2
#define CAN3IDAR6_AC3                   _CAN3IDAR6.Bits.AC3
#define CAN3IDAR6_AC4                   _CAN3IDAR6.Bits.AC4
#define CAN3IDAR6_AC5                   _CAN3IDAR6.Bits.AC5
#define CAN3IDAR6_AC6                   _CAN3IDAR6.Bits.AC6
#define CAN3IDAR6_AC7                   _CAN3IDAR6.Bits.AC7

#define CAN3IDAR6_AC0_MASK              1U
#define CAN3IDAR6_AC1_MASK              2U
#define CAN3IDAR6_AC2_MASK              4U
#define CAN3IDAR6_AC3_MASK              8U
#define CAN3IDAR6_AC4_MASK              16U
#define CAN3IDAR6_AC5_MASK              32U
#define CAN3IDAR6_AC6_MASK              64U
#define CAN3IDAR6_AC7_MASK              128U


/*** CAN3IDAR7 - MSCAN3 Identifier Acceptance Register 7; 0x0000021B ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN3IDAR7STR;
extern volatile CAN3IDAR7STR _CAN3IDAR7 @(REG_BASE + 0x0000021BUL);
#define CAN3IDAR7                       _CAN3IDAR7.Byte
#define CAN3IDAR7_AC0                   _CAN3IDAR7.Bits.AC0
#define CAN3IDAR7_AC1                   _CAN3IDAR7.Bits.AC1
#define CAN3IDAR7_AC2                   _CAN3IDAR7.Bits.AC2
#define CAN3IDAR7_AC3                   _CAN3IDAR7.Bits.AC3
#define CAN3IDAR7_AC4                   _CAN3IDAR7.Bits.AC4
#define CAN3IDAR7_AC5                   _CAN3IDAR7.Bits.AC5
#define CAN3IDAR7_AC6                   _CAN3IDAR7.Bits.AC6
#define CAN3IDAR7_AC7                   _CAN3IDAR7.Bits.AC7

#define CAN3IDAR7_AC0_MASK              1U
#define CAN3IDAR7_AC1_MASK              2U
#define CAN3IDAR7_AC2_MASK              4U
#define CAN3IDAR7_AC3_MASK              8U
#define CAN3IDAR7_AC4_MASK              16U
#define CAN3IDAR7_AC5_MASK              32U
#define CAN3IDAR7_AC6_MASK              64U
#define CAN3IDAR7_AC7_MASK              128U


/*** CAN3IDMR4 - MSCAN3 Identifier Mask Register 4; 0x0000021C ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN3IDMR4STR;
