frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
extern volatile CAN3IDMR4STR _CAN3IDMR4 @(REG_BASE + 0x0000021CUL);
#define CAN3IDMR4                       _CAN3IDMR4.Byte
#define CAN3IDMR4_AM0                   _CAN3IDMR4.Bits.AM0
#define CAN3IDMR4_AM1                   _CAN3IDMR4.Bits.AM1
#define CAN3IDMR4_AM2                   _CAN3IDMR4.Bits.AM2
#define CAN3IDMR4_AM3                   _CAN3IDMR4.Bits.AM3
#define CAN3IDMR4_AM4                   _CAN3IDMR4.Bits.AM4
#define CAN3IDMR4_AM5                   _CAN3IDMR4.Bits.AM5
#define CAN3IDMR4_AM6                   _CAN3IDMR4.Bits.AM6
#define CAN3IDMR4_AM7                   _CAN3IDMR4.Bits.AM7

#define CAN3IDMR4_AM0_MASK              1U
#define CAN3IDMR4_AM1_MASK              2U
#define CAN3IDMR4_AM2_MASK              4U
#define CAN3IDMR4_AM3_MASK              8U
#define CAN3IDMR4_AM4_MASK              16U
#define CAN3IDMR4_AM5_MASK              32U
#define CAN3IDMR4_AM6_MASK              64U
#define CAN3IDMR4_AM7_MASK              128U


/*** CAN3IDMR5 - MSCAN3 Identifier Mask Register 5; 0x0000021D ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN3IDMR5STR;
extern volatile CAN3IDMR5STR _CAN3IDMR5 @(REG_BASE + 0x0000021DUL);
#define CAN3IDMR5                       _CAN3IDMR5.Byte
#define CAN3IDMR5_AM0                   _CAN3IDMR5.Bits.AM0
#define CAN3IDMR5_AM1                   _CAN3IDMR5.Bits.AM1
#define CAN3IDMR5_AM2                   _CAN3IDMR5.Bits.AM2
#define CAN3IDMR5_AM3                   _CAN3IDMR5.Bits.AM3
#define CAN3IDMR5_AM4                   _CAN3IDMR5.Bits.AM4
#define CAN3IDMR5_AM5                   _CAN3IDMR5.Bits.AM5
#define CAN3IDMR5_AM6                   _CAN3IDMR5.Bits.AM6
#define CAN3IDMR5_AM7                   _CAN3IDMR5.Bits.AM7

#define CAN3IDMR5_AM0_MASK              1U
#define CAN3IDMR5_AM1_MASK              2U
#define CAN3IDMR5_AM2_MASK              4U
#define CAN3IDMR5_AM3_MASK              8U
#define CAN3IDMR5_AM4_MASK              16U
#define CAN3IDMR5_AM5_MASK              32U
#define CAN3IDMR5_AM6_MASK              64U
#define CAN3IDMR5_AM7_MASK              128U


/*** CAN3IDMR6 - MSCAN3 Identifier Mask Register 6; 0x0000021E ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN3IDMR6STR;
extern volatile CAN3IDMR6STR _CAN3IDMR6 @(REG_BASE + 0x0000021EUL);
#define CAN3IDMR6                       _CAN3IDMR6.Byte
#define CAN3IDMR6_AM0                   _CAN3IDMR6.Bits.AM0
#define CAN3IDMR6_AM1                   _CAN3IDMR6.Bits.AM1
#define CAN3IDMR6_AM2                   _CAN3IDMR6.Bits.AM2
#define CAN3IDMR6_AM3                   _CAN3IDMR6.Bits.AM3
#define CAN3IDMR6_AM4                   _CAN3IDMR6.Bits.AM4
#define CAN3IDMR6_AM5                   _CAN3IDMR6.Bits.AM5
#define CAN3IDMR6_AM6                   _CAN3IDMR6.Bits.AM6
#define CAN3IDMR6_AM7                   _CAN3IDMR6.Bits.AM7

#define CAN3IDMR6_AM0_MASK              1U
#define CAN3IDMR6_AM1_MASK              2U
#define CAN3IDMR6_AM2_MASK              4U
#define CAN3IDMR6_AM3_MASK              8U
#define CAN3IDMR6_AM4_MASK              16U
#define CAN3IDMR6_AM5_MASK              32U
#define CAN3IDMR6_AM6_MASK              64U
#define CAN3IDMR6_AM7_MASK              128U


/*** CAN3IDMR7 - MSCAN3 Identifier Mask Register 7; 0x0000021F ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN3IDMR7STR;
extern volatile CAN3IDMR7STR _CAN3IDMR7 @(REG_BASE + 0x0000021FUL);
#define CAN3IDMR7                       _CAN3IDMR7.Byte
#define CAN3IDMR7_AM0                   _CAN3IDMR7.Bits.AM0
#define CAN3IDMR7_AM1                   _CAN3IDMR7.Bits.AM1
#define CAN3IDMR7_AM2                   _CAN3IDMR7.Bits.AM2
#define CAN3IDMR7_AM3                   _CAN3IDMR7.Bits.AM3
#define CAN3IDMR7_AM4                   _CAN3IDMR7.Bits.AM4
#define CAN3IDMR7_AM5                   _CAN3IDMR7.Bits.AM5
#define CAN3IDMR7_AM6                   _CAN3IDMR7.Bits.AM6
#define CAN3IDMR7_AM7                   _CAN3IDMR7.Bits.AM7

#define CAN3IDMR7_AM0_MASK              1U
#define CAN3IDMR7_AM1_MASK              2U
#define CAN3IDMR7_AM2_MASK              4U
#define CAN3IDMR7_AM3_MASK              8U
#define CAN3IDMR7_AM4_MASK              16U
#define CAN3IDMR7_AM5_MASK              32U
#define CAN3IDMR7_AM6_MASK              64U
#define CAN3IDMR7_AM7_MASK              128U


/*** CAN3RXIDR0 - MSCAN3 Receive Identifier Register 0; 0x00000220 ***/
typedef union {
  byte Byte;
  struct {
    byte ID21        :1;                                       /* Extended format identifier Bit 21 */
    byte ID22        :1;                                       /* Extended format identifier Bit 22 */
    byte ID23        :1;                                       /* Extended format identifier Bit 23 */
    byte ID24        :1;                                       /* Extended format identifier Bit 24 */
    byte ID25        :1;                                       /* Extended format identifier Bit 25 */
    byte ID26        :1;                                       /* Extended format identifier Bit 26 */
    byte ID27        :1;                                       /* Extended format identifier Bit 27 */
    byte ID28        :1;                                       /* Extended format identifier Bit 28 */
  } Bits;
} CAN3RXIDR0STR;
extern volatile CAN3RXIDR0STR _CAN3RXIDR0 @(REG_BASE + 0x00000220UL);
#define CAN3RXIDR0                      _CAN3RXIDR0.Byte
#define CAN3RXIDR0_ID21                 _CAN3RXIDR0.Bits.ID21
#define CAN3RXIDR0_ID22                 _CAN3RXIDR0.Bits.ID22
#define CAN3RXIDR0_ID23                 _CAN3RXIDR0.Bits.ID23
#define CAN3RXIDR0_ID24                 _CAN3RXIDR0.Bits.ID24
#define CAN3RXIDR0_ID25                 _CAN3RXIDR0.Bits.ID25
#define CAN3RXIDR0_ID26                 _CAN3RXIDR0.Bits.ID26
#define CAN3RXIDR0_ID27                 _CAN3RXIDR0.Bits.ID27
#define CAN3RXIDR0_ID28                 _CAN3RXIDR0.Bits.ID28
/* CAN3RXIDR_ARR: Access 4 CAN3RXIDRx registers in an array */
#define CAN3RXIDR_ARR                   ((volatile byte *) &CAN3RXIDR0)

#define CAN3RXIDR0_ID21_MASK            1U
#define CAN3RXIDR0_ID22_MASK            2U
#define CAN3RXIDR0_ID23_MASK            4U
#define CAN3RXIDR0_ID24_MASK            8U
#define CAN3RXIDR0_ID25_MASK            16U
#define CAN3RXIDR0_ID26_MASK            32U
#define CAN3RXIDR0_ID27_MASK            64U
#define CAN3RXIDR0_ID28_MASK            128U


/*** CAN3RXIDR1 - MSCAN3 Receive Identifier Register 1; 0x00000221 ***/
typedef union {
  byte Byte;
  struct {
    byte ID15        :1;                                       /* Extended format identifier Bit 15 */
    byte ID16        :1;                                       /* Extended format identifier Bit 16 */
    byte ID17        :1;                                       /* Extended format identifier Bit 17 */
    byte IDE         :1;                                       /* ID Extended */
    byte SRR         :1;                                       /* Substitute Remote Request */
    byte ID18        :1;                                       /* Extended format identifier Bit 18 */
    byte ID19        :1;                                       /* Extended format identifier Bit 19 */
    byte ID20        :1;                                       /* Extended format identifier Bit 20 */
  } Bits;
  struct {
    byte grpID_15 :3;
    byte         :1;
    byte         :1;
    byte grpID_18 :3;
  } MergedBits;
} CAN3RXIDR1STR;
extern volatile CAN3RXIDR1STR _CAN3RXIDR1 @(REG_BASE + 0x00000221UL);
#define CAN3RXIDR1                      _CAN3RXIDR1.Byte
#define CAN3RXIDR1_ID15                 _CAN3RXIDR1.Bits.ID15
#define CAN3RXIDR1_ID16                 _CAN3RXIDR1.Bits.ID16
#define CAN3RXIDR1_ID17                 _CAN3RXIDR1.Bits.ID17
#define CAN3RXIDR1_IDE                  _CAN3RXIDR1.Bits.IDE
#define CAN3RXIDR1_SRR                  _CAN3RXIDR1.Bits.SRR
#define CAN3RXIDR1_ID18                 _CAN3RXIDR1.Bits.ID18
#define CAN3RXIDR1_ID19                 _CAN3RXIDR1.Bits.ID19
#define CAN3RXIDR1_ID20                 _CAN3RXIDR1.Bits.ID20
#define CAN3RXIDR1_ID_15                _CAN3RXIDR1.MergedBits.grpID_15
#define CAN3RXIDR1_ID_18                _CAN3RXIDR1.MergedBits.grpID_18
#define CAN3RXIDR1_ID                   CAN3RXIDR1_ID_15

#define CAN3RXIDR1_ID15_MASK            1U
#define CAN3RXIDR1_ID16_MASK            2U
#define CAN3RXIDR1_ID17_MASK            4U
#define CAN3RXIDR1_IDE_MASK             8U
#define CAN3RXIDR1_SRR_MASK             16U
#define CAN3RXIDR1_ID18_MASK            32U
#define CAN3RXIDR1_ID19_MASK            64U
#define CAN3RXIDR1_ID20_MASK            128U
#define CAN3RXIDR1_ID_15_MASK           7U
#define CAN3RXIDR1_ID_15_BITNUM         0U
#define CAN3RXIDR1_ID_18_MASK           224U
#define CAN3RXIDR1_ID_18_BITNUM         5U


/*** CAN3RXIDR2 - MSCAN3 Receive Identifier Register 2; 0x00000222 ***/
typedef union {
  byte Byte;
  struct {
    byte ID7         :1;                                       /* Extended format identifier Bit 7 */
    byte ID8         :1;                                       /* Extended format identifier Bit 8 */
    byte ID9         :1;                                       /* Extended format identifier Bit 9 */
    byte ID10        :1;                                       /* Extended format identifier Bit 10 */
    byte ID11        :1;                                       /* Extended format identifier Bit 11 */
    byte ID12        :1;                                       /* Extended format identifier Bit 12 */
    byte ID13        :1;                                       /* Extended format identifier Bit 13 */
    byte ID14        :1;                                       /* Extended format identifier Bit 14 */
  } Bits;
} CAN3RXIDR2STR;
extern volatile CAN3RXIDR2STR _CAN3RXIDR2 @(REG_BASE + 0x00000222UL);
#define CAN3RXIDR2                      _CAN3RXIDR2.Byte
#define CAN3RXIDR2_ID7                  _CAN3RXIDR2.Bits.ID7
#define CAN3RXIDR2_ID8                  _CAN3RXIDR2.Bits.ID8
#define CAN3RXIDR2_ID9                  _CAN3RXIDR2.Bits.ID9
#define CAN3RXIDR2_ID10                 _CAN3RXIDR2.Bits.ID10
#define CAN3RXIDR2_ID11                 _CAN3RXIDR2.Bits.ID11
#define CAN3RXIDR2_ID12                 _CAN3RXIDR2.Bits.ID12
#define CAN3RXIDR2_ID13                 _CAN3RXIDR2.Bits.ID13
#define CAN3RXIDR2_ID14                 _CAN3RXIDR2.Bits.ID14

