frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
#define CAN3RXIDR2_ID7_MASK             1U
#define CAN3RXIDR2_ID8_MASK             2U
#define CAN3RXIDR2_ID9_MASK             4U
#define CAN3RXIDR2_ID10_MASK            8U
#define CAN3RXIDR2_ID11_MASK            16U
#define CAN3RXIDR2_ID12_MASK            32U
#define CAN3RXIDR2_ID13_MASK            64U
#define CAN3RXIDR2_ID14_MASK            128U


/*** CAN3RXIDR3 - MSCAN3 Receive Identifier Register 3; 0x00000223 ***/
typedef union {
  byte Byte;
  struct {
    byte RTR         :1;                                       /* Remote Transmission Request */
    byte ID0         :1;                                       /* Extended format identifier Bit 0 */
    byte ID1         :1;                                       /* Extended format identifier Bit 1 */
    byte ID2         :1;                                       /* Extended format identifier Bit 2 */
    byte ID3         :1;                                       /* Extended format identifier Bit 3 */
    byte ID4         :1;                                       /* Extended format identifier Bit 4 */
    byte ID5         :1;                                       /* Extended format identifier Bit 5 */
    byte ID6         :1;                                       /* Extended format identifier Bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpID   :7;
  } MergedBits;
} CAN3RXIDR3STR;
extern volatile CAN3RXIDR3STR _CAN3RXIDR3 @(REG_BASE + 0x00000223UL);
#define CAN3RXIDR3                      _CAN3RXIDR3.Byte
#define CAN3RXIDR3_RTR                  _CAN3RXIDR3.Bits.RTR
#define CAN3RXIDR3_ID0                  _CAN3RXIDR3.Bits.ID0
#define CAN3RXIDR3_ID1                  _CAN3RXIDR3.Bits.ID1
#define CAN3RXIDR3_ID2                  _CAN3RXIDR3.Bits.ID2
#define CAN3RXIDR3_ID3                  _CAN3RXIDR3.Bits.ID3
#define CAN3RXIDR3_ID4                  _CAN3RXIDR3.Bits.ID4
#define CAN3RXIDR3_ID5                  _CAN3RXIDR3.Bits.ID5
#define CAN3RXIDR3_ID6                  _CAN3RXIDR3.Bits.ID6
#define CAN3RXIDR3_ID                   _CAN3RXIDR3.MergedBits.grpID

#define CAN3RXIDR3_RTR_MASK             1U
#define CAN3RXIDR3_ID0_MASK             2U
#define CAN3RXIDR3_ID1_MASK             4U
#define CAN3RXIDR3_ID2_MASK             8U
#define CAN3RXIDR3_ID3_MASK             16U
#define CAN3RXIDR3_ID4_MASK             32U
#define CAN3RXIDR3_ID5_MASK             64U
#define CAN3RXIDR3_ID6_MASK             128U
#define CAN3RXIDR3_ID_MASK              254U
#define CAN3RXIDR3_ID_BITNUM            1U


/*** CAN3RXDSR0 - MSCAN3 Receive Data Segment Register 0; 0x00000224 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3RXDSR0STR;
extern volatile CAN3RXDSR0STR _CAN3RXDSR0 @(REG_BASE + 0x00000224UL);
#define CAN3RXDSR0                      _CAN3RXDSR0.Byte
#define CAN3RXDSR0_DB0                  _CAN3RXDSR0.Bits.DB0
#define CAN3RXDSR0_DB1                  _CAN3RXDSR0.Bits.DB1
#define CAN3RXDSR0_DB2                  _CAN3RXDSR0.Bits.DB2
#define CAN3RXDSR0_DB3                  _CAN3RXDSR0.Bits.DB3
#define CAN3RXDSR0_DB4                  _CAN3RXDSR0.Bits.DB4
#define CAN3RXDSR0_DB5                  _CAN3RXDSR0.Bits.DB5
#define CAN3RXDSR0_DB6                  _CAN3RXDSR0.Bits.DB6
#define CAN3RXDSR0_DB7                  _CAN3RXDSR0.Bits.DB7
/* CAN3RXDSR_ARR: Access 8 CAN3RXDSRx registers in an array */
#define CAN3RXDSR_ARR                   ((volatile byte *) &CAN3RXDSR0)

#define CAN3RXDSR0_DB0_MASK             1U
#define CAN3RXDSR0_DB1_MASK             2U
#define CAN3RXDSR0_DB2_MASK             4U
#define CAN3RXDSR0_DB3_MASK             8U
#define CAN3RXDSR0_DB4_MASK             16U
#define CAN3RXDSR0_DB5_MASK             32U
#define CAN3RXDSR0_DB6_MASK             64U
#define CAN3RXDSR0_DB7_MASK             128U


/*** CAN3RXDSR1 - MSCAN3 Receive Data Segment Register 1; 0x00000225 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3RXDSR1STR;
extern volatile CAN3RXDSR1STR _CAN3RXDSR1 @(REG_BASE + 0x00000225UL);
#define CAN3RXDSR1                      _CAN3RXDSR1.Byte
#define CAN3RXDSR1_DB0                  _CAN3RXDSR1.Bits.DB0
#define CAN3RXDSR1_DB1                  _CAN3RXDSR1.Bits.DB1
#define CAN3RXDSR1_DB2                  _CAN3RXDSR1.Bits.DB2
#define CAN3RXDSR1_DB3                  _CAN3RXDSR1.Bits.DB3
#define CAN3RXDSR1_DB4                  _CAN3RXDSR1.Bits.DB4
#define CAN3RXDSR1_DB5                  _CAN3RXDSR1.Bits.DB5
#define CAN3RXDSR1_DB6                  _CAN3RXDSR1.Bits.DB6
#define CAN3RXDSR1_DB7                  _CAN3RXDSR1.Bits.DB7

#define CAN3RXDSR1_DB0_MASK             1U
#define CAN3RXDSR1_DB1_MASK             2U
#define CAN3RXDSR1_DB2_MASK             4U
#define CAN3RXDSR1_DB3_MASK             8U
#define CAN3RXDSR1_DB4_MASK             16U
#define CAN3RXDSR1_DB5_MASK             32U
#define CAN3RXDSR1_DB6_MASK             64U
#define CAN3RXDSR1_DB7_MASK             128U


/*** CAN3RXDSR2 - MSCAN3 Receive Data Segment Register 2; 0x00000226 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3RXDSR2STR;
extern volatile CAN3RXDSR2STR _CAN3RXDSR2 @(REG_BASE + 0x00000226UL);
#define CAN3RXDSR2                      _CAN3RXDSR2.Byte
#define CAN3RXDSR2_DB0                  _CAN3RXDSR2.Bits.DB0
#define CAN3RXDSR2_DB1                  _CAN3RXDSR2.Bits.DB1
#define CAN3RXDSR2_DB2                  _CAN3RXDSR2.Bits.DB2
#define CAN3RXDSR2_DB3                  _CAN3RXDSR2.Bits.DB3
#define CAN3RXDSR2_DB4                  _CAN3RXDSR2.Bits.DB4
#define CAN3RXDSR2_DB5                  _CAN3RXDSR2.Bits.DB5
#define CAN3RXDSR2_DB6                  _CAN3RXDSR2.Bits.DB6
#define CAN3RXDSR2_DB7                  _CAN3RXDSR2.Bits.DB7

#define CAN3RXDSR2_DB0_MASK             1U
#define CAN3RXDSR2_DB1_MASK             2U
#define CAN3RXDSR2_DB2_MASK             4U
#define CAN3RXDSR2_DB3_MASK             8U
#define CAN3RXDSR2_DB4_MASK             16U
#define CAN3RXDSR2_DB5_MASK             32U
#define CAN3RXDSR2_DB6_MASK             64U
#define CAN3RXDSR2_DB7_MASK             128U


/*** CAN3RXDSR3 - MSCAN3 Receive Data Segment Register 3; 0x00000227 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3RXDSR3STR;
