frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
extern volatile CAN3RXDSR3STR _CAN3RXDSR3 @(REG_BASE + 0x00000227UL);
#define CAN3RXDSR3                      _CAN3RXDSR3.Byte
#define CAN3RXDSR3_DB0                  _CAN3RXDSR3.Bits.DB0
#define CAN3RXDSR3_DB1                  _CAN3RXDSR3.Bits.DB1
#define CAN3RXDSR3_DB2                  _CAN3RXDSR3.Bits.DB2
#define CAN3RXDSR3_DB3                  _CAN3RXDSR3.Bits.DB3
#define CAN3RXDSR3_DB4                  _CAN3RXDSR3.Bits.DB4
#define CAN3RXDSR3_DB5                  _CAN3RXDSR3.Bits.DB5
#define CAN3RXDSR3_DB6                  _CAN3RXDSR3.Bits.DB6
#define CAN3RXDSR3_DB7                  _CAN3RXDSR3.Bits.DB7

#define CAN3RXDSR3_DB0_MASK             1U
#define CAN3RXDSR3_DB1_MASK             2U
#define CAN3RXDSR3_DB2_MASK             4U
#define CAN3RXDSR3_DB3_MASK             8U
#define CAN3RXDSR3_DB4_MASK             16U
#define CAN3RXDSR3_DB5_MASK             32U
#define CAN3RXDSR3_DB6_MASK             64U
#define CAN3RXDSR3_DB7_MASK             128U


/*** CAN3RXDSR4 - MSCAN3 Receive Data Segment Register 4; 0x00000228 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3RXDSR4STR;
extern volatile CAN3RXDSR4STR _CAN3RXDSR4 @(REG_BASE + 0x00000228UL);
#define CAN3RXDSR4                      _CAN3RXDSR4.Byte
#define CAN3RXDSR4_DB0                  _CAN3RXDSR4.Bits.DB0
#define CAN3RXDSR4_DB1                  _CAN3RXDSR4.Bits.DB1
#define CAN3RXDSR4_DB2                  _CAN3RXDSR4.Bits.DB2
#define CAN3RXDSR4_DB3                  _CAN3RXDSR4.Bits.DB3
#define CAN3RXDSR4_DB4                  _CAN3RXDSR4.Bits.DB4
#define CAN3RXDSR4_DB5                  _CAN3RXDSR4.Bits.DB5
#define CAN3RXDSR4_DB6                  _CAN3RXDSR4.Bits.DB6
#define CAN3RXDSR4_DB7                  _CAN3RXDSR4.Bits.DB7

#define CAN3RXDSR4_DB0_MASK             1U
#define CAN3RXDSR4_DB1_MASK             2U
#define CAN3RXDSR4_DB2_MASK             4U
#define CAN3RXDSR4_DB3_MASK             8U
#define CAN3RXDSR4_DB4_MASK             16U
#define CAN3RXDSR4_DB5_MASK             32U
#define CAN3RXDSR4_DB6_MASK             64U
#define CAN3RXDSR4_DB7_MASK             128U


/*** CAN3RXDSR5 - MSCAN3 Receive Data Segment Register 5; 0x00000229 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3RXDSR5STR;
extern volatile CAN3RXDSR5STR _CAN3RXDSR5 @(REG_BASE + 0x00000229UL);
#define CAN3RXDSR5                      _CAN3RXDSR5.Byte
#define CAN3RXDSR5_DB0                  _CAN3RXDSR5.Bits.DB0
#define CAN3RXDSR5_DB1                  _CAN3RXDSR5.Bits.DB1
#define CAN3RXDSR5_DB2                  _CAN3RXDSR5.Bits.DB2
#define CAN3RXDSR5_DB3                  _CAN3RXDSR5.Bits.DB3
#define CAN3RXDSR5_DB4                  _CAN3RXDSR5.Bits.DB4
#define CAN3RXDSR5_DB5                  _CAN3RXDSR5.Bits.DB5
#define CAN3RXDSR5_DB6                  _CAN3RXDSR5.Bits.DB6
#define CAN3RXDSR5_DB7                  _CAN3RXDSR5.Bits.DB7

#define CAN3RXDSR5_DB0_MASK             1U
#define CAN3RXDSR5_DB1_MASK             2U
#define CAN3RXDSR5_DB2_MASK             4U
#define CAN3RXDSR5_DB3_MASK             8U
#define CAN3RXDSR5_DB4_MASK             16U
#define CAN3RXDSR5_DB5_MASK             32U
#define CAN3RXDSR5_DB6_MASK             64U
#define CAN3RXDSR5_DB7_MASK             128U


/*** CAN3RXDSR6 - MSCAN3 Receive Data Segment Register 6; 0x0000022A ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3RXDSR6STR;
extern volatile CAN3RXDSR6STR _CAN3RXDSR6 @(REG_BASE + 0x0000022AUL);
#define CAN3RXDSR6                      _CAN3RXDSR6.Byte
#define CAN3RXDSR6_DB0                  _CAN3RXDSR6.Bits.DB0
#define CAN3RXDSR6_DB1                  _CAN3RXDSR6.Bits.DB1
#define CAN3RXDSR6_DB2                  _CAN3RXDSR6.Bits.DB2
#define CAN3RXDSR6_DB3                  _CAN3RXDSR6.Bits.DB3
#define CAN3RXDSR6_DB4                  _CAN3RXDSR6.Bits.DB4
#define CAN3RXDSR6_DB5                  _CAN3RXDSR6.Bits.DB5
#define CAN3RXDSR6_DB6                  _CAN3RXDSR6.Bits.DB6
#define CAN3RXDSR6_DB7                  _CAN3RXDSR6.Bits.DB7

#define CAN3RXDSR6_DB0_MASK             1U
#define CAN3RXDSR6_DB1_MASK             2U
#define CAN3RXDSR6_DB2_MASK             4U
#define CAN3RXDSR6_DB3_MASK             8U
#define CAN3RXDSR6_DB4_MASK             16U
#define CAN3RXDSR6_DB5_MASK             32U
#define CAN3RXDSR6_DB6_MASK             64U
#define CAN3RXDSR6_DB7_MASK             128U


/*** CAN3RXDSR7 - MSCAN3 Receive Data Segment Register 7; 0x0000022B ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3RXDSR7STR;
extern volatile CAN3RXDSR7STR _CAN3RXDSR7 @(REG_BASE + 0x0000022BUL);
#define CAN3RXDSR7                      _CAN3RXDSR7.Byte
#define CAN3RXDSR7_DB0                  _CAN3RXDSR7.Bits.DB0
#define CAN3RXDSR7_DB1                  _CAN3RXDSR7.Bits.DB1
#define CAN3RXDSR7_DB2                  _CAN3RXDSR7.Bits.DB2
#define CAN3RXDSR7_DB3                  _CAN3RXDSR7.Bits.DB3
#define CAN3RXDSR7_DB4                  _CAN3RXDSR7.Bits.DB4
#define CAN3RXDSR7_DB5                  _CAN3RXDSR7.Bits.DB5
#define CAN3RXDSR7_DB6                  _CAN3RXDSR7.Bits.DB6
#define CAN3RXDSR7_DB7                  _CAN3RXDSR7.Bits.DB7

#define CAN3RXDSR7_DB0_MASK             1U
#define CAN3RXDSR7_DB1_MASK             2U
#define CAN3RXDSR7_DB2_MASK             4U
#define CAN3RXDSR7_DB3_MASK             8U
#define CAN3RXDSR7_DB4_MASK             16U
#define CAN3RXDSR7_DB5_MASK             32U
#define CAN3RXDSR7_DB6_MASK             64U
#define CAN3RXDSR7_DB7_MASK             128U


/*** CAN3RXDLR - MSCAN3 Receive Data Length Register; 0x0000022C ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3RXDLRSTR;
extern volatile CAN3RXDLRSTR _CAN3RXDLR @(REG_BASE + 0x0000022CUL);
#define CAN3RXDLR                       _CAN3RXDLR.Byte
#define CAN3RXDLR_DLC0                  _CAN3RXDLR.Bits.DLC0
#define CAN3RXDLR_DLC1                  _CAN3RXDLR.Bits.DLC1
#define CAN3RXDLR_DLC2                  _CAN3RXDLR.Bits.DLC2
#define CAN3RXDLR_DLC3                  _CAN3RXDLR.Bits.DLC3
#define CAN3RXDLR_DLC                   _CAN3RXDLR.MergedBits.grpDLC

