frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
/*** CAN3TXIDR1 - MSCAN3 Transmit Identifier Register 1; 0x00000231 ***/
typedef union {
  byte Byte;
  struct {
    byte ID15        :1;                                       /* Extended format identifier Bit 15 */
    byte ID16        :1;                                       /* Extended format identifier Bit 16 */
    byte ID17        :1;                                       /* Extended format identifier Bit 17 */
    byte IDE         :1;                                       /* ID Extended */
    byte SRR         :1;                                       /* Substitute Remote Request */
    byte ID18        :1;                                       /* Extended format identifier Bit 18 */
    byte ID19        :1;                                       /* Extended format identifier Bit 19 */
    byte ID20        :1;                                       /* Extended format identifier Bit 20 */
  } Bits;
  struct {
    byte grpID_15 :3;
    byte         :1;
    byte         :1;
    byte grpID_18 :3;
  } MergedBits;
} CAN3TXIDR1STR;
extern volatile CAN3TXIDR1STR _CAN3TXIDR1 @(REG_BASE + 0x00000231UL);
#define CAN3TXIDR1                      _CAN3TXIDR1.Byte
#define CAN3TXIDR1_ID15                 _CAN3TXIDR1.Bits.ID15
#define CAN3TXIDR1_ID16                 _CAN3TXIDR1.Bits.ID16
#define CAN3TXIDR1_ID17                 _CAN3TXIDR1.Bits.ID17
#define CAN3TXIDR1_IDE                  _CAN3TXIDR1.Bits.IDE
#define CAN3TXIDR1_SRR                  _CAN3TXIDR1.Bits.SRR
#define CAN3TXIDR1_ID18                 _CAN3TXIDR1.Bits.ID18
#define CAN3TXIDR1_ID19                 _CAN3TXIDR1.Bits.ID19
#define CAN3TXIDR1_ID20                 _CAN3TXIDR1.Bits.ID20
#define CAN3TXIDR1_ID_15                _CAN3TXIDR1.MergedBits.grpID_15
#define CAN3TXIDR1_ID_18                _CAN3TXIDR1.MergedBits.grpID_18
#define CAN3TXIDR1_ID                   CAN3TXIDR1_ID_15

#define CAN3TXIDR1_ID15_MASK            1U
#define CAN3TXIDR1_ID16_MASK            2U
#define CAN3TXIDR1_ID17_MASK            4U
#define CAN3TXIDR1_IDE_MASK             8U
#define CAN3TXIDR1_SRR_MASK             16U
#define CAN3TXIDR1_ID18_MASK            32U
#define CAN3TXIDR1_ID19_MASK            64U
#define CAN3TXIDR1_ID20_MASK            128U
#define CAN3TXIDR1_ID_15_MASK           7U
#define CAN3TXIDR1_ID_15_BITNUM         0U
#define CAN3TXIDR1_ID_18_MASK           224U
#define CAN3TXIDR1_ID_18_BITNUM         5U


/*** CAN3TXIDR2 - MSCAN3 Transmit Identifier Register 2; 0x00000232 ***/
typedef union {
  byte Byte;
  struct {
    byte ID7         :1;                                       /* Extended format identifier Bit 7 */
    byte ID8         :1;                                       /* Extended format identifier Bit 8 */
    byte ID9         :1;                                       /* Extended format identifier Bit 9 */
    byte ID10        :1;                                       /* Extended format identifier Bit 10 */
    byte ID11        :1;                                       /* Extended format identifier Bit 11 */
    byte ID12        :1;                                       /* Extended format identifier Bit 12 */
    byte ID13        :1;                                       /* Extended format identifier Bit 13 */
    byte ID14        :1;                                       /* Extended format identifier Bit 14 */
  } Bits;
} CAN3TXIDR2STR;
extern volatile CAN3TXIDR2STR _CAN3TXIDR2 @(REG_BASE + 0x00000232UL);
#define CAN3TXIDR2                      _CAN3TXIDR2.Byte
#define CAN3TXIDR2_ID7                  _CAN3TXIDR2.Bits.ID7
#define CAN3TXIDR2_ID8                  _CAN3TXIDR2.Bits.ID8
#define CAN3TXIDR2_ID9                  _CAN3TXIDR2.Bits.ID9
#define CAN3TXIDR2_ID10                 _CAN3TXIDR2.Bits.ID10
#define CAN3TXIDR2_ID11                 _CAN3TXIDR2.Bits.ID11
#define CAN3TXIDR2_ID12                 _CAN3TXIDR2.Bits.ID12
#define CAN3TXIDR2_ID13                 _CAN3TXIDR2.Bits.ID13
#define CAN3TXIDR2_ID14                 _CAN3TXIDR2.Bits.ID14

#define CAN3TXIDR2_ID7_MASK             1U
#define CAN3TXIDR2_ID8_MASK             2U
#define CAN3TXIDR2_ID9_MASK             4U
#define CAN3TXIDR2_ID10_MASK            8U
#define CAN3TXIDR2_ID11_MASK            16U
#define CAN3TXIDR2_ID12_MASK            32U
#define CAN3TXIDR2_ID13_MASK            64U
#define CAN3TXIDR2_ID14_MASK            128U


/*** CAN3TXIDR3 - MSCAN3 Transmit Identifier Register 3; 0x00000233 ***/
typedef union {
  byte Byte;
  struct {
    byte RTR         :1;                                       /* Remote Transmission Request */
    byte ID0         :1;                                       /* Extended format identifier Bit 0 */
    byte ID1         :1;                                       /* Extended format identifier Bit 1 */
    byte ID2         :1;                                       /* Extended format identifier Bit 2 */
    byte ID3         :1;                                       /* Extended format identifier Bit 3 */
    byte ID4         :1;                                       /* Extended format identifier Bit 4 */
    byte ID5         :1;                                       /* Extended format identifier Bit 5 */
    byte ID6         :1;                                       /* Extended format identifier Bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpID   :7;
  } MergedBits;
} CAN3TXIDR3STR;
extern volatile CAN3TXIDR3STR _CAN3TXIDR3 @(REG_BASE + 0x00000233UL);
#define CAN3TXIDR3                      _CAN3TXIDR3.Byte
#define CAN3TXIDR3_RTR                  _CAN3TXIDR3.Bits.RTR
#define CAN3TXIDR3_ID0                  _CAN3TXIDR3.Bits.ID0
#define CAN3TXIDR3_ID1                  _CAN3TXIDR3.Bits.ID1
#define CAN3TXIDR3_ID2                  _CAN3TXIDR3.Bits.ID2
#define CAN3TXIDR3_ID3                  _CAN3TXIDR3.Bits.ID3
#define CAN3TXIDR3_ID4                  _CAN3TXIDR3.Bits.ID4
#define CAN3TXIDR3_ID5                  _CAN3TXIDR3.Bits.ID5
#define CAN3TXIDR3_ID6                  _CAN3TXIDR3.Bits.ID6
#define CAN3TXIDR3_ID                   _CAN3TXIDR3.MergedBits.grpID

