frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
#define CAN3TXIDR3_RTR_MASK             1U
#define CAN3TXIDR3_ID0_MASK             2U
#define CAN3TXIDR3_ID1_MASK             4U
#define CAN3TXIDR3_ID2_MASK             8U
#define CAN3TXIDR3_ID3_MASK             16U
#define CAN3TXIDR3_ID4_MASK             32U
#define CAN3TXIDR3_ID5_MASK             64U
#define CAN3TXIDR3_ID6_MASK             128U
#define CAN3TXIDR3_ID_MASK              254U
#define CAN3TXIDR3_ID_BITNUM            1U


/*** CAN3TXDSR0 - MSCAN3 Transmit Data Segment Register 0; 0x00000234 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR0STR;
extern volatile CAN3TXDSR0STR _CAN3TXDSR0 @(REG_BASE + 0x00000234UL);
#define CAN3TXDSR0                      _CAN3TXDSR0.Byte
#define CAN3TXDSR0_DB0                  _CAN3TXDSR0.Bits.DB0
#define CAN3TXDSR0_DB1                  _CAN3TXDSR0.Bits.DB1
#define CAN3TXDSR0_DB2                  _CAN3TXDSR0.Bits.DB2
#define CAN3TXDSR0_DB3                  _CAN3TXDSR0.Bits.DB3
#define CAN3TXDSR0_DB4                  _CAN3TXDSR0.Bits.DB4
#define CAN3TXDSR0_DB5                  _CAN3TXDSR0.Bits.DB5
#define CAN3TXDSR0_DB6                  _CAN3TXDSR0.Bits.DB6
#define CAN3TXDSR0_DB7                  _CAN3TXDSR0.Bits.DB7
/* CAN3TXDSR_ARR: Access 8 CAN3TXDSRx registers in an array */
#define CAN3TXDSR_ARR                   ((volatile byte *) &CAN3TXDSR0)

#define CAN3TXDSR0_DB0_MASK             1U
#define CAN3TXDSR0_DB1_MASK             2U
#define CAN3TXDSR0_DB2_MASK             4U
#define CAN3TXDSR0_DB3_MASK             8U
#define CAN3TXDSR0_DB4_MASK             16U
#define CAN3TXDSR0_DB5_MASK             32U
#define CAN3TXDSR0_DB6_MASK             64U
#define CAN3TXDSR0_DB7_MASK             128U


/*** CAN3TXDSR1 - MSCAN3 Transmit Data Segment Register 1; 0x00000235 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR1STR;
extern volatile CAN3TXDSR1STR _CAN3TXDSR1 @(REG_BASE + 0x00000235UL);
#define CAN3TXDSR1                      _CAN3TXDSR1.Byte
#define CAN3TXDSR1_DB0                  _CAN3TXDSR1.Bits.DB0
#define CAN3TXDSR1_DB1                  _CAN3TXDSR1.Bits.DB1
#define CAN3TXDSR1_DB2                  _CAN3TXDSR1.Bits.DB2
#define CAN3TXDSR1_DB3                  _CAN3TXDSR1.Bits.DB3
#define CAN3TXDSR1_DB4                  _CAN3TXDSR1.Bits.DB4
#define CAN3TXDSR1_DB5                  _CAN3TXDSR1.Bits.DB5
#define CAN3TXDSR1_DB6                  _CAN3TXDSR1.Bits.DB6
#define CAN3TXDSR1_DB7                  _CAN3TXDSR1.Bits.DB7

#define CAN3TXDSR1_DB0_MASK             1U
#define CAN3TXDSR1_DB1_MASK             2U
#define CAN3TXDSR1_DB2_MASK             4U
#define CAN3TXDSR1_DB3_MASK             8U
#define CAN3TXDSR1_DB4_MASK             16U
#define CAN3TXDSR1_DB5_MASK             32U
#define CAN3TXDSR1_DB6_MASK             64U
#define CAN3TXDSR1_DB7_MASK             128U


/*** CAN3TXDSR2 - MSCAN3 Transmit Data Segment Register 2; 0x00000236 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR2STR;
extern volatile CAN3TXDSR2STR _CAN3TXDSR2 @(REG_BASE + 0x00000236UL);
#define CAN3TXDSR2                      _CAN3TXDSR2.Byte
#define CAN3TXDSR2_DB0                  _CAN3TXDSR2.Bits.DB0
#define CAN3TXDSR2_DB1                  _CAN3TXDSR2.Bits.DB1
#define CAN3TXDSR2_DB2                  _CAN3TXDSR2.Bits.DB2
#define CAN3TXDSR2_DB3                  _CAN3TXDSR2.Bits.DB3
#define CAN3TXDSR2_DB4                  _CAN3TXDSR2.Bits.DB4
#define CAN3TXDSR2_DB5                  _CAN3TXDSR2.Bits.DB5
#define CAN3TXDSR2_DB6                  _CAN3TXDSR2.Bits.DB6
#define CAN3TXDSR2_DB7                  _CAN3TXDSR2.Bits.DB7

#define CAN3TXDSR2_DB0_MASK             1U
#define CAN3TXDSR2_DB1_MASK             2U
#define CAN3TXDSR2_DB2_MASK             4U
#define CAN3TXDSR2_DB3_MASK             8U
#define CAN3TXDSR2_DB4_MASK             16U
#define CAN3TXDSR2_DB5_MASK             32U
#define CAN3TXDSR2_DB6_MASK             64U
#define CAN3TXDSR2_DB7_MASK             128U


/*** CAN3TXDSR3 - MSCAN3 Transmit Data Segment Register 3; 0x00000237 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR3STR;
extern volatile CAN3TXDSR3STR _CAN3TXDSR3 @(REG_BASE + 0x00000237UL);
#define CAN3TXDSR3                      _CAN3TXDSR3.Byte
#define CAN3TXDSR3_DB0                  _CAN3TXDSR3.Bits.DB0
#define CAN3TXDSR3_DB1                  _CAN3TXDSR3.Bits.DB1
#define CAN3TXDSR3_DB2                  _CAN3TXDSR3.Bits.DB2
#define CAN3TXDSR3_DB3                  _CAN3TXDSR3.Bits.DB3
#define CAN3TXDSR3_DB4                  _CAN3TXDSR3.Bits.DB4
#define CAN3TXDSR3_DB5                  _CAN3TXDSR3.Bits.DB5
#define CAN3TXDSR3_DB6                  _CAN3TXDSR3.Bits.DB6
#define CAN3TXDSR3_DB7                  _CAN3TXDSR3.Bits.DB7

#define CAN3TXDSR3_DB0_MASK             1U
#define CAN3TXDSR3_DB1_MASK             2U
#define CAN3TXDSR3_DB2_MASK             4U
#define CAN3TXDSR3_DB3_MASK             8U
#define CAN3TXDSR3_DB4_MASK             16U
#define CAN3TXDSR3_DB5_MASK             32U
#define CAN3TXDSR3_DB6_MASK             64U
#define CAN3TXDSR3_DB7_MASK             128U


/*** CAN3TXDSR4 - MSCAN3 Transmit Data Segment Register 4; 0x00000238 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR4STR;
extern volatile CAN3TXDSR4STR _CAN3TXDSR4 @(REG_BASE + 0x00000238UL);
#define CAN3TXDSR4                      _CAN3TXDSR4.Byte
#define CAN3TXDSR4_DB0                  _CAN3TXDSR4.Bits.DB0
#define CAN3TXDSR4_DB1                  _CAN3TXDSR4.Bits.DB1
#define CAN3TXDSR4_DB2                  _CAN3TXDSR4.Bits.DB2
#define CAN3TXDSR4_DB3                  _CAN3TXDSR4.Bits.DB3
#define CAN3TXDSR4_DB4                  _CAN3TXDSR4.Bits.DB4
#define CAN3TXDSR4_DB5                  _CAN3TXDSR4.Bits.DB5
#define CAN3TXDSR4_DB6                  _CAN3TXDSR4.Bits.DB6
#define CAN3TXDSR4_DB7                  _CAN3TXDSR4.Bits.DB7

#define CAN3TXDSR4_DB0_MASK             1U
#define CAN3TXDSR4_DB1_MASK             2U
#define CAN3TXDSR4_DB2_MASK             4U
#define CAN3TXDSR4_DB3_MASK             8U
#define CAN3TXDSR4_DB4_MASK             16U
#define CAN3TXDSR4_DB5_MASK             32U
#define CAN3TXDSR4_DB6_MASK             64U
#define CAN3TXDSR4_DB7_MASK             128U


