frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
/*** CAN3TXDSR5 - MSCAN3 Transmit Data Segment Register 5; 0x00000239 ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR5STR;
extern volatile CAN3TXDSR5STR _CAN3TXDSR5 @(REG_BASE + 0x00000239UL);
#define CAN3TXDSR5                      _CAN3TXDSR5.Byte
#define CAN3TXDSR5_DB0                  _CAN3TXDSR5.Bits.DB0
#define CAN3TXDSR5_DB1                  _CAN3TXDSR5.Bits.DB1
#define CAN3TXDSR5_DB2                  _CAN3TXDSR5.Bits.DB2
#define CAN3TXDSR5_DB3                  _CAN3TXDSR5.Bits.DB3
#define CAN3TXDSR5_DB4                  _CAN3TXDSR5.Bits.DB4
#define CAN3TXDSR5_DB5                  _CAN3TXDSR5.Bits.DB5
#define CAN3TXDSR5_DB6                  _CAN3TXDSR5.Bits.DB6
#define CAN3TXDSR5_DB7                  _CAN3TXDSR5.Bits.DB7

#define CAN3TXDSR5_DB0_MASK             1U
#define CAN3TXDSR5_DB1_MASK             2U
#define CAN3TXDSR5_DB2_MASK             4U
#define CAN3TXDSR5_DB3_MASK             8U
#define CAN3TXDSR5_DB4_MASK             16U
#define CAN3TXDSR5_DB5_MASK             32U
#define CAN3TXDSR5_DB6_MASK             64U
#define CAN3TXDSR5_DB7_MASK             128U


/*** CAN3TXDSR6 - MSCAN3 Transmit Data Segment Register 6; 0x0000023A ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR6STR;
extern volatile CAN3TXDSR6STR _CAN3TXDSR6 @(REG_BASE + 0x0000023AUL);
#define CAN3TXDSR6                      _CAN3TXDSR6.Byte
#define CAN3TXDSR6_DB0                  _CAN3TXDSR6.Bits.DB0
#define CAN3TXDSR6_DB1                  _CAN3TXDSR6.Bits.DB1
#define CAN3TXDSR6_DB2                  _CAN3TXDSR6.Bits.DB2
#define CAN3TXDSR6_DB3                  _CAN3TXDSR6.Bits.DB3
#define CAN3TXDSR6_DB4                  _CAN3TXDSR6.Bits.DB4
#define CAN3TXDSR6_DB5                  _CAN3TXDSR6.Bits.DB5
#define CAN3TXDSR6_DB6                  _CAN3TXDSR6.Bits.DB6
#define CAN3TXDSR6_DB7                  _CAN3TXDSR6.Bits.DB7

#define CAN3TXDSR6_DB0_MASK             1U
#define CAN3TXDSR6_DB1_MASK             2U
#define CAN3TXDSR6_DB2_MASK             4U
#define CAN3TXDSR6_DB3_MASK             8U
#define CAN3TXDSR6_DB4_MASK             16U
#define CAN3TXDSR6_DB5_MASK             32U
#define CAN3TXDSR6_DB6_MASK             64U
#define CAN3TXDSR6_DB7_MASK             128U


/*** CAN3TXDSR7 - MSCAN3 Transmit Data Segment Register 7; 0x0000023B ***/
typedef union {
  byte Byte;
  struct {
    byte DB0         :1;                                       /* Data Bit 0 */
    byte DB1         :1;                                       /* Data Bit 1 */
    byte DB2         :1;                                       /* Data Bit 2 */
    byte DB3         :1;                                       /* Data Bit 3 */
    byte DB4         :1;                                       /* Data Bit 4 */
    byte DB5         :1;                                       /* Data Bit 5 */
    byte DB6         :1;                                       /* Data Bit 6 */
    byte DB7         :1;                                       /* Data Bit 7 */
  } Bits;
} CAN3TXDSR7STR;
extern volatile CAN3TXDSR7STR _CAN3TXDSR7 @(REG_BASE + 0x0000023BUL);
#define CAN3TXDSR7                      _CAN3TXDSR7.Byte
#define CAN3TXDSR7_DB0                  _CAN3TXDSR7.Bits.DB0
#define CAN3TXDSR7_DB1                  _CAN3TXDSR7.Bits.DB1
#define CAN3TXDSR7_DB2                  _CAN3TXDSR7.Bits.DB2
#define CAN3TXDSR7_DB3                  _CAN3TXDSR7.Bits.DB3
#define CAN3TXDSR7_DB4                  _CAN3TXDSR7.Bits.DB4
#define CAN3TXDSR7_DB5                  _CAN3TXDSR7.Bits.DB5
#define CAN3TXDSR7_DB6                  _CAN3TXDSR7.Bits.DB6
#define CAN3TXDSR7_DB7                  _CAN3TXDSR7.Bits.DB7

#define CAN3TXDSR7_DB0_MASK             1U
#define CAN3TXDSR7_DB1_MASK             2U
#define CAN3TXDSR7_DB2_MASK             4U
#define CAN3TXDSR7_DB3_MASK             8U
#define CAN3TXDSR7_DB4_MASK             16U
#define CAN3TXDSR7_DB5_MASK             32U
#define CAN3TXDSR7_DB6_MASK             64U
#define CAN3TXDSR7_DB7_MASK             128U


/*** CAN3TXDLR - MSCAN3 Transmit Data Length Register; 0x0000023C ***/
typedef union {
  byte Byte;
  struct {
    byte DLC0        :1;                                       /* Data Length Code Bit 0 */
    byte DLC1        :1;                                       /* Data Length Code Bit 1 */
    byte DLC2        :1;                                       /* Data Length Code Bit 2 */
    byte DLC3        :1;                                       /* Data Length Code Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpDLC  :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN3TXDLRSTR;
extern volatile CAN3TXDLRSTR _CAN3TXDLR @(REG_BASE + 0x0000023CUL);
#define CAN3TXDLR                       _CAN3TXDLR.Byte
#define CAN3TXDLR_DLC0                  _CAN3TXDLR.Bits.DLC0
#define CAN3TXDLR_DLC1                  _CAN3TXDLR.Bits.DLC1
#define CAN3TXDLR_DLC2                  _CAN3TXDLR.Bits.DLC2
#define CAN3TXDLR_DLC3                  _CAN3TXDLR.Bits.DLC3
#define CAN3TXDLR_DLC                   _CAN3TXDLR.MergedBits.grpDLC

