frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
    /*** PER1AD1 - Port AD1L Pull Up Enable Register; 0x0000027F ***/
    union {
      byte Byte;
      struct {
        byte PER1AD10    :1;                                       /* Port AD1L pull up enable bit 0 */
        byte PER1AD11    :1;                                       /* Port AD1L pull up enable bit 1 */
        byte PER1AD12    :1;                                       /* Port AD1L pull up enable bit 2 */
        byte PER1AD13    :1;                                       /* Port AD1L pull up enable bit 3 */
        byte PER1AD14    :1;                                       /* Port AD1L pull up enable bit 4 */
        byte PER1AD15    :1;                                       /* Port AD1L pull up enable bit 5 */
        byte PER1AD16    :1;                                       /* Port AD1L pull up enable bit 6 */
        byte PER1AD17    :1;                                       /* Port AD1L pull up enable bit 7 */
      } Bits;
    } PER1AD1STR;
    #define PER1AD1                     _PER01AD1.Overlap_STR.PER1AD1STR.Byte
    #define PER1AD1_PER1AD10            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD10
    #define PER1AD1_PER1AD11            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD11
    #define PER1AD1_PER1AD12            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD12
    #define PER1AD1_PER1AD13            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD13
    #define PER1AD1_PER1AD14            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD14
    #define PER1AD1_PER1AD15            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD15
    #define PER1AD1_PER1AD16            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD16
    #define PER1AD1_PER1AD17            _PER01AD1.Overlap_STR.PER1AD1STR.Bits.PER1AD17
    
    #define PER1AD1_PER1AD10_MASK       1U
    #define PER1AD1_PER1AD11_MASK       2U
    #define PER1AD1_PER1AD12_MASK       4U
    #define PER1AD1_PER1AD13_MASK       8U
    #define PER1AD1_PER1AD14_MASK       16U
    #define PER1AD1_PER1AD15_MASK       32U
    #define PER1AD1_PER1AD16_MASK       64U
    #define PER1AD1_PER1AD17_MASK       128U
    
  } Overlap_STR;

  struct {
    word PER1AD10    :1;                                       /* Port AD1 pull up enable bit 0 */
    word PER1AD11    :1;                                       /* Port AD1 pull up enable bit 1 */
    word PER1AD12    :1;                                       /* Port AD1 pull up enable bit 2 */
    word PER1AD13    :1;                                       /* Port AD1 pull up enable bit 3 */
    word PER1AD14    :1;                                       /* Port AD1 pull up enable bit 4 */
    word PER1AD15    :1;                                       /* Port AD1 pull up enable bit 5 */
    word PER1AD16    :1;                                       /* Port AD1 pull up enable bit 6 */
    word PER1AD17    :1;                                       /* Port AD1 pull up enable bit 7 */
    word PER0AD10    :1;                                       /* Port AD1 pull up enable bit 8 */
    word PER0AD11    :1;                                       /* Port AD1 pull up enable bit 9 */
    word PER0AD12    :1;                                       /* Port AD1 pull up enable bit 10 */
    word PER0AD13    :1;                                       /* Port AD1 pull up enable bit 11 */
    word PER0AD14    :1;                                       /* Port AD1 pull up enable bit 12 */
    word PER0AD15    :1;                                       /* Port AD1 pull up enable bit 13 */
    word PER0AD16    :1;                                       /* Port AD1 pull up enable bit 14 */
    word PER0AD17    :1;                                       /* Port AD1 pull up enable bit 15 */
  } Bits;
  struct {
    word grpPER1AD_10 :8;
    word grpPER0AD_10 :8;
  } MergedBits;
} PER01AD1STR;
extern volatile PER01AD1STR _PER01AD1 @(REG_BASE + 0x0000027EUL);
#define PER01AD1                        _PER01AD1.Word
#define PER01AD1_PER1AD10               _PER01AD1.Bits.PER1AD10
#define PER01AD1_PER1AD11               _PER01AD1.Bits.PER1AD11
#define PER01AD1_PER1AD12               _PER01AD1.Bits.PER1AD12
#define PER01AD1_PER1AD13               _PER01AD1.Bits.PER1AD13
#define PER01AD1_PER1AD14               _PER01AD1.Bits.PER1AD14
#define PER01AD1_PER1AD15               _PER01AD1.Bits.PER1AD15
#define PER01AD1_PER1AD16               _PER01AD1.Bits.PER1AD16
#define PER01AD1_PER1AD17               _PER01AD1.Bits.PER1AD17
#define PER01AD1_PER0AD10               _PER01AD1.Bits.PER0AD10
#define PER01AD1_PER0AD11               _PER01AD1.Bits.PER0AD11
#define PER01AD1_PER0AD12               _PER01AD1.Bits.PER0AD12
#define PER01AD1_PER0AD13               _PER01AD1.Bits.PER0AD13
#define PER01AD1_PER0AD14               _PER01AD1.Bits.PER0AD14
#define PER01AD1_PER0AD15               _PER01AD1.Bits.PER0AD15
#define PER01AD1_PER0AD16               _PER01AD1.Bits.PER0AD16
#define PER01AD1_PER0AD17               _PER01AD1.Bits.PER0AD17
#define PER01AD1_PER1AD_10              _PER01AD1.MergedBits.grpPER1AD_10
#define PER01AD1_PER0AD_10              _PER01AD1.MergedBits.grpPER0AD_10
#define PER01AD1_PER1AD                 PER01AD1_PER1AD_10
#define PER01AD1_PER0AD                 PER01AD1_PER0AD_10

#define PER01AD1_PER1AD10_MASK          1U
#define PER01AD1_PER1AD11_MASK          2U
#define PER01AD1_PER1AD12_MASK          4U
#define PER01AD1_PER1AD13_MASK          8U
#define PER01AD1_PER1AD14_MASK          16U
#define PER01AD1_PER1AD15_MASK          32U
#define PER01AD1_PER1AD16_MASK          64U
#define PER01AD1_PER1AD17_MASK          128U
#define PER01AD1_PER0AD10_MASK          256U
#define PER01AD1_PER0AD11_MASK          512U
#define PER01AD1_PER0AD12_MASK          1024U
#define PER01AD1_PER0AD13_MASK          2048U
#define PER01AD1_PER0AD14_MASK          4096U
#define PER01AD1_PER0AD15_MASK          8192U
#define PER01AD1_PER0AD16_MASK          16384U
#define PER01AD1_PER0AD17_MASK          32768U
#define PER01AD1_PER1AD_10_MASK         255U
#define PER01AD1_PER1AD_10_BITNUM       0U
#define PER01AD1_PER0AD_10_MASK         65280U
#define PER01AD1_PER0AD_10_BITNUM       8U


/*** CAN4CTL0 - MSCAN4 Control 0 Register; 0x00000280 ***/
typedef union {
  byte Byte;
  struct {
    byte INITRQ      :1;                                       /* Initialization Mode Request */
    byte SLPRQ       :1;                                       /* Sleep Mode Request */
    byte WUPE        :1;                                       /* Wake-Up Enable */
    byte TIME        :1;                                       /* Timer Enable */
    byte SYNCH       :1;                                       /* Synchronized Status */
    byte CSWAI       :1;                                       /* CAN Stops in Wait Mode */
    byte RXACT       :1;                                       /* Receiver Active Status */
    byte RXFRM       :1;                                       /* Received Frame Flag */
  } Bits;
} CAN4CTL0STR;
extern volatile CAN4CTL0STR _CAN4CTL0 @(REG_BASE + 0x00000280UL);
#define CAN4CTL0                        _CAN4CTL0.Byte
#define CAN4CTL0_INITRQ                 _CAN4CTL0.Bits.INITRQ
#define CAN4CTL0_SLPRQ                  _CAN4CTL0.Bits.SLPRQ
#define CAN4CTL0_WUPE                   _CAN4CTL0.Bits.WUPE
#define CAN4CTL0_TIME                   _CAN4CTL0.Bits.TIME
#define CAN4CTL0_SYNCH                  _CAN4CTL0.Bits.SYNCH
#define CAN4CTL0_CSWAI                  _CAN4CTL0.Bits.CSWAI
#define CAN4CTL0_RXACT                  _CAN4CTL0.Bits.RXACT
#define CAN4CTL0_RXFRM                  _CAN4CTL0.Bits.RXFRM
/* CAN4CTL_ARR: Access 2 CAN4CTLx registers in an array */
#define CAN4CTL_ARR                     ((volatile byte *) &CAN4CTL0)

#define CAN4CTL0_INITRQ_MASK            1U
#define CAN4CTL0_SLPRQ_MASK             2U
#define CAN4CTL0_WUPE_MASK              4U
#define CAN4CTL0_TIME_MASK              8U
#define CAN4CTL0_SYNCH_MASK             16U
#define CAN4CTL0_CSWAI_MASK             32U
#define CAN4CTL0_RXACT_MASK             64U
#define CAN4CTL0_RXFRM_MASK             128U


