frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
/*** CAN4CTL1 - MSCAN4 Control 1 Register; 0x00000281 ***/
typedef union {
  byte Byte;
  struct {
    byte INITAK      :1;                                       /* Initialization Mode Acknowledge */
    byte SLPAK       :1;                                       /* Sleep Mode Acknowledge */
    byte WUPM        :1;                                       /* Wake-Up Mode */
    byte BORM        :1;                                       /* Bus-Off Recovery Mode */
    byte LISTEN      :1;                                       /* Listen Only Mode */
    byte LOOPB       :1;                                       /* Loop Back Self Test Mode */
    byte CLKSRC      :1;                                       /* MSCAN Clock Source */
    byte CANE        :1;                                       /* MSCAN Enable */
  } Bits;
} CAN4CTL1STR;
extern volatile CAN4CTL1STR _CAN4CTL1 @(REG_BASE + 0x00000281UL);
#define CAN4CTL1                        _CAN4CTL1.Byte
#define CAN4CTL1_INITAK                 _CAN4CTL1.Bits.INITAK
#define CAN4CTL1_SLPAK                  _CAN4CTL1.Bits.SLPAK
#define CAN4CTL1_WUPM                   _CAN4CTL1.Bits.WUPM
#define CAN4CTL1_BORM                   _CAN4CTL1.Bits.BORM
#define CAN4CTL1_LISTEN                 _CAN4CTL1.Bits.LISTEN
#define CAN4CTL1_LOOPB                  _CAN4CTL1.Bits.LOOPB
#define CAN4CTL1_CLKSRC                 _CAN4CTL1.Bits.CLKSRC
#define CAN4CTL1_CANE                   _CAN4CTL1.Bits.CANE

#define CAN4CTL1_INITAK_MASK            1U
#define CAN4CTL1_SLPAK_MASK             2U
#define CAN4CTL1_WUPM_MASK              4U
#define CAN4CTL1_BORM_MASK              8U
#define CAN4CTL1_LISTEN_MASK            16U
#define CAN4CTL1_LOOPB_MASK             32U
#define CAN4CTL1_CLKSRC_MASK            64U
#define CAN4CTL1_CANE_MASK              128U


/*** CAN4BTR0 - MSCAN4 Bus Timing Register 0; 0x00000282 ***/
typedef union {
  byte Byte;
  struct {
    byte BRP0        :1;                                       /* Baud Rate Prescaler 0 */
    byte BRP1        :1;                                       /* Baud Rate Prescaler 1 */
    byte BRP2        :1;                                       /* Baud Rate Prescaler 2 */
    byte BRP3        :1;                                       /* Baud Rate Prescaler 3 */
    byte BRP4        :1;                                       /* Baud Rate Prescaler 4 */
    byte BRP5        :1;                                       /* Baud Rate Prescaler 5 */
    byte SJW0        :1;                                       /* Synchronization Jump Width 0 */
    byte SJW1        :1;                                       /* Synchronization Jump Width 1 */
  } Bits;
  struct {
    byte grpBRP  :6;
    byte grpSJW  :2;
  } MergedBits;
} CAN4BTR0STR;
extern volatile CAN4BTR0STR _CAN4BTR0 @(REG_BASE + 0x00000282UL);
#define CAN4BTR0                        _CAN4BTR0.Byte
#define CAN4BTR0_BRP0                   _CAN4BTR0.Bits.BRP0
#define CAN4BTR0_BRP1                   _CAN4BTR0.Bits.BRP1
#define CAN4BTR0_BRP2                   _CAN4BTR0.Bits.BRP2
#define CAN4BTR0_BRP3                   _CAN4BTR0.Bits.BRP3
#define CAN4BTR0_BRP4                   _CAN4BTR0.Bits.BRP4
#define CAN4BTR0_BRP5                   _CAN4BTR0.Bits.BRP5
#define CAN4BTR0_SJW0                   _CAN4BTR0.Bits.SJW0
#define CAN4BTR0_SJW1                   _CAN4BTR0.Bits.SJW1
/* CAN4BTR_ARR: Access 2 CAN4BTRx registers in an array */
#define CAN4BTR_ARR                     ((volatile byte *) &CAN4BTR0)
#define CAN4BTR0_BRP                    _CAN4BTR0.MergedBits.grpBRP
#define CAN4BTR0_SJW                    _CAN4BTR0.MergedBits.grpSJW

#define CAN4BTR0_BRP0_MASK              1U
#define CAN4BTR0_BRP1_MASK              2U
#define CAN4BTR0_BRP2_MASK              4U
#define CAN4BTR0_BRP3_MASK              8U
#define CAN4BTR0_BRP4_MASK              16U
#define CAN4BTR0_BRP5_MASK              32U
#define CAN4BTR0_SJW0_MASK              64U
#define CAN4BTR0_SJW1_MASK              128U
#define CAN4BTR0_BRP_MASK               63U
#define CAN4BTR0_BRP_BITNUM             0U
#define CAN4BTR0_SJW_MASK               192U
#define CAN4BTR0_SJW_BITNUM             6U


/*** CAN4BTR1 - MSCAN4 Bus Timing Register 1; 0x00000283 ***/
typedef union {
  byte Byte;
  struct {
    byte TSEG10      :1;                                       /* Time Segment 10 */
    byte TSEG11      :1;                                       /* Time Segment 11 */
    byte TSEG12      :1;                                       /* Time Segment 12 */
    byte TSEG13      :1;                                       /* Time Segment 13 */
    byte TSEG20      :1;                                       /* Time Segment 20 */
    byte TSEG21      :1;                                       /* Time Segment 21 */
    byte TSEG22      :1;                                       /* Time Segment 22 */
    byte SAMP        :1;                                       /* Sampling */
  } Bits;
  struct {
    byte grpTSEG_10 :4;
    byte grpTSEG_20 :3;
    byte         :1;
  } MergedBits;
} CAN4BTR1STR;
extern volatile CAN4BTR1STR _CAN4BTR1 @(REG_BASE + 0x00000283UL);
#define CAN4BTR1                        _CAN4BTR1.Byte
#define CAN4BTR1_TSEG10                 _CAN4BTR1.Bits.TSEG10
#define CAN4BTR1_TSEG11                 _CAN4BTR1.Bits.TSEG11
#define CAN4BTR1_TSEG12                 _CAN4BTR1.Bits.TSEG12
#define CAN4BTR1_TSEG13                 _CAN4BTR1.Bits.TSEG13
#define CAN4BTR1_TSEG20                 _CAN4BTR1.Bits.TSEG20
#define CAN4BTR1_TSEG21                 _CAN4BTR1.Bits.TSEG21
#define CAN4BTR1_TSEG22                 _CAN4BTR1.Bits.TSEG22
#define CAN4BTR1_SAMP                   _CAN4BTR1.Bits.SAMP
#define CAN4BTR1_TSEG_10                _CAN4BTR1.MergedBits.grpTSEG_10
#define CAN4BTR1_TSEG_20                _CAN4BTR1.MergedBits.grpTSEG_20
#define CAN4BTR1_TSEG                   CAN4BTR1_TSEG_10

#define CAN4BTR1_TSEG10_MASK            1U
#define CAN4BTR1_TSEG11_MASK            2U
#define CAN4BTR1_TSEG12_MASK            4U
#define CAN4BTR1_TSEG13_MASK            8U
#define CAN4BTR1_TSEG20_MASK            16U
#define CAN4BTR1_TSEG21_MASK            32U
#define CAN4BTR1_TSEG22_MASK            64U
#define CAN4BTR1_SAMP_MASK              128U
#define CAN4BTR1_TSEG_10_MASK           15U
#define CAN4BTR1_TSEG_10_BITNUM         0U
#define CAN4BTR1_TSEG_20_MASK           112U
#define CAN4BTR1_TSEG_20_BITNUM         4U


/*** CAN4RFLG - MSCAN4 Receiver Flag Register; 0x00000284 ***/
typedef union {
  byte Byte;
  struct {
    byte RXF         :1;                                       /* Receive Buffer Full */
    byte OVRIF       :1;                                       /* Overrun Interrupt Flag */
    byte TSTAT0      :1;                                       /* Transmitter Status Bit 0 */
    byte TSTAT1      :1;                                       /* Transmitter Status Bit 1 */
    byte RSTAT0      :1;                                       /* Receiver Status Bit 0 */
    byte RSTAT1      :1;                                       /* Receiver Status Bit 1 */
    byte CSCIF       :1;                                       /* CAN Status Change Interrupt Flag */
    byte WUPIF       :1;                                       /* Wake-up Interrupt Flag */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTSTAT :2;
    byte grpRSTAT :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN4RFLGSTR;
extern volatile CAN4RFLGSTR _CAN4RFLG @(REG_BASE + 0x00000284UL);
#define CAN4RFLG                        _CAN4RFLG.Byte
#define CAN4RFLG_RXF                    _CAN4RFLG.Bits.RXF
#define CAN4RFLG_OVRIF                  _CAN4RFLG.Bits.OVRIF
#define CAN4RFLG_TSTAT0                 _CAN4RFLG.Bits.TSTAT0
#define CAN4RFLG_TSTAT1                 _CAN4RFLG.Bits.TSTAT1
#define CAN4RFLG_RSTAT0                 _CAN4RFLG.Bits.RSTAT0
#define CAN4RFLG_RSTAT1                 _CAN4RFLG.Bits.RSTAT1
#define CAN4RFLG_CSCIF                  _CAN4RFLG.Bits.CSCIF
#define CAN4RFLG_WUPIF                  _CAN4RFLG.Bits.WUPIF
#define CAN4RFLG_TSTAT                  _CAN4RFLG.MergedBits.grpTSTAT
#define CAN4RFLG_RSTAT                  _CAN4RFLG.MergedBits.grpRSTAT

#define CAN4RFLG_RXF_MASK               1U
#define CAN4RFLG_OVRIF_MASK             2U
#define CAN4RFLG_TSTAT0_MASK            4U
#define CAN4RFLG_TSTAT1_MASK            8U
#define CAN4RFLG_RSTAT0_MASK            16U
#define CAN4RFLG_RSTAT1_MASK            32U
#define CAN4RFLG_CSCIF_MASK             64U
#define CAN4RFLG_WUPIF_MASK             128U
#define CAN4RFLG_TSTAT_MASK             12U
#define CAN4RFLG_TSTAT_BITNUM           2U
#define CAN4RFLG_RSTAT_MASK             48U
#define CAN4RFLG_RSTAT_BITNUM           4U


/*** CAN4RIER - MSCAN4 Receiver Interrupt Enable Register; 0x00000285 ***/
typedef union {
  byte Byte;
  struct {
    byte RXFIE       :1;                                       /* Receiver Full Interrupt Enable */
    byte OVRIE       :1;                                       /* Overrun Interrupt Enable */
    byte TSTATE0     :1;                                       /* Transmitter Status Change Enable 0 */
    byte TSTATE1     :1;                                       /* Transmitter Status Change Enable 1 */
    byte RSTATE0     :1;                                       /* Receiver Status Change Enable 0 */
    byte RSTATE1     :1;                                       /* Receiver Status Change Enable 1 */
    byte CSCIE       :1;                                       /* CAN Status Change Interrupt Enable */
    byte WUPIE       :1;                                       /* Wake-up Interrupt Enable */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpTSTATE :2;
    byte grpRSTATE :2;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN4RIERSTR;
extern volatile CAN4RIERSTR _CAN4RIER @(REG_BASE + 0x00000285UL);
#define CAN4RIER                        _CAN4RIER.Byte
#define CAN4RIER_RXFIE                  _CAN4RIER.Bits.RXFIE
#define CAN4RIER_OVRIE                  _CAN4RIER.Bits.OVRIE
#define CAN4RIER_TSTATE0                _CAN4RIER.Bits.TSTATE0
#define CAN4RIER_TSTATE1                _CAN4RIER.Bits.TSTATE1
#define CAN4RIER_RSTATE0                _CAN4RIER.Bits.RSTATE0
#define CAN4RIER_RSTATE1                _CAN4RIER.Bits.RSTATE1
#define CAN4RIER_CSCIE                  _CAN4RIER.Bits.CSCIE
#define CAN4RIER_WUPIE                  _CAN4RIER.Bits.WUPIE
#define CAN4RIER_TSTATE                 _CAN4RIER.MergedBits.grpTSTATE
#define CAN4RIER_RSTATE                 _CAN4RIER.MergedBits.grpRSTATE

#define CAN4RIER_RXFIE_MASK             1U
#define CAN4RIER_OVRIE_MASK             2U
#define CAN4RIER_TSTATE0_MASK           4U
#define CAN4RIER_TSTATE1_MASK           8U
#define CAN4RIER_RSTATE0_MASK           16U
#define CAN4RIER_RSTATE1_MASK           32U
#define CAN4RIER_CSCIE_MASK             64U
#define CAN4RIER_WUPIE_MASK             128U
#define CAN4RIER_TSTATE_MASK            12U
#define CAN4RIER_TSTATE_BITNUM          2U
#define CAN4RIER_RSTATE_MASK            48U
#define CAN4RIER_RSTATE_BITNUM          4U


