frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
/*** CAN4TFLG - MSCAN4 Transmitter Flag Register; 0x00000286 ***/
typedef union {
  byte Byte;
  struct {
    byte TXE0        :1;                                       /* Transmitter Buffer Empty 0 */
    byte TXE1        :1;                                       /* Transmitter Buffer Empty 1 */
    byte TXE2        :1;                                       /* Transmitter Buffer Empty 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTXE  :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN4TFLGSTR;
extern volatile CAN4TFLGSTR _CAN4TFLG @(REG_BASE + 0x00000286UL);
#define CAN4TFLG                        _CAN4TFLG.Byte
#define CAN4TFLG_TXE0                   _CAN4TFLG.Bits.TXE0
#define CAN4TFLG_TXE1                   _CAN4TFLG.Bits.TXE1
#define CAN4TFLG_TXE2                   _CAN4TFLG.Bits.TXE2
#define CAN4TFLG_TXE                    _CAN4TFLG.MergedBits.grpTXE

#define CAN4TFLG_TXE0_MASK              1U
#define CAN4TFLG_TXE1_MASK              2U
#define CAN4TFLG_TXE2_MASK              4U
#define CAN4TFLG_TXE_MASK               7U
#define CAN4TFLG_TXE_BITNUM             0U


/*** CAN4TIER - MSCAN4 Transmitter Interrupt Enable Register; 0x00000287 ***/
typedef union {
  byte Byte;
  struct {
    byte TXEIE0      :1;                                       /* Transmitter Empty Interrupt Enable 0 */
    byte TXEIE1      :1;                                       /* Transmitter Empty Interrupt Enable 1 */
    byte TXEIE2      :1;                                       /* Transmitter Empty Interrupt Enable 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTXEIE :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN4TIERSTR;
extern volatile CAN4TIERSTR _CAN4TIER @(REG_BASE + 0x00000287UL);
#define CAN4TIER                        _CAN4TIER.Byte
#define CAN4TIER_TXEIE0                 _CAN4TIER.Bits.TXEIE0
#define CAN4TIER_TXEIE1                 _CAN4TIER.Bits.TXEIE1
#define CAN4TIER_TXEIE2                 _CAN4TIER.Bits.TXEIE2
#define CAN4TIER_TXEIE                  _CAN4TIER.MergedBits.grpTXEIE

#define CAN4TIER_TXEIE0_MASK            1U
#define CAN4TIER_TXEIE1_MASK            2U
#define CAN4TIER_TXEIE2_MASK            4U
#define CAN4TIER_TXEIE_MASK             7U
#define CAN4TIER_TXEIE_BITNUM           0U


/*** CAN4TARQ - MSCAN4 Transmitter Message Abort Request; 0x00000288 ***/
typedef union {
  byte Byte;
  struct {
    byte ABTRQ0      :1;                                       /* Abort Request 0 */
    byte ABTRQ1      :1;                                       /* Abort Request 1 */
    byte ABTRQ2      :1;                                       /* Abort Request 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpABTRQ :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN4TARQSTR;
extern volatile CAN4TARQSTR _CAN4TARQ @(REG_BASE + 0x00000288UL);
#define CAN4TARQ                        _CAN4TARQ.Byte
#define CAN4TARQ_ABTRQ0                 _CAN4TARQ.Bits.ABTRQ0
#define CAN4TARQ_ABTRQ1                 _CAN4TARQ.Bits.ABTRQ1
#define CAN4TARQ_ABTRQ2                 _CAN4TARQ.Bits.ABTRQ2
#define CAN4TARQ_ABTRQ                  _CAN4TARQ.MergedBits.grpABTRQ

#define CAN4TARQ_ABTRQ0_MASK            1U
#define CAN4TARQ_ABTRQ1_MASK            2U
#define CAN4TARQ_ABTRQ2_MASK            4U
#define CAN4TARQ_ABTRQ_MASK             7U
#define CAN4TARQ_ABTRQ_BITNUM           0U


/*** CAN4TAAK - MSCAN4 Transmitter Message Abort Acknowledge; 0x00000289 ***/
typedef union {
  byte Byte;
  struct {
    byte ABTAK0      :1;                                       /* Abort Acknowledge 0 */
    byte ABTAK1      :1;                                       /* Abort Acknowledge 1 */
    byte ABTAK2      :1;                                       /* Abort Acknowledge 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpABTAK :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN4TAAKSTR;
extern volatile CAN4TAAKSTR _CAN4TAAK @(REG_BASE + 0x00000289UL);
#define CAN4TAAK                        _CAN4TAAK.Byte
#define CAN4TAAK_ABTAK0                 _CAN4TAAK.Bits.ABTAK0
#define CAN4TAAK_ABTAK1                 _CAN4TAAK.Bits.ABTAK1
#define CAN4TAAK_ABTAK2                 _CAN4TAAK.Bits.ABTAK2
#define CAN4TAAK_ABTAK                  _CAN4TAAK.MergedBits.grpABTAK

#define CAN4TAAK_ABTAK0_MASK            1U
#define CAN4TAAK_ABTAK1_MASK            2U
#define CAN4TAAK_ABTAK2_MASK            4U
#define CAN4TAAK_ABTAK_MASK             7U
#define CAN4TAAK_ABTAK_BITNUM           0U


/*** CAN4TBSEL - MSCAN4 Transmit Buffer Selection; 0x0000028A ***/
typedef union {
  byte Byte;
  struct {
    byte TX0         :1;                                       /* Transmit Buffer Select 0 */
    byte TX1         :1;                                       /* Transmit Buffer Select 1 */
    byte TX2         :1;                                       /* Transmit Buffer Select 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpTX   :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} CAN4TBSELSTR;
extern volatile CAN4TBSELSTR _CAN4TBSEL @(REG_BASE + 0x0000028AUL);
#define CAN4TBSEL                       _CAN4TBSEL.Byte
#define CAN4TBSEL_TX0                   _CAN4TBSEL.Bits.TX0
#define CAN4TBSEL_TX1                   _CAN4TBSEL.Bits.TX1
#define CAN4TBSEL_TX2                   _CAN4TBSEL.Bits.TX2
#define CAN4TBSEL_TX                    _CAN4TBSEL.MergedBits.grpTX

#define CAN4TBSEL_TX0_MASK              1U
#define CAN4TBSEL_TX1_MASK              2U
#define CAN4TBSEL_TX2_MASK              4U
#define CAN4TBSEL_TX_MASK               7U
#define CAN4TBSEL_TX_BITNUM             0U


