frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
    /*** ATD0CMPEL - ATD 0 Compare Enable Register Low; 0x000002C9 ***/
    union {
      byte Byte;
      struct {
        byte CMPE0       :1;                                       /* Compare Enable for Conversion Number 0 of a Sequence */
        byte CMPE1       :1;                                       /* Compare Enable for Conversion Number 1 of a Sequence */
        byte CMPE2       :1;                                       /* Compare Enable for Conversion Number 2 of a Sequence */
        byte CMPE3       :1;                                       /* Compare Enable for Conversion Number 3 of a Sequence */
        byte CMPE4       :1;                                       /* Compare Enable for Conversion Number 4 of a Sequence */
        byte CMPE5       :1;                                       /* Compare Enable for Conversion Number 5 of a Sequence */
        byte CMPE6       :1;                                       /* Compare Enable for Conversion Number 6 of a Sequence */
        byte CMPE7       :1;                                       /* Compare Enable for Conversion Number 7 of a Sequence */
      } Bits;
    } ATD0CMPELSTR;
    #define ATD0CMPEL                   _ATD0CMPE.Overlap_STR.ATD0CMPELSTR.Byte
    #define ATD0CMPEL_CMPE0             _ATD0CMPE.Overlap_STR.ATD0CMPELSTR.Bits.CMPE0
    #define ATD0CMPEL_CMPE1             _ATD0CMPE.Overlap_STR.ATD0CMPELSTR.Bits.CMPE1
    #define ATD0CMPEL_CMPE2             _ATD0CMPE.Overlap_STR.ATD0CMPELSTR.Bits.CMPE2
    #define ATD0CMPEL_CMPE3             _ATD0CMPE.Overlap_STR.ATD0CMPELSTR.Bits.CMPE3
    #define ATD0CMPEL_CMPE4             _ATD0CMPE.Overlap_STR.ATD0CMPELSTR.Bits.CMPE4
    #define ATD0CMPEL_CMPE5             _ATD0CMPE.Overlap_STR.ATD0CMPELSTR.Bits.CMPE5
    #define ATD0CMPEL_CMPE6             _ATD0CMPE.Overlap_STR.ATD0CMPELSTR.Bits.CMPE6
    #define ATD0CMPEL_CMPE7             _ATD0CMPE.Overlap_STR.ATD0CMPELSTR.Bits.CMPE7
    
    #define ATD0CMPEL_CMPE0_MASK        1U
    #define ATD0CMPEL_CMPE1_MASK        2U
    #define ATD0CMPEL_CMPE2_MASK        4U
    #define ATD0CMPEL_CMPE3_MASK        8U
    #define ATD0CMPEL_CMPE4_MASK        16U
    #define ATD0CMPEL_CMPE5_MASK        32U
    #define ATD0CMPEL_CMPE6_MASK        64U
    #define ATD0CMPEL_CMPE7_MASK        128U
    
  } Overlap_STR;

  struct {
    word CMPE0       :1;                                       /* Compare Enable for Conversion Number 0 of a Sequence */
    word CMPE1       :1;                                       /* Compare Enable for Conversion Number 1 of a Sequence */
    word CMPE2       :1;                                       /* Compare Enable for Conversion Number 2 of a Sequence */
    word CMPE3       :1;                                       /* Compare Enable for Conversion Number 3 of a Sequence */
    word CMPE4       :1;                                       /* Compare Enable for Conversion Number 4 of a Sequence */
    word CMPE5       :1;                                       /* Compare Enable for Conversion Number 5 of a Sequence */
    word CMPE6       :1;                                       /* Compare Enable for Conversion Number 6 of a Sequence */
    word CMPE7       :1;                                       /* Compare Enable for Conversion Number 7 of a Sequence */
    word CMPE8       :1;                                       /* Compare Enable for Conversion Number 8 of a Sequence */
    word CMPE9       :1;                                       /* Compare Enable for Conversion Number 9 of a Sequence */
    word CMPE10      :1;                                       /* Compare Enable for Conversion Number 10 of a Sequence */
    word CMPE11      :1;                                       /* Compare Enable for Conversion Number 11 of a Sequence */
    word CMPE12      :1;                                       /* Compare Enable for Conversion Number 12 of a Sequence */
    word CMPE13      :1;                                       /* Compare Enable for Conversion Number 13 of a Sequence */
    word CMPE14      :1;                                       /* Compare Enable for Conversion Number 14 of a Sequence */
    word CMPE15      :1;                                       /* Compare Enable for Conversion Number 15 of a Sequence */
  } Bits;
} ATD0CMPESTR;
extern volatile ATD0CMPESTR _ATD0CMPE @(REG_BASE + 0x000002C8UL);
#define ATD0CMPE                        _ATD0CMPE.Word
#define ATD0CMPE_CMPE0                  _ATD0CMPE.Bits.CMPE0
#define ATD0CMPE_CMPE1                  _ATD0CMPE.Bits.CMPE1
#define ATD0CMPE_CMPE2                  _ATD0CMPE.Bits.CMPE2
#define ATD0CMPE_CMPE3                  _ATD0CMPE.Bits.CMPE3
#define ATD0CMPE_CMPE4                  _ATD0CMPE.Bits.CMPE4
#define ATD0CMPE_CMPE5                  _ATD0CMPE.Bits.CMPE5
#define ATD0CMPE_CMPE6                  _ATD0CMPE.Bits.CMPE6
#define ATD0CMPE_CMPE7                  _ATD0CMPE.Bits.CMPE7
#define ATD0CMPE_CMPE8                  _ATD0CMPE.Bits.CMPE8
#define ATD0CMPE_CMPE9                  _ATD0CMPE.Bits.CMPE9
#define ATD0CMPE_CMPE10                 _ATD0CMPE.Bits.CMPE10
#define ATD0CMPE_CMPE11                 _ATD0CMPE.Bits.CMPE11
#define ATD0CMPE_CMPE12                 _ATD0CMPE.Bits.CMPE12
#define ATD0CMPE_CMPE13                 _ATD0CMPE.Bits.CMPE13
#define ATD0CMPE_CMPE14                 _ATD0CMPE.Bits.CMPE14
#define ATD0CMPE_CMPE15                 _ATD0CMPE.Bits.CMPE15

#define ATD0CMPE_CMPE0_MASK             1U
#define ATD0CMPE_CMPE1_MASK             2U
#define ATD0CMPE_CMPE2_MASK             4U
#define ATD0CMPE_CMPE3_MASK             8U
#define ATD0CMPE_CMPE4_MASK             16U
#define ATD0CMPE_CMPE5_MASK             32U
#define ATD0CMPE_CMPE6_MASK             64U
#define ATD0CMPE_CMPE7_MASK             128U
#define ATD0CMPE_CMPE8_MASK             256U
#define ATD0CMPE_CMPE9_MASK             512U
#define ATD0CMPE_CMPE10_MASK            1024U
#define ATD0CMPE_CMPE11_MASK            2048U
#define ATD0CMPE_CMPE12_MASK            4096U
#define ATD0CMPE_CMPE13_MASK            8192U
#define ATD0CMPE_CMPE14_MASK            16384U
#define ATD0CMPE_CMPE15_MASK            32768U


