frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
        /*** SCI6BDH - SCI 6 Baud Rate Register High; Several registers at the same address ***/
        union {
          struct {
            byte SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
            byte SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
            byte SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
            byte SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
            byte SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
            byte TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
            byte TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
            byte IREN        :1;                                       /* Infrared Enable Bit */
          } Bits;
          struct {
            byte grpSBR_8 :5;
            byte grpTNP :2;
            byte :1;
          } MergedBits;
        } SCI6BDHSTR;
        #define SCI6BDH                 _SCI6BD.Overlap_STR.SCI6ASR1STR.Byte
        #define SCI6BDH_SBR8            _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.Bits.SBR8
        #define SCI6BDH_SBR9            _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.Bits.SBR9
        #define SCI6BDH_SBR10           _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.Bits.SBR10
        #define SCI6BDH_SBR11           _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.Bits.SBR11
        #define SCI6BDH_SBR12           _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.Bits.SBR12
        #define SCI6BDH_TNP0            _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.Bits.TNP0
        #define SCI6BDH_TNP1            _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.Bits.TNP1
        #define SCI6BDH_IREN            _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.Bits.IREN
        #define SCI6BDH_SBR_8           _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.MergedBits.grpSBR_8
        #define SCI6BDH_TNP             _SCI6BD.Overlap_STR.SCI6ASR1STR.SameAddr_STR.SCI6BDHSTR.MergedBits.grpTNP
        #define SCI6BDH_SBR             SCI6BDH_SBR_8
        
        #define SCI6BDH_SBR8_MASK       1U
        #define SCI6BDH_SBR9_MASK       2U
        #define SCI6BDH_SBR10_MASK      4U
        #define SCI6BDH_SBR11_MASK      8U
        #define SCI6BDH_SBR12_MASK      16U
        #define SCI6BDH_TNP0_MASK       32U
        #define SCI6BDH_TNP1_MASK       64U
        #define SCI6BDH_IREN_MASK       128U
        #define SCI6BDH_SBR_8_MASK      31U
        #define SCI6BDH_SBR_8_BITNUM    0U
        #define SCI6BDH_TNP_MASK        96U
        #define SCI6BDH_TNP_BITNUM      5U
        
      } SameAddr_STR; /*Several registers at the same address */
    
    } SCI6ASR1STR;
    

    /*** SCI6ACR1 - SCI 6 Alternative Control Register 1; 0x00000331 ***/
    union {
      byte Byte;
      union { /* Several registers at the same address */
        /*** SCI6ACR1 - SCI 6 Alternative Control Register 1; Several registers at the same address ***/
        union {
          struct {
            byte BKDIE       :1;                                       /* Break Detect Interrupt Enable */
            byte BERRIE      :1;                                       /* Bit Error Interrupt Enable */
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte RXEDGIE     :1;                                       /* Receive Input Active Edge Interrupt Enable */
          } Bits;
        } SCI6ACR1STR;
        #define SCI6ACR1                _SCI6BD.Overlap_STR.SCI6ACR1STR.Byte
        #define SCI6ACR1_BKDIE          _SCI6BD.Overlap_STR.SCI6ACR1STR.SameAddr_STR.SCI6ACR1STR.Bits.BKDIE
        #define SCI6ACR1_BERRIE         _SCI6BD.Overlap_STR.SCI6ACR1STR.SameAddr_STR.SCI6ACR1STR.Bits.BERRIE
        #define SCI6ACR1_RXEDGIE        _SCI6BD.Overlap_STR.SCI6ACR1STR.SameAddr_STR.SCI6ACR1STR.Bits.RXEDGIE
        
        #define SCI6ACR1_BKDIE_MASK     1U
        #define SCI6ACR1_BERRIE_MASK    2U
        #define SCI6ACR1_RXEDGIE_MASK   128U
        
        /*** SCI6BDL - SCI 6 Baud Rate Register Low; Several registers at the same address ***/
        union {
          struct {
            byte SBR0        :1;                                       /* SCI Baud Rate Bit 0 */
            byte SBR1        :1;                                       /* SCI Baud Rate Bit 1 */
            byte SBR2        :1;                                       /* SCI Baud Rate Bit 2 */
            byte SBR3        :1;                                       /* SCI Baud Rate Bit 3 */
            byte SBR4        :1;                                       /* SCI Baud Rate Bit 4 */
            byte SBR5        :1;                                       /* SCI Baud Rate Bit 5 */
            byte SBR6        :1;                                       /* SCI Baud Rate Bit 6 */
            byte SBR7        :1;                                       /* SCI Baud Rate Bit 7 */
          } Bits;
        } SCI6BDLSTR;
        #define SCI6BDL                 _SCI6BD.Overlap_STR.SCI6ACR1STR.Byte
        #define SCI6BDL_SBR0            _SCI6BD.Overlap_STR.SCI6ACR1STR.SameAddr_STR.SCI6BDLSTR.Bits.SBR0
        #define SCI6BDL_SBR1            _SCI6BD.Overlap_STR.SCI6ACR1STR.SameAddr_STR.SCI6BDLSTR.Bits.SBR1
        #define SCI6BDL_SBR2            _SCI6BD.Overlap_STR.SCI6ACR1STR.SameAddr_STR.SCI6BDLSTR.Bits.SBR2
        #define SCI6BDL_SBR3            _SCI6BD.Overlap_STR.SCI6ACR1STR.SameAddr_STR.SCI6BDLSTR.Bits.SBR3
        #define SCI6BDL_SBR4            _SCI6BD.Overlap_STR.SCI6ACR1STR.SameAddr_STR.SCI6BDLSTR.Bits.SBR4
        #define SCI6BDL_SBR5            _SCI6BD.Overlap_STR.SCI6ACR1STR.SameAddr_STR.SCI6BDLSTR.Bits.SBR5
        #define SCI6BDL_SBR6            _SCI6BD.Overlap_STR.SCI6ACR1STR.SameAddr_STR.SCI6BDLSTR.Bits.SBR6
        #define SCI6BDL_SBR7            _SCI6BD.Overlap_STR.SCI6ACR1STR.SameAddr_STR.SCI6BDLSTR.Bits.SBR7
        
        #define SCI6BDL_SBR0_MASK       1U
        #define SCI6BDL_SBR1_MASK       2U
        #define SCI6BDL_SBR2_MASK       4U
        #define SCI6BDL_SBR3_MASK       8U
        #define SCI6BDL_SBR4_MASK       16U
        #define SCI6BDL_SBR5_MASK       32U
        #define SCI6BDL_SBR6_MASK       64U
        #define SCI6BDL_SBR7_MASK       128U
        
