frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
  } SameAddr_STR; /*Several registers at the same address */

} SCI6ACR2STR;
extern volatile SCI6ACR2STR _SCI6ACR2 @(REG_BASE + 0x00000332UL);


/*** SCI6CR2 - SCI 6 Control Register 2; 0x00000333 ***/
typedef union {
  byte Byte;
  struct {
    byte SBK         :1;                                       /* Send Break Bit */
    byte RWU         :1;                                       /* Receiver Wakeup Bit */
    byte RE          :1;                                       /* Receiver Enable Bit */
    byte TE          :1;                                       /* Transmitter Enable Bit */
    byte ILIE        :1;                                       /* Idle Line Interrupt Enable Bit */
    byte RIE         :1;                                       /* Receiver Full Interrupt Enable Bit */
    byte TCIE        :1;                                       /* Transmission Complete Interrupt Enable Bit */
    byte TIE         :1;                                       /* Transmitter Interrupt Enable Bit */
  } Bits;
} SCI6CR2STR;
extern volatile SCI6CR2STR _SCI6CR2 @(REG_BASE + 0x00000333UL);
#define SCI6CR2                         _SCI6CR2.Byte
#define SCI6CR2_SBK                     _SCI6CR2.Bits.SBK
#define SCI6CR2_RWU                     _SCI6CR2.Bits.RWU
#define SCI6CR2_RE                      _SCI6CR2.Bits.RE
#define SCI6CR2_TE                      _SCI6CR2.Bits.TE
#define SCI6CR2_ILIE                    _SCI6CR2.Bits.ILIE
#define SCI6CR2_RIE                     _SCI6CR2.Bits.RIE
#define SCI6CR2_TCIE                    _SCI6CR2.Bits.TCIE
#define SCI6CR2_TIE                     _SCI6CR2.Bits.TIE

#define SCI6CR2_SBK_MASK                1U
#define SCI6CR2_RWU_MASK                2U
#define SCI6CR2_RE_MASK                 4U
#define SCI6CR2_TE_MASK                 8U
#define SCI6CR2_ILIE_MASK               16U
#define SCI6CR2_RIE_MASK                32U
#define SCI6CR2_TCIE_MASK               64U
#define SCI6CR2_TIE_MASK                128U


/*** SCI6SR1 - SCI 6 Status Register 1; 0x00000334 ***/
typedef union {
  byte Byte;
  struct {
    byte PF          :1;                                       /* Parity Error Flag */
    byte FE          :1;                                       /* Framing Error Flag */
    byte NF          :1;                                       /* Noise Flag */
    byte OR          :1;                                       /* Overrun Flag */
    byte IDLE        :1;                                       /* Idle Line Flag */
    byte RDRF_bit    :1;                                       /* Receive Data Register Full Flag */ /*Warning: bit name is duplicated with register name*/
    byte TC          :1;                                       /* Transmit Complete Flag */
    byte TDRE        :1;                                       /* Transmit Data Register Empty Flag */
  } Bits;
} SCI6SR1STR;
extern volatile SCI6SR1STR _SCI6SR1 @(REG_BASE + 0x00000334UL);
#define SCI6SR1                         _SCI6SR1.Byte
#define SCI6SR1_PF                      _SCI6SR1.Bits.PF
#define SCI6SR1_FE                      _SCI6SR1.Bits.FE
#define SCI6SR1_NF                      _SCI6SR1.Bits.NF
#define SCI6SR1_OR                      _SCI6SR1.Bits.OR
#define SCI6SR1_IDLE                    _SCI6SR1.Bits.IDLE
#define SCI6SR1_RDRF                    _SCI6SR1.Bits.RDRF_bit
#define SCI6SR1_TC                      _SCI6SR1.Bits.TC
#define SCI6SR1_TDRE                    _SCI6SR1.Bits.TDRE

#define SCI6SR1_PF_MASK                 1U
#define SCI6SR1_FE_MASK                 2U
#define SCI6SR1_NF_MASK                 4U
#define SCI6SR1_OR_MASK                 8U
#define SCI6SR1_IDLE_MASK               16U
#define SCI6SR1_RDRF_MASK               32U
#define SCI6SR1_TC_MASK                 64U
#define SCI6SR1_TDRE_MASK               128U


/*** SCI6SR2 - SCI 6 Status Register 2; 0x00000335 ***/
typedef union {
  byte Byte;
  struct {
    byte RAF         :1;                                       /* Receiver Active Flag */
    byte TXDIR       :1;                                       /* Transmitter pin data direction in Single-Wire mode */
    byte BRK13       :1;                                       /* Break Transmit character length */
    byte RXPOL       :1;                                       /* Receive Polarity */
    byte TXPOL       :1;                                       /* Transmit Polarity */
    byte             :1; 
    byte             :1; 
    byte AMAP        :1;                                       /* Alternative Map */
  } Bits;
} SCI6SR2STR;
extern volatile SCI6SR2STR _SCI6SR2 @(REG_BASE + 0x00000335UL);
#define SCI6SR2                         _SCI6SR2.Byte
#define SCI6SR2_RAF                     _SCI6SR2.Bits.RAF
#define SCI6SR2_TXDIR                   _SCI6SR2.Bits.TXDIR
#define SCI6SR2_BRK13                   _SCI6SR2.Bits.BRK13
#define SCI6SR2_RXPOL                   _SCI6SR2.Bits.RXPOL
#define SCI6SR2_TXPOL                   _SCI6SR2.Bits.TXPOL
#define SCI6SR2_AMAP                    _SCI6SR2.Bits.AMAP

#define SCI6SR2_RAF_MASK                1U
#define SCI6SR2_TXDIR_MASK              2U
#define SCI6SR2_BRK13_MASK              4U
#define SCI6SR2_RXPOL_MASK              8U
#define SCI6SR2_TXPOL_MASK              16U
#define SCI6SR2_AMAP_MASK               128U


/*** SCI6DRH - SCI 6 Data Register High; 0x00000336 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte T8          :1;                                       /* Transmit Bit 8 */
    byte R8          :1;                                       /* Received Bit 8 */
  } Bits;
} SCI6DRHSTR;
extern volatile SCI6DRHSTR _SCI6DRH @(REG_BASE + 0x00000336UL);
#define SCI6DRH                         _SCI6DRH.Byte
#define SCI6DRH_T8                      _SCI6DRH.Bits.T8
#define SCI6DRH_R8                      _SCI6DRH.Bits.R8

#define SCI6DRH_T8_MASK                 64U
#define SCI6DRH_R8_MASK                 128U


/*** SCI6DRL - SCI 6 Data Register Low; 0x00000337 ***/
typedef union {
  byte Byte;
  struct {
    byte R0_T0       :1;                                       /* Received bit 0 or Transmit bit 0 */
    byte R1_T1       :1;                                       /* Received bit 1 or Transmit bit 1 */
    byte R2_T2       :1;                                       /* Received bit 2 or Transmit bit 2 */
    byte R3_T3       :1;                                       /* Received bit 3 or Transmit bit 3 */
    byte R4_T4       :1;                                       /* Received bit 4 or Transmit bit 4 */
    byte R5_T5       :1;                                       /* Received bit 5 or Transmit bit 5 */
    byte R6_T6       :1;                                       /* Received bit 6 or Transmit bit 6 */
    byte R7_T7       :1;                                       /* Received bit 7 or Transmit bit 7 */
  } Bits;
} SCI6DRLSTR;
extern volatile SCI6DRLSTR _SCI6DRL @(REG_BASE + 0x00000337UL);
#define SCI6DRL                         _SCI6DRL.Byte
#define SCI6DRL_R0_T0                   _SCI6DRL.Bits.R0_T0
#define SCI6DRL_R1_T1                   _SCI6DRL.Bits.R1_T1
#define SCI6DRL_R2_T2                   _SCI6DRL.Bits.R2_T2
#define SCI6DRL_R3_T3                   _SCI6DRL.Bits.R3_T3
#define SCI6DRL_R4_T4                   _SCI6DRL.Bits.R4_T4
#define SCI6DRL_R5_T5                   _SCI6DRL.Bits.R5_T5
#define SCI6DRL_R6_T6                   _SCI6DRL.Bits.R6_T6
#define SCI6DRL_R7_T7                   _SCI6DRL.Bits.R7_T7

#define SCI6DRL_R0_T0_MASK              1U
#define SCI6DRL_R1_T1_MASK              2U
#define SCI6DRL_R2_T2_MASK              4U
#define SCI6DRL_R3_T3_MASK              8U
#define SCI6DRL_R4_T4_MASK              16U
#define SCI6DRL_R5_T5_MASK              32U
#define SCI6DRL_R6_T6_MASK              64U
#define SCI6DRL_R7_T7_MASK              128U


/*** SCI7BD - SCI 7 Baud Rate Register; 0x00000338 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** SCI7ASR1 - SCI 7 Alternative Status Register 1; 0x00000338 ***/
    union {
      byte Byte;
      union { /* Several registers at the same address */
        /*** SCI7ASR1 - SCI 7 Alternative Status Register 1; Several registers at the same address ***/
        union {
          struct {
            byte BKDIF       :1;                                       /* Break Detect Interrupt Flag */
            byte BERRIF      :1;                                       /* Bit Error Interrupt Flag */
            byte BERRV       :1;                                       /* Bit Error Value */
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte             :1; 
            byte RXEDGIF     :1;                                       /* Receive Input Active Edge Interrupt Flag */
          } Bits;
        } SCI7ASR1STR;
        #define SCI7ASR1                _SCI7BD.Overlap_STR.SCI7ASR1STR.Byte
        #define SCI7ASR1_BKDIF          _SCI7BD.Overlap_STR.SCI7ASR1STR.SameAddr_STR.SCI7ASR1STR.Bits.BKDIF
        #define SCI7ASR1_BERRIF         _SCI7BD.Overlap_STR.SCI7ASR1STR.SameAddr_STR.SCI7ASR1STR.Bits.BERRIF
        #define SCI7ASR1_BERRV          _SCI7BD.Overlap_STR.SCI7ASR1STR.SameAddr_STR.SCI7ASR1STR.Bits.BERRV
        #define SCI7ASR1_RXEDGIF        _SCI7BD.Overlap_STR.SCI7ASR1STR.SameAddr_STR.SCI7ASR1STR.Bits.RXEDGIF
        
        #define SCI7ASR1_BKDIF_MASK     1U
        #define SCI7ASR1_BERRIF_MASK    2U
        #define SCI7ASR1_BERRV_MASK     4U
        #define SCI7ASR1_RXEDGIF_MASK   128U
        
        /*** SCI7BDH - SCI 7 Baud Rate Register High; Several registers at the same address ***/
        union {
          struct {
            byte SBR8        :1;                                       /* SCI Baud Rate Bit 8 */
            byte SBR9        :1;                                       /* SCI Baud Rate Bit 9 */
            byte SBR10       :1;                                       /* SCI Baud Rate Bit 10 */
            byte SBR11       :1;                                       /* SCI Baud Rate Bit 11 */
            byte SBR12       :1;                                       /* SCI Baud Rate Bit 12 */
            byte TNP0        :1;                                       /* Transmitter Narrow Pulse Bit 0 */
            byte TNP1        :1;                                       /* Transmitter Narrow Pulse Bit 1 */
            byte IREN        :1;                                       /* Infrared Enable Bit */
          } Bits;
          struct {
            byte grpSBR_8 :5;
            byte grpTNP :2;
            byte :1;
          } MergedBits;
        } SCI7BDHSTR;
        #define SCI7BDH                 _SCI7BD.Overlap_STR.SCI7ASR1STR.Byte
        #define SCI7BDH_SBR8            _SCI7BD.Overlap_STR.SCI7ASR1STR.SameAddr_STR.SCI7BDHSTR.Bits.SBR8
        #define SCI7BDH_SBR9            _SCI7BD.Overlap_STR.SCI7ASR1STR.SameAddr_STR.SCI7BDHSTR.Bits.SBR9
        #define SCI7BDH_SBR10           _SCI7BD.Overlap_STR.SCI7ASR1STR.SameAddr_STR.SCI7BDHSTR.Bits.SBR10
        #define SCI7BDH_SBR11           _SCI7BD.Overlap_STR.SCI7ASR1STR.SameAddr_STR.SCI7BDHSTR.Bits.SBR11
        #define SCI7BDH_SBR12           _SCI7BD.Overlap_STR.SCI7ASR1STR.SameAddr_STR.SCI7BDHSTR.Bits.SBR12
        #define SCI7BDH_TNP0            _SCI7BD.Overlap_STR.SCI7ASR1STR.SameAddr_STR.SCI7BDHSTR.Bits.TNP0
        #define SCI7BDH_TNP1            _SCI7BD.Overlap_STR.SCI7ASR1STR.SameAddr_STR.SCI7BDHSTR.Bits.TNP1
        #define SCI7BDH_IREN            _SCI7BD.Overlap_STR.SCI7ASR1STR.SameAddr_STR.SCI7BDHSTR.Bits.IREN
        #define SCI7BDH_SBR_8           _SCI7BD.Overlap_STR.SCI7ASR1STR.SameAddr_STR.SCI7BDHSTR.MergedBits.grpSBR_8
        #define SCI7BDH_TNP             _SCI7BD.Overlap_STR.SCI7ASR1STR.SameAddr_STR.SCI7BDHSTR.MergedBits.grpTNP
        #define SCI7BDH_SBR             SCI7BDH_SBR_8
        
        #define SCI7BDH_SBR8_MASK       1U
        #define SCI7BDH_SBR9_MASK       2U
        #define SCI7BDH_SBR10_MASK      4U
        #define SCI7BDH_SBR11_MASK      8U
        #define SCI7BDH_SBR12_MASK      16U
        #define SCI7BDH_TNP0_MASK       32U
        #define SCI7BDH_TNP1_MASK       64U
        #define SCI7BDH_IREN_MASK       128U
        #define SCI7BDH_SBR_8_MASK      31U
        #define SCI7BDH_SBR_8_BITNUM    0U
        #define SCI7BDH_TNP_MASK        96U
        #define SCI7BDH_TNP_BITNUM      5U
        
