frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
/*** XGIF_6F_60 - XGATE Channel Interrupt Flag Vector; 0x0000038A ***/
typedef union {
  word Word;
  struct {
    word XGIF_60     :1;                                       /* Channel Interrupt Flags, bit 96 */
    word XGIF_61     :1;                                       /* Channel Interrupt Flags, bit 97 */
    word XGIF_62     :1;                                       /* Channel Interrupt Flags, bit 98 */
    word XGIF_63     :1;                                       /* Channel Interrupt Flags, bit 99 */
    word XGIF_64     :1;                                       /* Channel Interrupt Flags, bit 100 */
    word XGIF_65     :1;                                       /* Channel Interrupt Flags, bit 101 */
    word XGIF_66     :1;                                       /* Channel Interrupt Flags, bit 102 */
    word XGIF_67     :1;                                       /* Channel Interrupt Flags, bit 103 */
    word XGIF_68     :1;                                       /* Channel Interrupt Flags, bit 104 */
    word XGIF_69     :1;                                       /* Channel Interrupt Flags, bit 105 */
    word XGIF_6A     :1;                                       /* Channel Interrupt Flags, bit 106 */
    word XGIF_6B     :1;                                       /* Channel Interrupt Flags, bit 107 */
    word XGIF_6C     :1;                                       /* Channel Interrupt Flags, bit 108 */
    word XGIF_6D     :1;                                       /* Channel Interrupt Flags, bit 109 */
    word XGIF_6E     :1;                                       /* Channel Interrupt Flags, bit 110 */
    word XGIF_6F     :1;                                       /* Channel Interrupt Flags, bit 111 */
  } Bits;
  struct {
    word grpXGIF__60 :10;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} XGIF_6F_60STR;
extern volatile XGIF_6F_60STR _XGIF_6F_60 @(REG_BASE + 0x0000038AUL);
#define XGIF_6F_60                      _XGIF_6F_60.Word
#define XGIF_6F_60_XGIF_60              _XGIF_6F_60.Bits.XGIF_60
#define XGIF_6F_60_XGIF_61              _XGIF_6F_60.Bits.XGIF_61
#define XGIF_6F_60_XGIF_62              _XGIF_6F_60.Bits.XGIF_62
#define XGIF_6F_60_XGIF_63              _XGIF_6F_60.Bits.XGIF_63
#define XGIF_6F_60_XGIF_64              _XGIF_6F_60.Bits.XGIF_64
#define XGIF_6F_60_XGIF_65              _XGIF_6F_60.Bits.XGIF_65
#define XGIF_6F_60_XGIF_66              _XGIF_6F_60.Bits.XGIF_66
#define XGIF_6F_60_XGIF_67              _XGIF_6F_60.Bits.XGIF_67
#define XGIF_6F_60_XGIF_68              _XGIF_6F_60.Bits.XGIF_68
#define XGIF_6F_60_XGIF_69              _XGIF_6F_60.Bits.XGIF_69
#define XGIF_6F_60_XGIF_6A              _XGIF_6F_60.Bits.XGIF_6A
#define XGIF_6F_60_XGIF_6B              _XGIF_6F_60.Bits.XGIF_6B
#define XGIF_6F_60_XGIF_6C              _XGIF_6F_60.Bits.XGIF_6C
#define XGIF_6F_60_XGIF_6D              _XGIF_6F_60.Bits.XGIF_6D
#define XGIF_6F_60_XGIF_6E              _XGIF_6F_60.Bits.XGIF_6E
#define XGIF_6F_60_XGIF_6F              _XGIF_6F_60.Bits.XGIF_6F
#define XGIF_6F_60_XGIF__60             _XGIF_6F_60.MergedBits.grpXGIF__60
#define XGIF_6F_60_XGIF_                XGIF_6F_60_XGIF__60

#define XGIF_6F_60_XGIF_60_MASK         1U
#define XGIF_6F_60_XGIF_61_MASK         2U
#define XGIF_6F_60_XGIF_62_MASK         4U
#define XGIF_6F_60_XGIF_63_MASK         8U
#define XGIF_6F_60_XGIF_64_MASK         16U
#define XGIF_6F_60_XGIF_65_MASK         32U
#define XGIF_6F_60_XGIF_66_MASK         64U
#define XGIF_6F_60_XGIF_67_MASK         128U
#define XGIF_6F_60_XGIF_68_MASK         256U
#define XGIF_6F_60_XGIF_69_MASK         512U
#define XGIF_6F_60_XGIF_6A_MASK         1024U
#define XGIF_6F_60_XGIF_6B_MASK         2048U
#define XGIF_6F_60_XGIF_6C_MASK         4096U
#define XGIF_6F_60_XGIF_6D_MASK         8192U
#define XGIF_6F_60_XGIF_6E_MASK         16384U
#define XGIF_6F_60_XGIF_6F_MASK         32768U
#define XGIF_6F_60_XGIF__60_MASK        1023U
#define XGIF_6F_60_XGIF__60_BITNUM      0U


/*** XGIF_5F_50 - XGATE Channel Interrupt Flag Vector; 0x0000038C ***/
typedef union {
  word Word;
  struct {
    word XGIF_50     :1;                                       /* Channel Interrupt Flags, bit 80 */
    word XGIF_51     :1;                                       /* Channel Interrupt Flags, bit 81 */
    word XGIF_52     :1;                                       /* Channel Interrupt Flags, bit 82 */
    word XGIF_53     :1;                                       /* Channel Interrupt Flags, bit 83 */
    word XGIF_54     :1;                                       /* Channel Interrupt Flags, bit 84 */
    word XGIF_55     :1;                                       /* Channel Interrupt Flags, bit 85 */
    word XGIF_56     :1;                                       /* Channel Interrupt Flags, bit 86 */
    word XGIF_57     :1;                                       /* Channel Interrupt Flags, bit 87 */
    word XGIF_58     :1;                                       /* Channel Interrupt Flags, bit 88 */
    word XGIF_59     :1;                                       /* Channel Interrupt Flags, bit 89 */
    word XGIF_5A     :1;                                       /* Channel Interrupt Flags, bit 90 */
    word XGIF_5B     :1;                                       /* Channel Interrupt Flags, bit 91 */
    word XGIF_5C     :1;                                       /* Channel Interrupt Flags, bit 92 */
    word XGIF_5D     :1;                                       /* Channel Interrupt Flags, bit 93 */
    word XGIF_5E     :1;                                       /* Channel Interrupt Flags, bit 94 */
    word XGIF_5F     :1;                                       /* Channel Interrupt Flags, bit 95 */
  } Bits;
  struct {
    word grpXGIF__50 :10;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} XGIF_5F_50STR;
extern volatile XGIF_5F_50STR _XGIF_5F_50 @(REG_BASE + 0x0000038CUL);
#define XGIF_5F_50                      _XGIF_5F_50.Word
#define XGIF_5F_50_XGIF_50              _XGIF_5F_50.Bits.XGIF_50
#define XGIF_5F_50_XGIF_51              _XGIF_5F_50.Bits.XGIF_51
#define XGIF_5F_50_XGIF_52              _XGIF_5F_50.Bits.XGIF_52
#define XGIF_5F_50_XGIF_53              _XGIF_5F_50.Bits.XGIF_53
#define XGIF_5F_50_XGIF_54              _XGIF_5F_50.Bits.XGIF_54
#define XGIF_5F_50_XGIF_55              _XGIF_5F_50.Bits.XGIF_55
#define XGIF_5F_50_XGIF_56              _XGIF_5F_50.Bits.XGIF_56
#define XGIF_5F_50_XGIF_57              _XGIF_5F_50.Bits.XGIF_57
#define XGIF_5F_50_XGIF_58              _XGIF_5F_50.Bits.XGIF_58
#define XGIF_5F_50_XGIF_59              _XGIF_5F_50.Bits.XGIF_59
#define XGIF_5F_50_XGIF_5A              _XGIF_5F_50.Bits.XGIF_5A
#define XGIF_5F_50_XGIF_5B              _XGIF_5F_50.Bits.XGIF_5B
#define XGIF_5F_50_XGIF_5C              _XGIF_5F_50.Bits.XGIF_5C
#define XGIF_5F_50_XGIF_5D              _XGIF_5F_50.Bits.XGIF_5D
#define XGIF_5F_50_XGIF_5E              _XGIF_5F_50.Bits.XGIF_5E
#define XGIF_5F_50_XGIF_5F              _XGIF_5F_50.Bits.XGIF_5F
#define XGIF_5F_50_XGIF__50             _XGIF_5F_50.MergedBits.grpXGIF__50
#define XGIF_5F_50_XGIF_                XGIF_5F_50_XGIF__50

#define XGIF_5F_50_XGIF_50_MASK         1U
#define XGIF_5F_50_XGIF_51_MASK         2U
#define XGIF_5F_50_XGIF_52_MASK         4U
#define XGIF_5F_50_XGIF_53_MASK         8U
#define XGIF_5F_50_XGIF_54_MASK         16U
#define XGIF_5F_50_XGIF_55_MASK         32U
#define XGIF_5F_50_XGIF_56_MASK         64U
#define XGIF_5F_50_XGIF_57_MASK         128U
#define XGIF_5F_50_XGIF_58_MASK         256U
#define XGIF_5F_50_XGIF_59_MASK         512U
#define XGIF_5F_50_XGIF_5A_MASK         1024U
#define XGIF_5F_50_XGIF_5B_MASK         2048U
#define XGIF_5F_50_XGIF_5C_MASK         4096U
#define XGIF_5F_50_XGIF_5D_MASK         8192U
#define XGIF_5F_50_XGIF_5E_MASK         16384U
#define XGIF_5F_50_XGIF_5F_MASK         32768U
#define XGIF_5F_50_XGIF__50_MASK        1023U
#define XGIF_5F_50_XGIF__50_BITNUM      0U


/*** XGIF_4F_40 - XGATE Channel Interrupt Flag Vector; 0x0000038E ***/
typedef union {
  word Word;
  struct {
    word XGIF_40     :1;                                       /* Channel Interrupt Flags, bit 64 */
    word XGIF_41     :1;                                       /* Channel Interrupt Flags, bit 65 */
    word XGIF_42     :1;                                       /* Channel Interrupt Flags, bit 66 */
    word XGIF_43     :1;                                       /* Channel Interrupt Flags, bit 67 */
    word XGIF_44     :1;                                       /* Channel Interrupt Flags, bit 68 */
    word XGIF_45     :1;                                       /* Channel Interrupt Flags, bit 69 */
    word XGIF_46     :1;                                       /* Channel Interrupt Flags, bit 70 */
    word XGIF_47     :1;                                       /* Channel Interrupt Flags, bit 71 */
    word XGIF_48     :1;                                       /* Channel Interrupt Flags, bit 72 */
    word XGIF_49     :1;                                       /* Channel Interrupt Flags, bit 73 */
    word XGIF_4A     :1;                                       /* Channel Interrupt Flags, bit 74 */
    word XGIF_4B     :1;                                       /* Channel Interrupt Flags, bit 75 */
    word XGIF_4C     :1;                                       /* Channel Interrupt Flags, bit 76 */
    word XGIF_4D     :1;                                       /* Channel Interrupt Flags, bit 77 */
    word XGIF_4E     :1;                                       /* Channel Interrupt Flags, bit 78 */
    word XGIF_4F     :1;                                       /* Channel Interrupt Flags, bit 79 */
  } Bits;
  struct {
    word grpXGIF__40 :10;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} XGIF_4F_40STR;
extern volatile XGIF_4F_40STR _XGIF_4F_40 @(REG_BASE + 0x0000038EUL);
#define XGIF_4F_40                      _XGIF_4F_40.Word
#define XGIF_4F_40_XGIF_40              _XGIF_4F_40.Bits.XGIF_40
#define XGIF_4F_40_XGIF_41              _XGIF_4F_40.Bits.XGIF_41
#define XGIF_4F_40_XGIF_42              _XGIF_4F_40.Bits.XGIF_42
#define XGIF_4F_40_XGIF_43              _XGIF_4F_40.Bits.XGIF_43
#define XGIF_4F_40_XGIF_44              _XGIF_4F_40.Bits.XGIF_44
#define XGIF_4F_40_XGIF_45              _XGIF_4F_40.Bits.XGIF_45
#define XGIF_4F_40_XGIF_46              _XGIF_4F_40.Bits.XGIF_46
#define XGIF_4F_40_XGIF_47              _XGIF_4F_40.Bits.XGIF_47
#define XGIF_4F_40_XGIF_48              _XGIF_4F_40.Bits.XGIF_48
#define XGIF_4F_40_XGIF_49              _XGIF_4F_40.Bits.XGIF_49
#define XGIF_4F_40_XGIF_4A              _XGIF_4F_40.Bits.XGIF_4A
#define XGIF_4F_40_XGIF_4B              _XGIF_4F_40.Bits.XGIF_4B
#define XGIF_4F_40_XGIF_4C              _XGIF_4F_40.Bits.XGIF_4C
#define XGIF_4F_40_XGIF_4D              _XGIF_4F_40.Bits.XGIF_4D
#define XGIF_4F_40_XGIF_4E              _XGIF_4F_40.Bits.XGIF_4E
#define XGIF_4F_40_XGIF_4F              _XGIF_4F_40.Bits.XGIF_4F
#define XGIF_4F_40_XGIF__40             _XGIF_4F_40.MergedBits.grpXGIF__40
#define XGIF_4F_40_XGIF_                XGIF_4F_40_XGIF__40

#define XGIF_4F_40_XGIF_40_MASK         1U
#define XGIF_4F_40_XGIF_41_MASK         2U
#define XGIF_4F_40_XGIF_42_MASK         4U
#define XGIF_4F_40_XGIF_43_MASK         8U
#define XGIF_4F_40_XGIF_44_MASK         16U
#define XGIF_4F_40_XGIF_45_MASK         32U
#define XGIF_4F_40_XGIF_46_MASK         64U
#define XGIF_4F_40_XGIF_47_MASK         128U
#define XGIF_4F_40_XGIF_48_MASK         256U
#define XGIF_4F_40_XGIF_49_MASK         512U
#define XGIF_4F_40_XGIF_4A_MASK         1024U
#define XGIF_4F_40_XGIF_4B_MASK         2048U
#define XGIF_4F_40_XGIF_4C_MASK         4096U
#define XGIF_4F_40_XGIF_4D_MASK         8192U
#define XGIF_4F_40_XGIF_4E_MASK         16384U
#define XGIF_4F_40_XGIF_4F_MASK         32768U
#define XGIF_4F_40_XGIF__40_MASK        1023U
#define XGIF_4F_40_XGIF__40_BITNUM      0U


/*** XGIF_3F_30 - XGATE Channel Interrupt Flag Vector; 0x00000390 ***/
typedef union {
  word Word;
  struct {
    word XGIF_30     :1;                                       /* Channel Interrupt Flags, bit 48 */
    word XGIF_31     :1;                                       /* Channel Interrupt Flags, bit 49 */
    word XGIF_32     :1;                                       /* Channel Interrupt Flags, bit 50 */
    word XGIF_33     :1;                                       /* Channel Interrupt Flags, bit 51 */
    word XGIF_34     :1;                                       /* Channel Interrupt Flags, bit 52 */
    word XGIF_35     :1;                                       /* Channel Interrupt Flags, bit 53 */
    word XGIF_36     :1;                                       /* Channel Interrupt Flags, bit 54 */
    word XGIF_37     :1;                                       /* Channel Interrupt Flags, bit 55 */
    word XGIF_38     :1;                                       /* Channel Interrupt Flags, bit 56 */
    word XGIF_39     :1;                                       /* Channel Interrupt Flags, bit 57 */
    word XGIF_3A     :1;                                       /* Channel Interrupt Flags, bit 58 */
    word XGIF_3B     :1;                                       /* Channel Interrupt Flags, bit 59 */
    word XGIF_3C     :1;                                       /* Channel Interrupt Flags, bit 60 */
    word XGIF_3D     :1;                                       /* Channel Interrupt Flags, bit 61 */
    word XGIF_3E     :1;                                       /* Channel Interrupt Flags, bit 62 */
    word XGIF_3F     :1;                                       /* Channel Interrupt Flags, bit 63 */
  } Bits;
  struct {
    word grpXGIF__30 :10;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} XGIF_3F_30STR;
