frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
/*** XGSWT - XGATE Control Register; 0x00000398 ***/
typedef union {
  word Word;
  struct {
    word XGSWT_grp   :8;                                       /* Software Trigger Bits */ /*Warning: group name is duplicated with register name*/
    word XGSWTM      :8;                                       /* Software Trigger Mask */
  } Bits;
} XGSWTSTR;
extern volatile XGSWTSTR _XGSWT @(REG_BASE + 0x00000398UL);
#define XGSWT                           _XGSWT.Word
#define XGSWT_XGSWT                     _XGSWT.Bits.XGSWT_grp
#define XGSWT_XGSWTM                    _XGSWT.Bits.XGSWTM

#define XGSWT_XGSWT_MASK                255U
#define XGSWT_XGSWT_BITNUM              0U
#define XGSWT_XGSWTM_MASK               65280U
#define XGSWT_XGSWTM_BITNUM             8U


/*** XGSEM - XGATE Semaphore Register; 0x0000039A ***/
typedef union {
  word Word;
  struct {
    word XGSEM_grp   :8;                                       /* Semaphore Bits */ /*Warning: group name is duplicated with register name*/
    word XGSEMM      :8;                                       /* Semaphore Mask */
  } Bits;
} XGSEMSTR;
extern volatile XGSEMSTR _XGSEM @(REG_BASE + 0x0000039AUL);
#define XGSEM                           _XGSEM.Word
#define XGSEM_XGSEM                     _XGSEM.Bits.XGSEM_grp
#define XGSEM_XGSEMM                    _XGSEM.Bits.XGSEMM

#define XGSEM_XGSEM_MASK                255U
#define XGSEM_XGSEM_BITNUM              0U
#define XGSEM_XGSEMM_MASK               65280U
#define XGSEM_XGSEMM_BITNUM             8U


/*** XGCCR - XGATE Condition Code Register; 0x0000039D ***/
typedef union {
  byte Byte;
  struct {
    byte XGC         :1;                                       /* Carry Flag */
    byte XGV         :1;                                       /* Overflow Flag */
    byte XGZ         :1;                                       /* Zero Flag */
    byte XGN         :1;                                       /* Sign Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} XGCCRSTR;
extern volatile XGCCRSTR _XGCCR @(REG_BASE + 0x0000039DUL);
#define XGCCR                           _XGCCR.Byte
#define XGCCR_XGC                       _XGCCR.Bits.XGC
#define XGCCR_XGV                       _XGCCR.Bits.XGV
#define XGCCR_XGZ                       _XGCCR.Bits.XGZ
#define XGCCR_XGN                       _XGCCR.Bits.XGN

#define XGCCR_XGC_MASK                  1U
#define XGCCR_XGV_MASK                  2U
#define XGCCR_XGZ_MASK                  4U
#define XGCCR_XGN_MASK                  8U


/*** XGPC - XGATE Program Counter Register; 0x0000039E ***/
typedef union {
  word Word;
} XGPCSTR;
extern volatile XGPCSTR _XGPC @(REG_BASE + 0x0000039EUL);
#define XGPC                            _XGPC.Word


/*** XGR1 - XGATE Register 1; 0x000003A2 ***/
typedef union {
  word Word;
} XGR1STR;
extern volatile XGR1STR _XGR1 @(REG_BASE + 0x000003A2UL);
#define XGR1                            _XGR1.Word


/*** XGR2 - XGATE Register 2; 0x000003A4 ***/
typedef union {
  word Word;
} XGR2STR;
extern volatile XGR2STR _XGR2 @(REG_BASE + 0x000003A4UL);
#define XGR2                            _XGR2.Word


/*** XGR3 - XGATE Register 3; 0x000003A6 ***/
typedef union {
  word Word;
} XGR3STR;
extern volatile XGR3STR _XGR3 @(REG_BASE + 0x000003A6UL);
#define XGR3                            _XGR3.Word


/*** XGR4 - XGATE Register 4; 0x000003A8 ***/
typedef union {
  word Word;
} XGR4STR;
extern volatile XGR4STR _XGR4 @(REG_BASE + 0x000003A8UL);
#define XGR4                            _XGR4.Word


/*** XGR5 - XGATE Register 5; 0x000003AA ***/
typedef union {
  word Word;
} XGR5STR;
extern volatile XGR5STR _XGR5 @(REG_BASE + 0x000003AAUL);
#define XGR5                            _XGR5.Word


/*** XGR6 - XGATE Register 6; 0x000003AC ***/
typedef union {
  word Word;
} XGR6STR;
extern volatile XGR6STR _XGR6 @(REG_BASE + 0x000003ACUL);
#define XGR6                            _XGR6.Word


/*** XGR7 - XGATE Register 7; 0x000003AE ***/
typedef union {
  word Word;
} XGR7STR;
extern volatile XGR7STR _XGR7 @(REG_BASE + 0x000003AEUL);
#define XGR7                            _XGR7.Word


/*** TIM_TIOS - Timer Input Capture/Output Compare Select; 0x000003D0 ***/
typedef union {
  byte Byte;
  struct {
    byte IOS0        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 0 */
    byte IOS1        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 1 */
    byte IOS2        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 2 */
    byte IOS3        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 3 */
    byte IOS4        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 4 */
    byte IOS5        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 5 */
    byte IOS6        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 6 */
    byte IOS7        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 7 */
  } Bits;
} TIM_TIOSSTR;
extern volatile TIM_TIOSSTR _TIM_TIOS @(REG_BASE + 0x000003D0UL);
#define TIM_TIOS                        _TIM_TIOS.Byte
#define TIM_TIOS_IOS0                   _TIM_TIOS.Bits.IOS0
#define TIM_TIOS_IOS1                   _TIM_TIOS.Bits.IOS1
#define TIM_TIOS_IOS2                   _TIM_TIOS.Bits.IOS2
#define TIM_TIOS_IOS3                   _TIM_TIOS.Bits.IOS3
#define TIM_TIOS_IOS4                   _TIM_TIOS.Bits.IOS4
#define TIM_TIOS_IOS5                   _TIM_TIOS.Bits.IOS5
#define TIM_TIOS_IOS6                   _TIM_TIOS.Bits.IOS6
#define TIM_TIOS_IOS7                   _TIM_TIOS.Bits.IOS7

#define TIM_TIOS_IOS0_MASK              1U
#define TIM_TIOS_IOS1_MASK              2U
#define TIM_TIOS_IOS2_MASK              4U
#define TIM_TIOS_IOS3_MASK              8U
#define TIM_TIOS_IOS4_MASK              16U
#define TIM_TIOS_IOS5_MASK              32U
#define TIM_TIOS_IOS6_MASK              64U
#define TIM_TIOS_IOS7_MASK              128U


/*** TIM_CFORC - Timer Compare Force Register; 0x000003D1 ***/
typedef union {
  byte Byte;
  struct {
    byte FOC0        :1;                                       /* Force Output Compare Action for Channel 0 */
    byte FOC1        :1;                                       /* Force Output Compare Action for Channel 1 */
    byte FOC2        :1;                                       /* Force Output Compare Action for Channel 2 */
    byte FOC3        :1;                                       /* Force Output Compare Action for Channel 3 */
    byte FOC4        :1;                                       /* Force Output Compare Action for Channel 4 */
    byte FOC5        :1;                                       /* Force Output Compare Action for Channel 5 */
    byte FOC6        :1;                                       /* Force Output Compare Action for Channel 6 */
    byte FOC7        :1;                                       /* Force Output Compare Action for Channel 7 */
  } Bits;
} TIM_CFORCSTR;
extern volatile TIM_CFORCSTR _TIM_CFORC @(REG_BASE + 0x000003D1UL);
#define TIM_CFORC                       _TIM_CFORC.Byte
#define TIM_CFORC_FOC0                  _TIM_CFORC.Bits.FOC0
#define TIM_CFORC_FOC1                  _TIM_CFORC.Bits.FOC1
#define TIM_CFORC_FOC2                  _TIM_CFORC.Bits.FOC2
#define TIM_CFORC_FOC3                  _TIM_CFORC.Bits.FOC3
#define TIM_CFORC_FOC4                  _TIM_CFORC.Bits.FOC4
#define TIM_CFORC_FOC5                  _TIM_CFORC.Bits.FOC5
#define TIM_CFORC_FOC6                  _TIM_CFORC.Bits.FOC6
#define TIM_CFORC_FOC7                  _TIM_CFORC.Bits.FOC7

#define TIM_CFORC_FOC0_MASK             1U
#define TIM_CFORC_FOC1_MASK             2U
#define TIM_CFORC_FOC2_MASK             4U
#define TIM_CFORC_FOC3_MASK             8U
#define TIM_CFORC_FOC4_MASK             16U
#define TIM_CFORC_FOC5_MASK             32U
#define TIM_CFORC_FOC6_MASK             64U
#define TIM_CFORC_FOC7_MASK             128U


/*** TIM_OC7M - Output Compare 7 Mask Register; 0x000003D2 ***/
typedef union {
  byte Byte;
  struct {
    byte OC7M0       :1;                                       /* Output Compare 7 Mask Bit 0 */
    byte OC7M1       :1;                                       /* Output Compare 7 Mask Bit 1 */
    byte OC7M2       :1;                                       /* Output Compare 7 Mask Bit 2 */
    byte OC7M3       :1;                                       /* Output Compare 7 Mask Bit 3 */
    byte OC7M4       :1;                                       /* Output Compare 7 Mask Bit 4 */
    byte OC7M5       :1;                                       /* Output Compare 7 Mask Bit 5 */
    byte OC7M6       :1;                                       /* Output Compare 7 Mask Bit 6 */
    byte OC7M7       :1;                                       /* Output Compare 7 Mask Bit 7 */
  } Bits;
} TIM_OC7MSTR;
extern volatile TIM_OC7MSTR _TIM_OC7M @(REG_BASE + 0x000003D2UL);
#define TIM_OC7M                        _TIM_OC7M.Byte
#define TIM_OC7M_OC7M0                  _TIM_OC7M.Bits.OC7M0
#define TIM_OC7M_OC7M1                  _TIM_OC7M.Bits.OC7M1
#define TIM_OC7M_OC7M2                  _TIM_OC7M.Bits.OC7M2
#define TIM_OC7M_OC7M3                  _TIM_OC7M.Bits.OC7M3
#define TIM_OC7M_OC7M4                  _TIM_OC7M.Bits.OC7M4
#define TIM_OC7M_OC7M5                  _TIM_OC7M.Bits.OC7M5
#define TIM_OC7M_OC7M6                  _TIM_OC7M.Bits.OC7M6
#define TIM_OC7M_OC7M7                  _TIM_OC7M.Bits.OC7M7

#define TIM_OC7M_OC7M0_MASK             1U
#define TIM_OC7M_OC7M1_MASK             2U
#define TIM_OC7M_OC7M2_MASK             4U
#define TIM_OC7M_OC7M3_MASK             8U
#define TIM_OC7M_OC7M4_MASK             16U
#define TIM_OC7M_OC7M5_MASK             32U
#define TIM_OC7M_OC7M6_MASK             64U
#define TIM_OC7M_OC7M7_MASK             128U


/*** TIM_OC7D - Output Compare 7 Data Register; 0x000003D3 ***/
typedef union {
  byte Byte;
  struct {
    byte OC7D0       :1;                                       /* Output Compare 7 Bit 0 */
    byte OC7D1       :1;                                       /* Output Compare 7 Bit 1 */
    byte OC7D2       :1;                                       /* Output Compare 7 Bit 2 */
    byte OC7D3       :1;                                       /* Output Compare 7 Bit 3 */
    byte OC7D4       :1;                                       /* Output Compare 7 Bit 4 */
    byte OC7D5       :1;                                       /* Output Compare 7 Bit 5 */
    byte OC7D6       :1;                                       /* Output Compare 7 Bit 6 */
    byte OC7D7       :1;                                       /* Output Compare 7 Bit 7 */
  } Bits;
} TIM_OC7DSTR;
