frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
extern volatile TIM_OC7DSTR _TIM_OC7D @(REG_BASE + 0x000003D3UL);
#define TIM_OC7D                        _TIM_OC7D.Byte
#define TIM_OC7D_OC7D0                  _TIM_OC7D.Bits.OC7D0
#define TIM_OC7D_OC7D1                  _TIM_OC7D.Bits.OC7D1
#define TIM_OC7D_OC7D2                  _TIM_OC7D.Bits.OC7D2
#define TIM_OC7D_OC7D3                  _TIM_OC7D.Bits.OC7D3
#define TIM_OC7D_OC7D4                  _TIM_OC7D.Bits.OC7D4
#define TIM_OC7D_OC7D5                  _TIM_OC7D.Bits.OC7D5
#define TIM_OC7D_OC7D6                  _TIM_OC7D.Bits.OC7D6
#define TIM_OC7D_OC7D7                  _TIM_OC7D.Bits.OC7D7

#define TIM_OC7D_OC7D0_MASK             1U
#define TIM_OC7D_OC7D1_MASK             2U
#define TIM_OC7D_OC7D2_MASK             4U
#define TIM_OC7D_OC7D3_MASK             8U
#define TIM_OC7D_OC7D4_MASK             16U
#define TIM_OC7D_OC7D5_MASK             32U
#define TIM_OC7D_OC7D6_MASK             64U
#define TIM_OC7D_OC7D7_MASK             128U


/*** TIM_TCNT - Timer Count Register; 0x000003D4 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM_TCNTHi - Timer Count Register High; 0x000003D4 ***/
    union {
      byte Byte;
    } TIM_TCNTHiSTR;
    #define TIM_TCNTHi                  _TIM_TCNT.Overlap_STR.TIM_TCNTHiSTR.Byte
    

    /*** TIM_TCNTLo - Timer Count Register Low; 0x000003D5 ***/
    union {
      byte Byte;
    } TIM_TCNTLoSTR;
    #define TIM_TCNTLo                  _TIM_TCNT.Overlap_STR.TIM_TCNTLoSTR.Byte
    
  } Overlap_STR;

} TIM_TCNTSTR;
extern volatile TIM_TCNTSTR _TIM_TCNT @(REG_BASE + 0x000003D4UL);
#define TIM_TCNT                        _TIM_TCNT.Word


/*** TIM_TSCR1 - Timer System Control Register1; 0x000003D6 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PRNT        :1;                                       /* Precision Timer */
    byte TFFCA       :1;                                       /* Timer Fast Flag Clear All */
    byte TSFRZ       :1;                                       /* Timer and Modulus Counter Stop While in Freeze Mode */
    byte TSWAI       :1;                                       /* Timer Module Stops While in Wait */
    byte TEN         :1;                                       /* Timer Enable */
  } Bits;
} TIM_TSCR1STR;
extern volatile TIM_TSCR1STR _TIM_TSCR1 @(REG_BASE + 0x000003D6UL);
#define TIM_TSCR1                       _TIM_TSCR1.Byte
#define TIM_TSCR1_PRNT                  _TIM_TSCR1.Bits.PRNT
#define TIM_TSCR1_TFFCA                 _TIM_TSCR1.Bits.TFFCA
#define TIM_TSCR1_TSFRZ                 _TIM_TSCR1.Bits.TSFRZ
#define TIM_TSCR1_TSWAI                 _TIM_TSCR1.Bits.TSWAI
#define TIM_TSCR1_TEN                   _TIM_TSCR1.Bits.TEN

#define TIM_TSCR1_PRNT_MASK             8U
#define TIM_TSCR1_TFFCA_MASK            16U
#define TIM_TSCR1_TSFRZ_MASK            32U
#define TIM_TSCR1_TSWAI_MASK            64U
#define TIM_TSCR1_TEN_MASK              128U


/*** TIM_TTOV - Timer Toggle On Overflow Register; 0x000003D7 ***/
typedef union {
  byte Byte;
  struct {
    byte TOV0        :1;                                       /* Toggle On Overflow Bit 0 */
    byte TOV1        :1;                                       /* Toggle On Overflow Bit 1 */
    byte TOV2        :1;                                       /* Toggle On Overflow Bit 2 */
    byte TOV3        :1;                                       /* Toggle On Overflow Bit 3 */
    byte TOV4        :1;                                       /* Toggle On Overflow Bit 4 */
    byte TOV5        :1;                                       /* Toggle On Overflow Bit 5 */
    byte TOV6        :1;                                       /* Toggle On Overflow Bit 6 */
    byte TOV7        :1;                                       /* Toggle On Overflow Bit 7 */
  } Bits;
} TIM_TTOVSTR;
extern volatile TIM_TTOVSTR _TIM_TTOV @(REG_BASE + 0x000003D7UL);
#define TIM_TTOV                        _TIM_TTOV.Byte
#define TIM_TTOV_TOV0                   _TIM_TTOV.Bits.TOV0
#define TIM_TTOV_TOV1                   _TIM_TTOV.Bits.TOV1
#define TIM_TTOV_TOV2                   _TIM_TTOV.Bits.TOV2
#define TIM_TTOV_TOV3                   _TIM_TTOV.Bits.TOV3
#define TIM_TTOV_TOV4                   _TIM_TTOV.Bits.TOV4
#define TIM_TTOV_TOV5                   _TIM_TTOV.Bits.TOV5
#define TIM_TTOV_TOV6                   _TIM_TTOV.Bits.TOV6
#define TIM_TTOV_TOV7                   _TIM_TTOV.Bits.TOV7

#define TIM_TTOV_TOV0_MASK              1U
#define TIM_TTOV_TOV1_MASK              2U
#define TIM_TTOV_TOV2_MASK              4U
#define TIM_TTOV_TOV3_MASK              8U
#define TIM_TTOV_TOV4_MASK              16U
#define TIM_TTOV_TOV5_MASK              32U
#define TIM_TTOV_TOV6_MASK              64U
#define TIM_TTOV_TOV7_MASK              128U


/*** TIM_TCTL1 - Timer Control Register 1; 0x000003D8 ***/
typedef union {
  byte Byte;
  struct {
    byte OL4         :1;                                       /* Output Level Bit 4 */
    byte OM4         :1;                                       /* Output Mode Bit 4 */
    byte OL5         :1;                                       /* Output Level Bit 5 */
    byte OM5         :1;                                       /* Output Mode Bit 5 */
    byte OL6         :1;                                       /* Output Level Bit 6 */
    byte OM6         :1;                                       /* Output Mode Bit 6 */
    byte OL7         :1;                                       /* Output Level Bit 7 */
    byte OM7         :1;                                       /* Output Mode Bit 7 */
  } Bits;
} TIM_TCTL1STR;
extern volatile TIM_TCTL1STR _TIM_TCTL1 @(REG_BASE + 0x000003D8UL);
#define TIM_TCTL1                       _TIM_TCTL1.Byte
#define TIM_TCTL1_OL4                   _TIM_TCTL1.Bits.OL4
#define TIM_TCTL1_OM4                   _TIM_TCTL1.Bits.OM4
#define TIM_TCTL1_OL5                   _TIM_TCTL1.Bits.OL5
#define TIM_TCTL1_OM5                   _TIM_TCTL1.Bits.OM5
#define TIM_TCTL1_OL6                   _TIM_TCTL1.Bits.OL6
#define TIM_TCTL1_OM6                   _TIM_TCTL1.Bits.OM6
#define TIM_TCTL1_OL7                   _TIM_TCTL1.Bits.OL7
#define TIM_TCTL1_OM7                   _TIM_TCTL1.Bits.OM7

#define TIM_TCTL1_OL4_MASK              1U
#define TIM_TCTL1_OM4_MASK              2U
#define TIM_TCTL1_OL5_MASK              4U
#define TIM_TCTL1_OM5_MASK              8U
#define TIM_TCTL1_OL6_MASK              16U
#define TIM_TCTL1_OM6_MASK              32U
#define TIM_TCTL1_OL7_MASK              64U
#define TIM_TCTL1_OM7_MASK              128U


/*** TIM_TCTL2 - Timer Control Register 2; 0x000003D9 ***/
typedef union {
  byte Byte;
  struct {
    byte OL0         :1;                                       /* Output Level Bit 0 */
    byte OM0         :1;                                       /* Output Mode Bit 0 */
    byte OL1         :1;                                       /* Output Lecel Bit 1 */
    byte OM1         :1;                                       /* Output Mode Bit 1 */
    byte OL2         :1;                                       /* Output Level Bit 2 */
    byte OM2         :1;                                       /* Output Mode Bit 2 */
    byte OL3         :1;                                       /* Output Level Bit 3 */
    byte OM3         :1;                                       /* Output Mode Bit 3 */
  } Bits;
} TIM_TCTL2STR;
