frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
extern volatile TIM_TCTL2STR _TIM_TCTL2 @(REG_BASE + 0x000003D9UL);
#define TIM_TCTL2                       _TIM_TCTL2.Byte
#define TIM_TCTL2_OL0                   _TIM_TCTL2.Bits.OL0
#define TIM_TCTL2_OM0                   _TIM_TCTL2.Bits.OM0
#define TIM_TCTL2_OL1                   _TIM_TCTL2.Bits.OL1
#define TIM_TCTL2_OM1                   _TIM_TCTL2.Bits.OM1
#define TIM_TCTL2_OL2                   _TIM_TCTL2.Bits.OL2
#define TIM_TCTL2_OM2                   _TIM_TCTL2.Bits.OM2
#define TIM_TCTL2_OL3                   _TIM_TCTL2.Bits.OL3
#define TIM_TCTL2_OM3                   _TIM_TCTL2.Bits.OM3

#define TIM_TCTL2_OL0_MASK              1U
#define TIM_TCTL2_OM0_MASK              2U
#define TIM_TCTL2_OL1_MASK              4U
#define TIM_TCTL2_OM1_MASK              8U
#define TIM_TCTL2_OL2_MASK              16U
#define TIM_TCTL2_OM2_MASK              32U
#define TIM_TCTL2_OL3_MASK              64U
#define TIM_TCTL2_OM3_MASK              128U


/*** TIM_TCTL3 - Timer Control Register 3; 0x000003DA ***/
typedef union {
  byte Byte;
  struct {
    byte EDG4A       :1;                                       /* Input Capture Edge Control 4A */
    byte EDG4B       :1;                                       /* Input Capture Edge Control 4B */
    byte EDG5A       :1;                                       /* Input Capture Edge Control 5A */
    byte EDG5B       :1;                                       /* Input Capture Edge Control 5B */
    byte EDG6A       :1;                                       /* Input Capture Edge Control 6A */
    byte EDG6B       :1;                                       /* Input Capture Edge Control 6B */
    byte EDG7A       :1;                                       /* Input Capture Edge Control 7A */
    byte EDG7B       :1;                                       /* Input Capture Edge Control 7B */
  } Bits;
  struct {
    byte grpEDG4x :2;
    byte grpEDG5x :2;
    byte grpEDG6x :2;
    byte grpEDG7x :2;
  } MergedBits;
} TIM_TCTL3STR;
extern volatile TIM_TCTL3STR _TIM_TCTL3 @(REG_BASE + 0x000003DAUL);
#define TIM_TCTL3                       _TIM_TCTL3.Byte
#define TIM_TCTL3_EDG4A                 _TIM_TCTL3.Bits.EDG4A
#define TIM_TCTL3_EDG4B                 _TIM_TCTL3.Bits.EDG4B
#define TIM_TCTL3_EDG5A                 _TIM_TCTL3.Bits.EDG5A
#define TIM_TCTL3_EDG5B                 _TIM_TCTL3.Bits.EDG5B
#define TIM_TCTL3_EDG6A                 _TIM_TCTL3.Bits.EDG6A
#define TIM_TCTL3_EDG6B                 _TIM_TCTL3.Bits.EDG6B
#define TIM_TCTL3_EDG7A                 _TIM_TCTL3.Bits.EDG7A
#define TIM_TCTL3_EDG7B                 _TIM_TCTL3.Bits.EDG7B
#define TIM_TCTL3_EDG4x                 _TIM_TCTL3.MergedBits.grpEDG4x
#define TIM_TCTL3_EDG5x                 _TIM_TCTL3.MergedBits.grpEDG5x
#define TIM_TCTL3_EDG6x                 _TIM_TCTL3.MergedBits.grpEDG6x
#define TIM_TCTL3_EDG7x                 _TIM_TCTL3.MergedBits.grpEDG7x

#define TIM_TCTL3_EDG4A_MASK            1U
#define TIM_TCTL3_EDG4B_MASK            2U
#define TIM_TCTL3_EDG5A_MASK            4U
#define TIM_TCTL3_EDG5B_MASK            8U
#define TIM_TCTL3_EDG6A_MASK            16U
#define TIM_TCTL3_EDG6B_MASK            32U
#define TIM_TCTL3_EDG7A_MASK            64U
#define TIM_TCTL3_EDG7B_MASK            128U
#define TIM_TCTL3_EDG4x_MASK            3U
#define TIM_TCTL3_EDG4x_BITNUM          0U
#define TIM_TCTL3_EDG5x_MASK            12U
#define TIM_TCTL3_EDG5x_BITNUM          2U
#define TIM_TCTL3_EDG6x_MASK            48U
#define TIM_TCTL3_EDG6x_BITNUM          4U
#define TIM_TCTL3_EDG7x_MASK            192U
#define TIM_TCTL3_EDG7x_BITNUM          6U


/*** TIM_TCTL4 - Timer Control Register 4; 0x000003DB ***/
typedef union {
  byte Byte;
  struct {
    byte EDG0A       :1;                                       /* Input Capture Edge Control 0A */
    byte EDG0B       :1;                                       /* Input Capture Edge Control 0B */
    byte EDG1A       :1;                                       /* Input Capture Edge Control 1A */
    byte EDG1B       :1;                                       /* Input Capture Edge Control 1B */
    byte EDG2A       :1;                                       /* Input Capture Edge Control 2A */
    byte EDG2B       :1;                                       /* Input Capture Edge Control 2B */
    byte EDG3A       :1;                                       /* Input Capture Edge Control 3A */
    byte EDG3B       :1;                                       /* Input Capture Edge Control 3B */
  } Bits;
  struct {
    byte grpEDG0x :2;
    byte grpEDG1x :2;
    byte grpEDG2x :2;
    byte grpEDG3x :2;
  } MergedBits;
} TIM_TCTL4STR;
extern volatile TIM_TCTL4STR _TIM_TCTL4 @(REG_BASE + 0x000003DBUL);
#define TIM_TCTL4                       _TIM_TCTL4.Byte
#define TIM_TCTL4_EDG0A                 _TIM_TCTL4.Bits.EDG0A
#define TIM_TCTL4_EDG0B                 _TIM_TCTL4.Bits.EDG0B
#define TIM_TCTL4_EDG1A                 _TIM_TCTL4.Bits.EDG1A
#define TIM_TCTL4_EDG1B                 _TIM_TCTL4.Bits.EDG1B
#define TIM_TCTL4_EDG2A                 _TIM_TCTL4.Bits.EDG2A
#define TIM_TCTL4_EDG2B                 _TIM_TCTL4.Bits.EDG2B
#define TIM_TCTL4_EDG3A                 _TIM_TCTL4.Bits.EDG3A
#define TIM_TCTL4_EDG3B                 _TIM_TCTL4.Bits.EDG3B
#define TIM_TCTL4_EDG0x                 _TIM_TCTL4.MergedBits.grpEDG0x
#define TIM_TCTL4_EDG1x                 _TIM_TCTL4.MergedBits.grpEDG1x
#define TIM_TCTL4_EDG2x                 _TIM_TCTL4.MergedBits.grpEDG2x
#define TIM_TCTL4_EDG3x                 _TIM_TCTL4.MergedBits.grpEDG3x

#define TIM_TCTL4_EDG0A_MASK            1U
#define TIM_TCTL4_EDG0B_MASK            2U
#define TIM_TCTL4_EDG1A_MASK            4U
#define TIM_TCTL4_EDG1B_MASK            8U
#define TIM_TCTL4_EDG2A_MASK            16U
#define TIM_TCTL4_EDG2B_MASK            32U
#define TIM_TCTL4_EDG3A_MASK            64U
#define TIM_TCTL4_EDG3B_MASK            128U
#define TIM_TCTL4_EDG0x_MASK            3U
#define TIM_TCTL4_EDG0x_BITNUM          0U
#define TIM_TCTL4_EDG1x_MASK            12U
#define TIM_TCTL4_EDG1x_BITNUM          2U
#define TIM_TCTL4_EDG2x_MASK            48U
#define TIM_TCTL4_EDG2x_BITNUM          4U
#define TIM_TCTL4_EDG3x_MASK            192U
#define TIM_TCTL4_EDG3x_BITNUM          6U


/*** TIM_TIE - Timer Interrupt Enable Register; 0x000003DC ***/
typedef union {
  byte Byte;
  struct {
    byte C0I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 0 */
    byte C1I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 1 */
    byte C2I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 2 */
    byte C3I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 3 */
    byte C4I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 4 */
    byte C5I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 5 */
    byte C6I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 6 */
    byte C7I         :1;                                       /* Input Capture/Output Compare Interrupt Enable Bit 7 */
  } Bits;
} TIM_TIESTR;
extern volatile TIM_TIESTR _TIM_TIE @(REG_BASE + 0x000003DCUL);
#define TIM_TIE                         _TIM_TIE.Byte
#define TIM_TIE_C0I                     _TIM_TIE.Bits.C0I
#define TIM_TIE_C1I                     _TIM_TIE.Bits.C1I
#define TIM_TIE_C2I                     _TIM_TIE.Bits.C2I
#define TIM_TIE_C3I                     _TIM_TIE.Bits.C3I
#define TIM_TIE_C4I                     _TIM_TIE.Bits.C4I
#define TIM_TIE_C5I                     _TIM_TIE.Bits.C5I
#define TIM_TIE_C6I                     _TIM_TIE.Bits.C6I
#define TIM_TIE_C7I                     _TIM_TIE.Bits.C7I

#define TIM_TIE_C0I_MASK                1U
#define TIM_TIE_C1I_MASK                2U
#define TIM_TIE_C2I_MASK                4U
#define TIM_TIE_C3I_MASK                8U
#define TIM_TIE_C4I_MASK                16U
#define TIM_TIE_C5I_MASK                32U
#define TIM_TIE_C6I_MASK                64U
#define TIM_TIE_C7I_MASK                128U


/*** TIM_TSCR2 - Timer System Control Register 2; 0x000003DD ***/
typedef union {
  byte Byte;
  struct {
    byte PR0         :1;                                       /* Timer Prescaler Select Bit 0 */
    byte PR1         :1;                                       /* Timer Prescaler Select Bit 1 */
    byte PR2         :1;                                       /* Timer Prescaler Select Bit 2 */
    byte TCRE        :1;                                       /* Timer Counter Reset Enable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte TOI         :1;                                       /* Timer Overflow Interrupt Enable */
  } Bits;
  struct {
    byte grpPR   :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} TIM_TSCR2STR;
extern volatile TIM_TSCR2STR _TIM_TSCR2 @(REG_BASE + 0x000003DDUL);
#define TIM_TSCR2                       _TIM_TSCR2.Byte
#define TIM_TSCR2_PR0                   _TIM_TSCR2.Bits.PR0
#define TIM_TSCR2_PR1                   _TIM_TSCR2.Bits.PR1
#define TIM_TSCR2_PR2                   _TIM_TSCR2.Bits.PR2
#define TIM_TSCR2_TCRE                  _TIM_TSCR2.Bits.TCRE
#define TIM_TSCR2_TOI                   _TIM_TSCR2.Bits.TOI
#define TIM_TSCR2_PR                    _TIM_TSCR2.MergedBits.grpPR

#define TIM_TSCR2_PR0_MASK              1U
#define TIM_TSCR2_PR1_MASK              2U
#define TIM_TSCR2_PR2_MASK              4U
#define TIM_TSCR2_TCRE_MASK             8U
#define TIM_TSCR2_TOI_MASK              128U
#define TIM_TSCR2_PR_MASK               7U
#define TIM_TSCR2_PR_BITNUM             0U


