frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
/*** TIM_TFLG1 - Main Timer Interrupt Flag 1; 0x000003DE ***/
typedef union {
  byte Byte;
  struct {
    byte C0F         :1;                                       /* Input Capture/Output Compare Channel Flag 0 */
    byte C1F         :1;                                       /* Input Capture/Output Compare Channel Flag 1 */
    byte C2F         :1;                                       /* Input Capture/Output Compare Channel Flag 2 */
    byte C3F         :1;                                       /* Input Capture/Output Compare Channel Flag 3 */
    byte C4F         :1;                                       /* Input Capture/Output Compare Channel Flag 4 */
    byte C5F         :1;                                       /* Input Capture/Output Compare Channel Flag 5 */
    byte C6F         :1;                                       /* Input Capture/Output Compare Channel Flag 6 */
    byte C7F         :1;                                       /* Input Capture/Output Compare Channel Flag 7 */
  } Bits;
} TIM_TFLG1STR;
extern volatile TIM_TFLG1STR _TIM_TFLG1 @(REG_BASE + 0x000003DEUL);
#define TIM_TFLG1                       _TIM_TFLG1.Byte
#define TIM_TFLG1_C0F                   _TIM_TFLG1.Bits.C0F
#define TIM_TFLG1_C1F                   _TIM_TFLG1.Bits.C1F
#define TIM_TFLG1_C2F                   _TIM_TFLG1.Bits.C2F
#define TIM_TFLG1_C3F                   _TIM_TFLG1.Bits.C3F
#define TIM_TFLG1_C4F                   _TIM_TFLG1.Bits.C4F
#define TIM_TFLG1_C5F                   _TIM_TFLG1.Bits.C5F
#define TIM_TFLG1_C6F                   _TIM_TFLG1.Bits.C6F
#define TIM_TFLG1_C7F                   _TIM_TFLG1.Bits.C7F

#define TIM_TFLG1_C0F_MASK              1U
#define TIM_TFLG1_C1F_MASK              2U
#define TIM_TFLG1_C2F_MASK              4U
#define TIM_TFLG1_C3F_MASK              8U
#define TIM_TFLG1_C4F_MASK              16U
#define TIM_TFLG1_C5F_MASK              32U
#define TIM_TFLG1_C6F_MASK              64U
#define TIM_TFLG1_C7F_MASK              128U


/*** TIM_TFLG2 - Main Timer Interrupt Flag 2; 0x000003DF ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte TOF         :1;                                       /* Timer Overflow Flag */
  } Bits;
} TIM_TFLG2STR;
extern volatile TIM_TFLG2STR _TIM_TFLG2 @(REG_BASE + 0x000003DFUL);
#define TIM_TFLG2                       _TIM_TFLG2.Byte
#define TIM_TFLG2_TOF                   _TIM_TFLG2.Bits.TOF

#define TIM_TFLG2_TOF_MASK              128U


/*** TIM_TC0 - Timer Input Capture/Output Compare Register 0; 0x000003E0 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM_TC0Hi - Timer Input Capture/Output Compare Register 0 High; 0x000003E0 ***/
    union {
      byte Byte;
    } TIM_TC0HiSTR;
    #define TIM_TC0Hi                   _TIM_TC0.Overlap_STR.TIM_TC0HiSTR.Byte
    

    /*** TIM_TC0Lo - Timer Input Capture/Output Compare Register 0 Low; 0x000003E1 ***/
    union {
      byte Byte;
    } TIM_TC0LoSTR;
    #define TIM_TC0Lo                   _TIM_TC0.Overlap_STR.TIM_TC0LoSTR.Byte
    
  } Overlap_STR;

} TIM_TC0STR;
extern volatile TIM_TC0STR _TIM_TC0 @(REG_BASE + 0x000003E0UL);
#define TIM_TC0                         _TIM_TC0.Word
/* TIM_TC_ARR: Access 8 TIM_TCx registers in an array */
#define TIM_TC_ARR                      ((volatile word *) &TIM_TC0)


/*** TIM_TC1 - Timer Input Capture/Output Compare Register 1; 0x000003E2 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM_TC1Hi - Timer Input Capture/Output Compare Register 1 High; 0x000003E2 ***/
    union {
      byte Byte;
    } TIM_TC1HiSTR;
    #define TIM_TC1Hi                   _TIM_TC1.Overlap_STR.TIM_TC1HiSTR.Byte
    

    /*** TIM_TC1Lo - Timer Input Capture/Output Compare Register 1 Low; 0x000003E3 ***/
    union {
      byte Byte;
    } TIM_TC1LoSTR;
    #define TIM_TC1Lo                   _TIM_TC1.Overlap_STR.TIM_TC1LoSTR.Byte
    
  } Overlap_STR;

} TIM_TC1STR;
extern volatile TIM_TC1STR _TIM_TC1 @(REG_BASE + 0x000003E2UL);
#define TIM_TC1                         _TIM_TC1.Word


/*** TIM_TC2 - Timer Input Capture/Output Compare Register 2; 0x000003E4 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM_TC2Hi - Timer Input Capture/Output Compare Register 2 High; 0x000003E4 ***/
    union {
      byte Byte;
    } TIM_TC2HiSTR;
    #define TIM_TC2Hi                   _TIM_TC2.Overlap_STR.TIM_TC2HiSTR.Byte
    

    /*** TIM_TC2Lo - Timer Input Capture/Output Compare Register 2 Low; 0x000003E5 ***/
    union {
      byte Byte;
    } TIM_TC2LoSTR;
    #define TIM_TC2Lo                   _TIM_TC2.Overlap_STR.TIM_TC2LoSTR.Byte
    
  } Overlap_STR;

} TIM_TC2STR;
extern volatile TIM_TC2STR _TIM_TC2 @(REG_BASE + 0x000003E4UL);
#define TIM_TC2                         _TIM_TC2.Word


/*** TIM_TC3 - Timer Input Capture/Output Compare Register 3; 0x000003E6 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM_TC3Hi - Timer Input Capture/Output Compare Register 3 High; 0x000003E6 ***/
    union {
      byte Byte;
    } TIM_TC3HiSTR;
    #define TIM_TC3Hi                   _TIM_TC3.Overlap_STR.TIM_TC3HiSTR.Byte
    

    /*** TIM_TC3Lo - Timer Input Capture/Output Compare Register 3 Low; 0x000003E7 ***/
    union {
      byte Byte;
    } TIM_TC3LoSTR;
    #define TIM_TC3Lo                   _TIM_TC3.Overlap_STR.TIM_TC3LoSTR.Byte
    
  } Overlap_STR;

} TIM_TC3STR;
extern volatile TIM_TC3STR _TIM_TC3 @(REG_BASE + 0x000003E6UL);
#define TIM_TC3                         _TIM_TC3.Word


/*** TIM_TC4 - Timer Input Capture/Output Compare Register 4; 0x000003E8 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM_TC4Hi - Timer Input Capture/Output Compare Register 4 High; 0x000003E8 ***/
    union {
      byte Byte;
    } TIM_TC4HiSTR;
    #define TIM_TC4Hi                   _TIM_TC4.Overlap_STR.TIM_TC4HiSTR.Byte
    

    /*** TIM_TC4Lo - Timer Input Capture/Output Compare Register 4 Low; 0x000003E9 ***/
    union {
      byte Byte;
    } TIM_TC4LoSTR;
    #define TIM_TC4Lo                   _TIM_TC4.Overlap_STR.TIM_TC4LoSTR.Byte
    
  } Overlap_STR;

