frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
#define ECT_TC1Hlo_BIT2                  ECT_TC1Hlo_TC2
#define ECT_TC1Hlo_BIT3                  ECT_TC1Hlo_TC3
#define ECT_TC1Hlo_BIT4                  ECT_TC1Hlo_TC4
#define ECT_TC1Hlo_BIT5                  ECT_TC1Hlo_TC5
#define ECT_TC1Hlo_BIT6                  ECT_TC1Hlo_TC6
#define ECT_TC1Hlo_BIT7                  ECT_TC1Hlo_TC7
#define ECT_TC1Hlo_BIT0_MASK             ECT_TC1Hlo_TC0_MASK
#define ECT_TC1Hlo_BIT1_MASK             ECT_TC1Hlo_TC1_MASK
#define ECT_TC1Hlo_BIT2_MASK             ECT_TC1Hlo_TC2_MASK
#define ECT_TC1Hlo_BIT3_MASK             ECT_TC1Hlo_TC3_MASK
#define ECT_TC1Hlo_BIT4_MASK             ECT_TC1Hlo_TC4_MASK
#define ECT_TC1Hlo_BIT5_MASK             ECT_TC1Hlo_TC5_MASK
#define ECT_TC1Hlo_BIT6_MASK             ECT_TC1Hlo_TC6_MASK
#define ECT_TC1Hlo_BIT7_MASK             ECT_TC1Hlo_TC7_MASK
#define ECT_TC1H_BIT0                    ECT_TC1H_TC0
#define ECT_TC1H_BIT1                    ECT_TC1H_TC1
#define ECT_TC1H_BIT2                    ECT_TC1H_TC2
#define ECT_TC1H_BIT3                    ECT_TC1H_TC3
#define ECT_TC1H_BIT4                    ECT_TC1H_TC4
#define ECT_TC1H_BIT5                    ECT_TC1H_TC5
#define ECT_TC1H_BIT6                    ECT_TC1H_TC6
#define ECT_TC1H_BIT7                    ECT_TC1H_TC7
#define ECT_TC1H_BIT8                    ECT_TC1H_TC8
#define ECT_TC1H_BIT9                    ECT_TC1H_TC9
#define ECT_TC1H_BIT10                   ECT_TC1H_TC10
#define ECT_TC1H_BIT11                   ECT_TC1H_TC11
#define ECT_TC1H_BIT12                   ECT_TC1H_TC12
#define ECT_TC1H_BIT13                   ECT_TC1H_TC13
#define ECT_TC1H_BIT14                   ECT_TC1H_TC14
#define ECT_TC1H_BIT15                   ECT_TC1H_TC15
#define ECT_TC1H_BIT0_MASK               ECT_TC1H_TC0_MASK
#define ECT_TC1H_BIT1_MASK               ECT_TC1H_TC1_MASK
#define ECT_TC1H_BIT2_MASK               ECT_TC1H_TC2_MASK
#define ECT_TC1H_BIT3_MASK               ECT_TC1H_TC3_MASK
#define ECT_TC1H_BIT4_MASK               ECT_TC1H_TC4_MASK
#define ECT_TC1H_BIT5_MASK               ECT_TC1H_TC5_MASK
#define ECT_TC1H_BIT6_MASK               ECT_TC1H_TC6_MASK
#define ECT_TC1H_BIT7_MASK               ECT_TC1H_TC7_MASK
#define ECT_TC1H_BIT8_MASK               ECT_TC1H_TC8_MASK
#define ECT_TC1H_BIT9_MASK               ECT_TC1H_TC9_MASK
#define ECT_TC1H_BIT10_MASK              ECT_TC1H_TC10_MASK
#define ECT_TC1H_BIT11_MASK              ECT_TC1H_TC11_MASK
#define ECT_TC1H_BIT12_MASK              ECT_TC1H_TC12_MASK
#define ECT_TC1H_BIT13_MASK              ECT_TC1H_TC13_MASK
#define ECT_TC1H_BIT14_MASK              ECT_TC1H_TC14_MASK
#define ECT_TC1H_BIT15_MASK              ECT_TC1H_TC15_MASK
#define ECT_TC2Hhi_BIT8                  ECT_TC2Hhi_TC8
#define ECT_TC2Hhi_BIT9                  ECT_TC2Hhi_TC9
#define ECT_TC2Hhi_BIT10                 ECT_TC2Hhi_TC10
#define ECT_TC2Hhi_BIT11                 ECT_TC2Hhi_TC11
#define ECT_TC2Hhi_BIT12                 ECT_TC2Hhi_TC12
#define ECT_TC2Hhi_BIT13                 ECT_TC2Hhi_TC13
#define ECT_TC2Hhi_BIT14                 ECT_TC2Hhi_TC14
#define ECT_TC2Hhi_BIT15                 ECT_TC2Hhi_TC15
#define ECT_TC2Hhi_BIT8_MASK             ECT_TC2Hhi_TC8_MASK
#define ECT_TC2Hhi_BIT9_MASK             ECT_TC2Hhi_TC9_MASK
#define ECT_TC2Hhi_BIT10_MASK            ECT_TC2Hhi_TC10_MASK
#define ECT_TC2Hhi_BIT11_MASK            ECT_TC2Hhi_TC11_MASK
#define ECT_TC2Hhi_BIT12_MASK            ECT_TC2Hhi_TC12_MASK
#define ECT_TC2Hhi_BIT13_MASK            ECT_TC2Hhi_TC13_MASK
#define ECT_TC2Hhi_BIT14_MASK            ECT_TC2Hhi_TC14_MASK
#define ECT_TC2Hhi_BIT15_MASK            ECT_TC2Hhi_TC15_MASK
#define ECT_TC2Hlo_BIT0                  ECT_TC2Hlo_TC0
#define ECT_TC2Hlo_BIT1                  ECT_TC2Hlo_TC1
#define ECT_TC2Hlo_BIT2                  ECT_TC2Hlo_TC2
#define ECT_TC2Hlo_BIT3                  ECT_TC2Hlo_TC3
#define ECT_TC2Hlo_BIT4                  ECT_TC2Hlo_TC4
#define ECT_TC2Hlo_BIT5                  ECT_TC2Hlo_TC5
#define ECT_TC2Hlo_BIT6                  ECT_TC2Hlo_TC6
#define ECT_TC2Hlo_BIT7                  ECT_TC2Hlo_TC7
#define ECT_TC2Hlo_BIT0_MASK             ECT_TC2Hlo_TC0_MASK
#define ECT_TC2Hlo_BIT1_MASK             ECT_TC2Hlo_TC1_MASK
#define ECT_TC2Hlo_BIT2_MASK             ECT_TC2Hlo_TC2_MASK
#define ECT_TC2Hlo_BIT3_MASK             ECT_TC2Hlo_TC3_MASK
#define ECT_TC2Hlo_BIT4_MASK             ECT_TC2Hlo_TC4_MASK
#define ECT_TC2Hlo_BIT5_MASK             ECT_TC2Hlo_TC5_MASK
#define ECT_TC2Hlo_BIT6_MASK             ECT_TC2Hlo_TC6_MASK
#define ECT_TC2Hlo_BIT7_MASK             ECT_TC2Hlo_TC7_MASK
#define ECT_TC2H_BIT0                    ECT_TC2H_TC0
#define ECT_TC2H_BIT1                    ECT_TC2H_TC1
#define ECT_TC2H_BIT2                    ECT_TC2H_TC2
#define ECT_TC2H_BIT3                    ECT_TC2H_TC3
#define ECT_TC2H_BIT4                    ECT_TC2H_TC4
#define ECT_TC2H_BIT5                    ECT_TC2H_TC5
#define ECT_TC2H_BIT6                    ECT_TC2H_TC6
#define ECT_TC2H_BIT7                    ECT_TC2H_TC7
#define ECT_TC2H_BIT8                    ECT_TC2H_TC8
#define ECT_TC2H_BIT9                    ECT_TC2H_TC9
#define ECT_TC2H_BIT10                   ECT_TC2H_TC10
#define ECT_TC2H_BIT11                   ECT_TC2H_TC11
#define ECT_TC2H_BIT12                   ECT_TC2H_TC12
#define ECT_TC2H_BIT13                   ECT_TC2H_TC13
#define ECT_TC2H_BIT14                   ECT_TC2H_TC14
#define ECT_TC2H_BIT15                   ECT_TC2H_TC15
#define ECT_TC2H_BIT0_MASK               ECT_TC2H_TC0_MASK
#define ECT_TC2H_BIT1_MASK               ECT_TC2H_TC1_MASK
#define ECT_TC2H_BIT2_MASK               ECT_TC2H_TC2_MASK
#define ECT_TC2H_BIT3_MASK               ECT_TC2H_TC3_MASK
#define ECT_TC2H_BIT4_MASK               ECT_TC2H_TC4_MASK
#define ECT_TC2H_BIT5_MASK               ECT_TC2H_TC5_MASK
#define ECT_TC2H_BIT6_MASK               ECT_TC2H_TC6_MASK
#define ECT_TC2H_BIT7_MASK               ECT_TC2H_TC7_MASK
#define ECT_TC2H_BIT8_MASK               ECT_TC2H_TC8_MASK
#define ECT_TC2H_BIT9_MASK               ECT_TC2H_TC9_MASK
#define ECT_TC2H_BIT10_MASK              ECT_TC2H_TC10_MASK
#define ECT_TC2H_BIT11_MASK              ECT_TC2H_TC11_MASK
#define ECT_TC2H_BIT12_MASK              ECT_TC2H_TC12_MASK
#define ECT_TC2H_BIT13_MASK              ECT_TC2H_TC13_MASK
#define ECT_TC2H_BIT14_MASK              ECT_TC2H_TC14_MASK
#define ECT_TC2H_BIT15_MASK              ECT_TC2H_TC15_MASK
#define ECT_TC3Hhi_BIT8                  ECT_TC3Hhi_TC8
#define ECT_TC3Hhi_BIT9                  ECT_TC3Hhi_TC9
#define ECT_TC3Hhi_BIT10                 ECT_TC3Hhi_TC10
#define ECT_TC3Hhi_BIT11                 ECT_TC3Hhi_TC11
#define ECT_TC3Hhi_BIT12                 ECT_TC3Hhi_TC12
#define ECT_TC3Hhi_BIT13                 ECT_TC3Hhi_TC13
#define ECT_TC3Hhi_BIT14                 ECT_TC3Hhi_TC14
#define ECT_TC3Hhi_BIT15                 ECT_TC3Hhi_TC15
#define ECT_TC3Hhi_BIT8_MASK             ECT_TC3Hhi_TC8_MASK
#define ECT_TC3Hhi_BIT9_MASK             ECT_TC3Hhi_TC9_MASK
#define ECT_TC3Hhi_BIT10_MASK            ECT_TC3Hhi_TC10_MASK
#define ECT_TC3Hhi_BIT11_MASK            ECT_TC3Hhi_TC11_MASK
#define ECT_TC3Hhi_BIT12_MASK            ECT_TC3Hhi_TC12_MASK
#define ECT_TC3Hhi_BIT13_MASK            ECT_TC3Hhi_TC13_MASK
#define ECT_TC3Hhi_BIT14_MASK            ECT_TC3Hhi_TC14_MASK
#define ECT_TC3Hhi_BIT15_MASK            ECT_TC3Hhi_TC15_MASK
#define ECT_TC3Hlo_BIT0                  ECT_TC3Hlo_TC0
#define ECT_TC3Hlo_BIT1                  ECT_TC3Hlo_TC1
#define ECT_TC3Hlo_BIT2                  ECT_TC3Hlo_TC2
#define ECT_TC3Hlo_BIT3                  ECT_TC3Hlo_TC3
#define ECT_TC3Hlo_BIT4                  ECT_TC3Hlo_TC4
#define ECT_TC3Hlo_BIT5                  ECT_TC3Hlo_TC5
#define ECT_TC3Hlo_BIT6                  ECT_TC3Hlo_TC6
#define ECT_TC3Hlo_BIT7                  ECT_TC3Hlo_TC7
#define ECT_TC3Hlo_BIT0_MASK             ECT_TC3Hlo_TC0_MASK
#define ECT_TC3Hlo_BIT1_MASK             ECT_TC3Hlo_TC1_MASK
#define ECT_TC3Hlo_BIT2_MASK             ECT_TC3Hlo_TC2_MASK
#define ECT_TC3Hlo_BIT3_MASK             ECT_TC3Hlo_TC3_MASK
#define ECT_TC3Hlo_BIT4_MASK             ECT_TC3Hlo_TC4_MASK
#define ECT_TC3Hlo_BIT5_MASK             ECT_TC3Hlo_TC5_MASK
#define ECT_TC3Hlo_BIT6_MASK             ECT_TC3Hlo_TC6_MASK
#define ECT_TC3Hlo_BIT7_MASK             ECT_TC3Hlo_TC7_MASK
#define ECT_TC3H_BIT0                    ECT_TC3H_TC0
#define ECT_TC3H_BIT1                    ECT_TC3H_TC1
#define ECT_TC3H_BIT2                    ECT_TC3H_TC2
#define ECT_TC3H_BIT3                    ECT_TC3H_TC3
#define ECT_TC3H_BIT4                    ECT_TC3H_TC4
#define ECT_TC3H_BIT5                    ECT_TC3H_TC5
#define ECT_TC3H_BIT6                    ECT_TC3H_TC6
#define ECT_TC3H_BIT7                    ECT_TC3H_TC7
#define ECT_TC3H_BIT8                    ECT_TC3H_TC8
#define ECT_TC3H_BIT9                    ECT_TC3H_TC9
#define ECT_TC3H_BIT10                   ECT_TC3H_TC10
#define ECT_TC3H_BIT11                   ECT_TC3H_TC11
#define ECT_TC3H_BIT12                   ECT_TC3H_TC12
#define ECT_TC3H_BIT13                   ECT_TC3H_TC13
#define ECT_TC3H_BIT14                   ECT_TC3H_TC14
#define ECT_TC3H_BIT15                   ECT_TC3H_TC15
#define ECT_TC3H_BIT0_MASK               ECT_TC3H_TC0_MASK
#define ECT_TC3H_BIT1_MASK               ECT_TC3H_TC1_MASK
#define ECT_TC3H_BIT2_MASK               ECT_TC3H_TC2_MASK
#define ECT_TC3H_BIT3_MASK               ECT_TC3H_TC3_MASK
#define ECT_TC3H_BIT4_MASK               ECT_TC3H_TC4_MASK
#define ECT_TC3H_BIT5_MASK               ECT_TC3H_TC5_MASK
#define ECT_TC3H_BIT6_MASK               ECT_TC3H_TC6_MASK
#define ECT_TC3H_BIT7_MASK               ECT_TC3H_TC7_MASK
#define ECT_TC3H_BIT8_MASK               ECT_TC3H_TC8_MASK
#define ECT_TC3H_BIT9_MASK               ECT_TC3H_TC9_MASK
#define ECT_TC3H_BIT10_MASK              ECT_TC3H_TC10_MASK
#define ECT_TC3H_BIT11_MASK              ECT_TC3H_TC11_MASK
#define ECT_TC3H_BIT12_MASK              ECT_TC3H_TC12_MASK
#define ECT_TC3H_BIT13_MASK              ECT_TC3H_TC13_MASK
#define ECT_TC3H_BIT14_MASK              ECT_TC3H_TC14_MASK
#define ECT_TC3H_BIT15_MASK              ECT_TC3H_TC15_MASK
#define ATD1CTL2_ASCIF                   ATD1CTL2_ACMPIE
#define ATD1CTL2_ASCIF_MASK              ATD1CTL2_ACMPIE_MASK
#define ATD1CTL23_ASCIF                  ATD1CTL23_ACMPIE
#define ATD1CTL23_ASCIF_MASK             ATD1CTL23_ACMPIE_MASK
#define FCLKDIV_PRDIV8                   FCLKDIV_FDIV6
#define FCLKDIV_PRDIV8_MASK              FCLKDIV_FDIV6_MASK
#define PT0AD0_PT0AD08                   PT0AD0_PT0AD00
#define PT0AD0_PT0AD9                    PT0AD0_PT0AD01
#define PT0AD0_PT0AD10                   PT0AD0_PT0AD02
#define PT0AD0_PT0AD11                   PT0AD0_PT0AD03
#define PT0AD0_PT0AD12                   PT0AD0_PT0AD04
#define PT0AD0_PT0AD13                   PT0AD0_PT0AD05
#define PT0AD0_PT0AD14                   PT0AD0_PT0AD06
#define PT0AD0_PT0AD15                   PT0AD0_PT0AD07
#define PT0AD0_PT0AD_9                   This_symb_has_been_depreciated
#define PT0AD0_PT0AD                     This_symb_has_been_depreciated
#define PT0AD0_PT0AD08_MASK              PT0AD0_PT0AD00_MASK
#define PT0AD0_PT0AD9_MASK               PT0AD0_PT0AD01_MASK
#define PT0AD0_PT0AD10_MASK              PT0AD0_PT0AD02_MASK
#define PT0AD0_PT0AD11_MASK              PT0AD0_PT0AD03_MASK
#define PT0AD0_PT0AD12_MASK              PT0AD0_PT0AD04_MASK
#define PT0AD0_PT0AD13_MASK              PT0AD0_PT0AD05_MASK
#define PT0AD0_PT0AD14_MASK              PT0AD0_PT0AD06_MASK
#define PT0AD0_PT0AD15_MASK              PT0AD0_PT0AD07_MASK
#define PT0AD0_PT0AD_9_MASK              This_symb_has_been_depreciated
#define PT0AD0_PT0AD_9_BITNUM            This_symb_has_been_depreciated
#define DDR0AD0_DDR0AD08                 DDR0AD0_DDR0AD00
#define DDR0AD0_DDR0AD9                  DDR0AD0_DDR0AD01
#define DDR0AD0_DDR0AD10                 DDR0AD0_DDR0AD02
#define DDR0AD0_DDR0AD11                 DDR0AD0_DDR0AD03
#define DDR0AD0_DDR0AD12                 DDR0AD0_DDR0AD04
#define DDR0AD0_DDR0AD13                 DDR0AD0_DDR0AD05
#define DDR0AD0_DDR0AD14                 DDR0AD0_DDR0AD06
#define DDR0AD0_DDR0AD15                 DDR0AD0_DDR0AD07
#define DDR0AD0_DDR0AD_9                 This_symb_has_been_depreciated
#define DDR0AD0_DDR0AD                   This_symb_has_been_depreciated
#define DDR0AD0_DDR0AD08_MASK            DDR0AD0_DDR0AD00_MASK
#define DDR0AD0_DDR0AD9_MASK             DDR0AD0_DDR0AD01_MASK
#define DDR0AD0_DDR0AD10_MASK            DDR0AD0_DDR0AD02_MASK
#define DDR0AD0_DDR0AD11_MASK            DDR0AD0_DDR0AD03_MASK
#define DDR0AD0_DDR0AD12_MASK            DDR0AD0_DDR0AD04_MASK
#define DDR0AD0_DDR0AD13_MASK            DDR0AD0_DDR0AD05_MASK
#define DDR0AD0_DDR0AD14_MASK            DDR0AD0_DDR0AD06_MASK
#define DDR0AD0_DDR0AD15_MASK            DDR0AD0_DDR0AD07_MASK
#define DDR0AD0_DDR0AD_9_MASK            This_symb_has_been_depreciated
#define DDR0AD0_DDR0AD_9_BITNUM          This_symb_has_been_depreciated
#define RDR0AD0_RDR0AD08                 RDR0AD0_RDR0AD00
#define RDR0AD0_RDR0AD9                  RDR0AD0_RDR0AD01
#define RDR0AD0_RDR0AD10                 RDR0AD0_RDR0AD02
#define RDR0AD0_RDR0AD11                 RDR0AD0_RDR0AD03
#define RDR0AD0_RDR0AD12                 RDR0AD0_RDR0AD04
#define RDR0AD0_RDR0AD13                 RDR0AD0_RDR0AD05
#define RDR0AD0_RDR0AD14                 RDR0AD0_RDR0AD06
#define RDR0AD0_RDR0AD15                 RDR0AD0_RDR0AD07
#define RDR0AD0_RDR0AD_9                 This_symb_has_been_depreciated
#define RDR0AD0_RDR0AD                   This_symb_has_been_depreciated
#define RDR0AD0_RDR0AD08_MASK            RDR0AD0_RDR0AD00_MASK
#define RDR0AD0_RDR0AD9_MASK             RDR0AD0_RDR0AD01_MASK
#define RDR0AD0_RDR0AD10_MASK            RDR0AD0_RDR0AD02_MASK
#define RDR0AD0_RDR0AD11_MASK            RDR0AD0_RDR0AD03_MASK
#define RDR0AD0_RDR0AD12_MASK            RDR0AD0_RDR0AD04_MASK
#define RDR0AD0_RDR0AD13_MASK            RDR0AD0_RDR0AD05_MASK
#define RDR0AD0_RDR0AD14_MASK            RDR0AD0_RDR0AD06_MASK
#define RDR0AD0_RDR0AD15_MASK            RDR0AD0_RDR0AD07_MASK
#define RDR0AD0_RDR0AD_9_MASK            This_symb_has_been_depreciated
#define RDR0AD0_RDR0AD_9_BITNUM          This_symb_has_been_depreciated
#define PT0AD1_PT0AD116                  PT0AD1_PT0AD10
#define PT0AD1_PT0AD117                  PT0AD1_PT0AD11
#define PT0AD1_PT0AD118                  PT0AD1_PT0AD12
#define PT0AD1_PT0AD119                  PT0AD1_PT0AD13
#define PT0AD1_PT0AD120                  PT0AD1_PT0AD14
#define PT0AD1_PT0AD121                  PT0AD1_PT0AD15
#define PT0AD1_PT0AD122                  PT0AD1_PT0AD16
#define PT0AD1_PT0AD123                  PT0AD1_PT0AD17
#define PT0AD1_PT0AD116_MASK             PT0AD1_PT0AD10_MASK
#define PT0AD1_PT0AD117_MASK             PT0AD1_PT0AD11_MASK
#define PT0AD1_PT0AD118_MASK             PT0AD1_PT0AD12_MASK
#define PT0AD1_PT0AD119_MASK             PT0AD1_PT0AD13_MASK
#define PT0AD1_PT0AD120_MASK             PT0AD1_PT0AD14_MASK
#define PT0AD1_PT0AD121_MASK             PT0AD1_PT0AD15_MASK
#define PT0AD1_PT0AD122_MASK             PT0AD1_PT0AD16_MASK
#define PT0AD1_PT0AD123_MASK             PT0AD1_PT0AD17_MASK
#define PT1AD1_PT1AD18                   PT1AD1_PT1AD10
#define PT1AD1_PT1AD19                   PT1AD1_PT1AD11
#define PT1AD1_PT1AD110                  PT1AD1_PT1AD12
#define PT1AD1_PT1AD111                  PT1AD1_PT1AD13
#define PT1AD1_PT1AD112                  PT1AD1_PT1AD14
#define PT1AD1_PT1AD113                  PT1AD1_PT1AD15
#define PT1AD1_PT1AD114                  PT1AD1_PT1AD16
#define PT1AD1_PT1AD115                  PT1AD1_PT1AD17
#define PT1AD1_PT1AD_18                  This_symb_has_been_depreciated
#define PT1AD1_PT1AD1_10                 This_symb_has_been_depreciated
#define PT1AD1_PT1AD                     This_symb_has_been_depreciated
#define PT1AD1_PT1AD18_MASK              PT1AD1_PT1AD10_MASK
#define PT1AD1_PT1AD19_MASK              PT1AD1_PT1AD11_MASK
#define PT1AD1_PT1AD110_MASK             PT1AD1_PT1AD12_MASK
#define PT1AD1_PT1AD111_MASK             PT1AD1_PT1AD13_MASK
#define PT1AD1_PT1AD112_MASK             PT1AD1_PT1AD14_MASK
#define PT1AD1_PT1AD113_MASK             PT1AD1_PT1AD15_MASK
#define PT1AD1_PT1AD114_MASK             PT1AD1_PT1AD16_MASK
#define PT1AD1_PT1AD115_MASK             PT1AD1_PT1AD17_MASK
#define PT1AD1_PT1AD_18_MASK             This_symb_has_been_depreciated
#define PT1AD1_PT1AD_18_BITNUM           This_symb_has_been_depreciated
#define PT1AD1_PT1AD1_10_MASK            This_symb_has_been_depreciated
#define PT1AD1_PT1AD1_10_BITNUM          This_symb_has_been_depreciated
#define PT01AD1_PT1AD18                  PT01AD1_PT1AD10
#define PT01AD1_PT1AD19                  PT01AD1_PT1AD11
#define PT01AD1_PT1AD110                 PT01AD1_PT1AD12
#define PT01AD1_PT1AD111                 PT01AD1_PT1AD13
#define PT01AD1_PT1AD112                 PT01AD1_PT1AD14
#define PT01AD1_PT1AD113                 PT01AD1_PT1AD15
#define PT01AD1_PT1AD114                 PT01AD1_PT1AD16
#define PT01AD1_PT1AD115                 PT01AD1_PT1AD17
#define PT01AD1_PT0AD116                 PT01AD1_PT0AD10
#define PT01AD1_PT0AD117                 PT01AD1_PT0AD11
#define PT01AD1_PT0AD118                 PT01AD1_PT0AD12
#define PT01AD1_PT0AD119                 PT01AD1_PT0AD13
#define PT01AD1_PT0AD120                 PT01AD1_PT0AD14
#define PT01AD1_PT0AD121                 PT01AD1_PT0AD15
#define PT01AD1_PT0AD122                 PT01AD1_PT0AD16
#define PT01AD1_PT0AD123                 PT01AD1_PT0AD17
#define PT01AD1_PT1AD_18                 This_symb_has_been_depreciated
#define PT01AD1_PT1AD1_10                This_symb_has_been_depreciated
#define PT01AD1_PT0AD1_16                PT01AD1_PT0AD_10
#define PT01AD1_PT1AD1                   This_symb_has_been_depreciated
#define PT01AD1_PT0AD1                   This_symb_has_been_depreciated
#define PT01AD1_PT1AD18_MASK             PT01AD1_PT1AD10_MASK
#define PT01AD1_PT1AD19_MASK             PT01AD1_PT1AD11_MASK
#define PT01AD1_PT1AD110_MASK            PT01AD1_PT1AD12_MASK
#define PT01AD1_PT1AD111_MASK            PT01AD1_PT1AD13_MASK
#define PT01AD1_PT1AD112_MASK            PT01AD1_PT1AD14_MASK
#define PT01AD1_PT1AD113_MASK            PT01AD1_PT1AD15_MASK
#define PT01AD1_PT1AD114_MASK            PT01AD1_PT1AD16_MASK
#define PT01AD1_PT1AD115_MASK            PT01AD1_PT1AD17_MASK
#define PT01AD1_PT0AD116_MASK            PT01AD1_PT0AD10_MASK
#define PT01AD1_PT0AD117_MASK            PT01AD1_PT0AD11_MASK
#define PT01AD1_PT0AD118_MASK            PT01AD1_PT0AD12_MASK
#define PT01AD1_PT0AD119_MASK            PT01AD1_PT0AD13_MASK
#define PT01AD1_PT0AD120_MASK            PT01AD1_PT0AD14_MASK
#define PT01AD1_PT0AD121_MASK            PT01AD1_PT0AD15_MASK
#define PT01AD1_PT0AD122_MASK            PT01AD1_PT0AD16_MASK
#define PT01AD1_PT0AD123_MASK            PT01AD1_PT0AD17_MASK
#define PT01AD1_PT1AD_18_MASK            This_symb_has_been_depreciated
#define PT01AD1_PT1AD_18_BITNUM          This_symb_has_been_depreciated
#define PT01AD1_PT1AD1_10_MASK           This_symb_has_been_depreciated
#define PT01AD1_PT1AD1_10_BITNUM         This_symb_has_been_depreciated
#define PT01AD1_PT0AD1_16_MASK           PT01AD1_PT0AD_10_MASK
#define PT01AD1_PT0AD1_16_BITNUM         PT01AD1_PT0AD_10_BITNUM
#define DDR0AD1_DDR0AD116                DDR0AD1_DDR0AD10
#define DDR0AD1_DDR0AD117                DDR0AD1_DDR0AD11
#define DDR0AD1_DDR0AD118                DDR0AD1_DDR0AD12
#define DDR0AD1_DDR0AD119                DDR0AD1_DDR0AD13
#define DDR0AD1_DDR0AD120                DDR0AD1_DDR0AD14
#define DDR0AD1_DDR0AD121                DDR0AD1_DDR0AD15
#define DDR0AD1_DDR0AD122                DDR0AD1_DDR0AD16
#define DDR0AD1_DDR0AD123                DDR0AD1_DDR0AD17
#define DDR0AD1_DDR0AD116_MASK           DDR0AD1_DDR0AD10_MASK
#define DDR0AD1_DDR0AD117_MASK           DDR0AD1_DDR0AD11_MASK
#define DDR0AD1_DDR0AD118_MASK           DDR0AD1_DDR0AD12_MASK
#define DDR0AD1_DDR0AD119_MASK           DDR0AD1_DDR0AD13_MASK
#define DDR0AD1_DDR0AD120_MASK           DDR0AD1_DDR0AD14_MASK
#define DDR0AD1_DDR0AD121_MASK           DDR0AD1_DDR0AD15_MASK
#define DDR0AD1_DDR0AD122_MASK           DDR0AD1_DDR0AD16_MASK
#define DDR0AD1_DDR0AD123_MASK           DDR0AD1_DDR0AD17_MASK
#define DDR1AD1_DDR1AD18                 DDR1AD1_DDR1AD10
#define DDR1AD1_DDR1AD19                 DDR1AD1_DDR1AD11
#define DDR1AD1_DDR1AD110                DDR1AD1_DDR1AD12
#define DDR1AD1_DDR1AD111                DDR1AD1_DDR1AD13
#define DDR1AD1_DDR1AD112                DDR1AD1_DDR1AD14
#define DDR1AD1_DDR1AD113                DDR1AD1_DDR1AD15
#define DDR1AD1_DDR1AD114                DDR1AD1_DDR1AD16
#define DDR1AD1_DDR1AD115                DDR1AD1_DDR1AD17
#define DDR1AD1_DDR1AD_18                This_symb_has_been_depreciated
#define DDR1AD1_DDR1AD1_10               This_symb_has_been_depreciated
#define DDR1AD1_DDR1AD                   This_symb_has_been_depreciated
#define DDR1AD1_DDR1AD18_MASK            DDR1AD1_DDR1AD10_MASK
#define DDR1AD1_DDR1AD19_MASK            DDR1AD1_DDR1AD11_MASK
#define DDR1AD1_DDR1AD110_MASK           DDR1AD1_DDR1AD12_MASK
#define DDR1AD1_DDR1AD111_MASK           DDR1AD1_DDR1AD13_MASK
#define DDR1AD1_DDR1AD112_MASK           DDR1AD1_DDR1AD14_MASK
#define DDR1AD1_DDR1AD113_MASK           DDR1AD1_DDR1AD15_MASK
#define DDR1AD1_DDR1AD114_MASK           DDR1AD1_DDR1AD16_MASK
#define DDR1AD1_DDR1AD115_MASK           DDR1AD1_DDR1AD17_MASK
#define DDR1AD1_DDR1AD_18_MASK           This_symb_has_been_depreciated
#define DDR1AD1_DDR1AD_18_BITNUM         This_symb_has_been_depreciated
#define DDR1AD1_DDR1AD1_10_MASK          This_symb_has_been_depreciated
#define DDR1AD1_DDR1AD1_10_BITNUM        This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD18                DDR01AD1_DDR1AD10
#define DDR01AD1_DDR1AD19                DDR01AD1_DDR1AD11
#define DDR01AD1_DDR1AD110               DDR01AD1_DDR1AD12
#define DDR01AD1_DDR1AD111               DDR01AD1_DDR1AD13
#define DDR01AD1_DDR1AD112               DDR01AD1_DDR1AD14
#define DDR01AD1_DDR1AD113               DDR01AD1_DDR1AD15
#define DDR01AD1_DDR1AD114               DDR01AD1_DDR1AD16
#define DDR01AD1_DDR1AD115               DDR01AD1_DDR1AD17
#define DDR01AD1_DDR0AD116               DDR01AD1_DDR0AD10
#define DDR01AD1_DDR0AD117               DDR01AD1_DDR0AD11
#define DDR01AD1_DDR0AD118               DDR01AD1_DDR0AD12
#define DDR01AD1_DDR0AD119               DDR01AD1_DDR0AD13
#define DDR01AD1_DDR0AD120               DDR01AD1_DDR0AD14
#define DDR01AD1_DDR0AD121               DDR01AD1_DDR0AD15
#define DDR01AD1_DDR0AD122               DDR01AD1_DDR0AD16
#define DDR01AD1_DDR0AD123               DDR01AD1_DDR0AD17
#define DDR01AD1_DDR1AD_18               This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD1_10              This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD1_16              DDR01AD1_DDR0AD_10
#define DDR01AD1_DDR1AD1                 This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD1                 This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD18_MASK           DDR01AD1_DDR1AD10_MASK
#define DDR01AD1_DDR1AD19_MASK           DDR01AD1_DDR1AD11_MASK
#define DDR01AD1_DDR1AD110_MASK          DDR01AD1_DDR1AD12_MASK
#define DDR01AD1_DDR1AD111_MASK          DDR01AD1_DDR1AD13_MASK
#define DDR01AD1_DDR1AD112_MASK          DDR01AD1_DDR1AD14_MASK
#define DDR01AD1_DDR1AD113_MASK          DDR01AD1_DDR1AD15_MASK
#define DDR01AD1_DDR1AD114_MASK          DDR01AD1_DDR1AD16_MASK
#define DDR01AD1_DDR1AD115_MASK          DDR01AD1_DDR1AD17_MASK
#define DDR01AD1_DDR0AD116_MASK          DDR01AD1_DDR0AD10_MASK
#define DDR01AD1_DDR0AD117_MASK          DDR01AD1_DDR0AD11_MASK
#define DDR01AD1_DDR0AD118_MASK          DDR01AD1_DDR0AD12_MASK
#define DDR01AD1_DDR0AD119_MASK          DDR01AD1_DDR0AD13_MASK
#define DDR01AD1_DDR0AD120_MASK          DDR01AD1_DDR0AD14_MASK
#define DDR01AD1_DDR0AD121_MASK          DDR01AD1_DDR0AD15_MASK
#define DDR01AD1_DDR0AD122_MASK          DDR01AD1_DDR0AD16_MASK
#define DDR01AD1_DDR0AD123_MASK          DDR01AD1_DDR0AD17_MASK
