frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
#define DDR01AD1_DDR1AD_18_MASK          This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD_18_BITNUM        This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD1_10_MASK         This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD1_10_BITNUM       This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD1_16_MASK         DDR01AD1_DDR0AD_10_MASK
#define DDR01AD1_DDR0AD1_16_BITNUM       DDR01AD1_DDR0AD_10_BITNUM
#define RDR0AD1_RDR0AD116                RDR0AD1_RDR0AD10
#define RDR0AD1_RDR0AD117                RDR0AD1_RDR0AD11
#define RDR0AD1_RDR0AD118                RDR0AD1_RDR0AD12
#define RDR0AD1_RDR0AD119                RDR0AD1_RDR0AD13
#define RDR0AD1_RDR0AD120                RDR0AD1_RDR0AD14
#define RDR0AD1_RDR0AD121                RDR0AD1_RDR0AD15
#define RDR0AD1_RDR0AD122                RDR0AD1_RDR0AD16
#define RDR0AD1_RDR0AD123                RDR0AD1_RDR0AD17
#define RDR0AD1_RDR0AD116_MASK           RDR0AD1_RDR0AD10_MASK
#define RDR0AD1_RDR0AD117_MASK           RDR0AD1_RDR0AD11_MASK
#define RDR0AD1_RDR0AD118_MASK           RDR0AD1_RDR0AD12_MASK
#define RDR0AD1_RDR0AD119_MASK           RDR0AD1_RDR0AD13_MASK
#define RDR0AD1_RDR0AD120_MASK           RDR0AD1_RDR0AD14_MASK
#define RDR0AD1_RDR0AD121_MASK           RDR0AD1_RDR0AD15_MASK
#define RDR0AD1_RDR0AD122_MASK           RDR0AD1_RDR0AD16_MASK
#define RDR0AD1_RDR0AD123_MASK           RDR0AD1_RDR0AD17_MASK
#define RDR1AD1_RDR1AD18                 RDR1AD1_RDR1AD10
#define RDR1AD1_RDR1AD19                 RDR1AD1_RDR1AD11
#define RDR1AD1_RDR1AD110                RDR1AD1_RDR1AD12
#define RDR1AD1_RDR1AD111                RDR1AD1_RDR1AD13
#define RDR1AD1_RDR1AD112                RDR1AD1_RDR1AD14
#define RDR1AD1_RDR1AD113                RDR1AD1_RDR1AD15
#define RDR1AD1_RDR1AD114                RDR1AD1_RDR1AD16
#define RDR1AD1_RDR1AD115                RDR1AD1_RDR1AD17
#define RDR1AD1_RDR1AD_18                This_symb_has_been_depreciated
#define RDR1AD1_RDR1AD1_10               This_symb_has_been_depreciated
#define RDR1AD1_RDR1AD                   This_symb_has_been_depreciated
#define RDR1AD1_RDR1AD18_MASK            RDR1AD1_RDR1AD10_MASK
#define RDR1AD1_RDR1AD19_MASK            RDR1AD1_RDR1AD11_MASK
#define RDR1AD1_RDR1AD110_MASK           RDR1AD1_RDR1AD12_MASK
#define RDR1AD1_RDR1AD111_MASK           RDR1AD1_RDR1AD13_MASK
#define RDR1AD1_RDR1AD112_MASK           RDR1AD1_RDR1AD14_MASK
#define RDR1AD1_RDR1AD113_MASK           RDR1AD1_RDR1AD15_MASK
#define RDR1AD1_RDR1AD114_MASK           RDR1AD1_RDR1AD16_MASK
#define RDR1AD1_RDR1AD115_MASK           RDR1AD1_RDR1AD17_MASK
#define RDR1AD1_RDR1AD_18_MASK           This_symb_has_been_depreciated
#define RDR1AD1_RDR1AD_18_BITNUM         This_symb_has_been_depreciated
#define RDR1AD1_RDR1AD1_10_MASK          This_symb_has_been_depreciated
#define RDR1AD1_RDR1AD1_10_BITNUM        This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD18                RDR01AD1_RDR1AD10
#define RDR01AD1_RDR1AD19                RDR01AD1_RDR1AD11
#define RDR01AD1_RDR1AD110               RDR01AD1_RDR1AD12
#define RDR01AD1_RDR1AD111               RDR01AD1_RDR1AD13
#define RDR01AD1_RDR1AD112               RDR01AD1_RDR1AD14
#define RDR01AD1_RDR1AD113               RDR01AD1_RDR1AD15
#define RDR01AD1_RDR1AD114               RDR01AD1_RDR1AD16
#define RDR01AD1_RDR1AD115               RDR01AD1_RDR1AD17
#define RDR01AD1_RDR0AD116               RDR01AD1_RDR0AD10
#define RDR01AD1_RDR0AD117               RDR01AD1_RDR0AD11
#define RDR01AD1_RDR0AD118               RDR01AD1_RDR0AD12
#define RDR01AD1_RDR0AD119               RDR01AD1_RDR0AD13
#define RDR01AD1_RDR0AD120               RDR01AD1_RDR0AD14
#define RDR01AD1_RDR0AD121               RDR01AD1_RDR0AD15
#define RDR01AD1_RDR0AD122               RDR01AD1_RDR0AD16
#define RDR01AD1_RDR0AD123               RDR01AD1_RDR0AD17
#define RDR01AD1_RDR1AD_18               This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD1_10              This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD1_16              RDR01AD1_RDR0AD_10
#define RDR01AD1_RDR1AD1                 This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD1                 This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD18_MASK           RDR01AD1_RDR1AD10_MASK
#define RDR01AD1_RDR1AD19_MASK           RDR01AD1_RDR1AD11_MASK
#define RDR01AD1_RDR1AD110_MASK          RDR01AD1_RDR1AD12_MASK
#define RDR01AD1_RDR1AD111_MASK          RDR01AD1_RDR1AD13_MASK
#define RDR01AD1_RDR1AD112_MASK          RDR01AD1_RDR1AD14_MASK
#define RDR01AD1_RDR1AD113_MASK          RDR01AD1_RDR1AD15_MASK
#define RDR01AD1_RDR1AD114_MASK          RDR01AD1_RDR1AD16_MASK
#define RDR01AD1_RDR1AD115_MASK          RDR01AD1_RDR1AD17_MASK
#define RDR01AD1_RDR0AD116_MASK          RDR01AD1_RDR0AD10_MASK
#define RDR01AD1_RDR0AD117_MASK          RDR01AD1_RDR0AD11_MASK
#define RDR01AD1_RDR0AD118_MASK          RDR01AD1_RDR0AD12_MASK
#define RDR01AD1_RDR0AD119_MASK          RDR01AD1_RDR0AD13_MASK
#define RDR01AD1_RDR0AD120_MASK          RDR01AD1_RDR0AD14_MASK
#define RDR01AD1_RDR0AD121_MASK          RDR01AD1_RDR0AD15_MASK
#define RDR01AD1_RDR0AD122_MASK          RDR01AD1_RDR0AD16_MASK
#define RDR01AD1_RDR0AD123_MASK          RDR01AD1_RDR0AD17_MASK
#define RDR01AD1_RDR1AD_18_MASK          This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD_18_BITNUM        This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD1_10_MASK         This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD1_10_BITNUM       This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD1_16_MASK         RDR01AD1_RDR0AD_10_MASK
#define RDR01AD1_RDR0AD1_16_BITNUM       RDR01AD1_RDR0AD_10_BITNUM
#define PER0AD1_PER0AD116                PER0AD1_PER0AD10
#define PER0AD1_PER0AD117                PER0AD1_PER0AD11
#define PER0AD1_PER0AD118                PER0AD1_PER0AD12
#define PER0AD1_PER0AD119                PER0AD1_PER0AD13
#define PER0AD1_PER0AD120                PER0AD1_PER0AD14
#define PER0AD1_PER0AD121                PER0AD1_PER0AD15
#define PER0AD1_PER0AD122                PER0AD1_PER0AD16
#define PER0AD1_PER0AD123                PER0AD1_PER0AD17
#define PER0AD1_PER0AD116_MASK           PER0AD1_PER0AD10_MASK
#define PER0AD1_PER0AD117_MASK           PER0AD1_PER0AD11_MASK
#define PER0AD1_PER0AD118_MASK           PER0AD1_PER0AD12_MASK
#define PER0AD1_PER0AD119_MASK           PER0AD1_PER0AD13_MASK
#define PER0AD1_PER0AD120_MASK           PER0AD1_PER0AD14_MASK
#define PER0AD1_PER0AD121_MASK           PER0AD1_PER0AD15_MASK
#define PER0AD1_PER0AD122_MASK           PER0AD1_PER0AD16_MASK
#define PER0AD1_PER0AD123_MASK           PER0AD1_PER0AD17_MASK
#define PER1AD1_PER1AD18                 PER1AD1_PER1AD10
#define PER1AD1_PER1AD19                 PER1AD1_PER1AD11
#define PER1AD1_PER1AD110                PER1AD1_PER1AD12
#define PER1AD1_PER1AD111                PER1AD1_PER1AD13
#define PER1AD1_PER1AD112                PER1AD1_PER1AD14
#define PER1AD1_PER1AD113                PER1AD1_PER1AD15
#define PER1AD1_PER1AD114                PER1AD1_PER1AD16
#define PER1AD1_PER1AD115                PER1AD1_PER1AD17
#define PER1AD1_PER1AD_18                This_symb_has_been_depreciated
#define PER1AD1_PER1AD1_10               This_symb_has_been_depreciated
#define PER1AD1_PER1AD                   This_symb_has_been_depreciated
#define PER1AD1_PER1AD18_MASK            PER1AD1_PER1AD10_MASK
#define PER1AD1_PER1AD19_MASK            PER1AD1_PER1AD11_MASK
#define PER1AD1_PER1AD110_MASK           PER1AD1_PER1AD12_MASK
#define PER1AD1_PER1AD111_MASK           PER1AD1_PER1AD13_MASK
#define PER1AD1_PER1AD112_MASK           PER1AD1_PER1AD14_MASK
#define PER1AD1_PER1AD113_MASK           PER1AD1_PER1AD15_MASK
#define PER1AD1_PER1AD114_MASK           PER1AD1_PER1AD16_MASK
#define PER1AD1_PER1AD115_MASK           PER1AD1_PER1AD17_MASK
#define PER1AD1_PER1AD_18_MASK           This_symb_has_been_depreciated
#define PER1AD1_PER1AD_18_BITNUM         This_symb_has_been_depreciated
#define PER1AD1_PER1AD1_10_MASK          This_symb_has_been_depreciated
#define PER1AD1_PER1AD1_10_BITNUM        This_symb_has_been_depreciated
#define PER01AD1_PER1AD18                PER01AD1_PER1AD10
#define PER01AD1_PER1AD19                PER01AD1_PER1AD11
#define PER01AD1_PER1AD110               PER01AD1_PER1AD12
#define PER01AD1_PER1AD111               PER01AD1_PER1AD13
#define PER01AD1_PER1AD112               PER01AD1_PER1AD14
#define PER01AD1_PER1AD113               PER01AD1_PER1AD15
#define PER01AD1_PER1AD114               PER01AD1_PER1AD16
#define PER01AD1_PER1AD115               PER01AD1_PER1AD17
#define PER01AD1_PER0AD116               PER01AD1_PER0AD10
#define PER01AD1_PER0AD117               PER01AD1_PER0AD11
#define PER01AD1_PER0AD118               PER01AD1_PER0AD12
#define PER01AD1_PER0AD119               PER01AD1_PER0AD13
#define PER01AD1_PER0AD120               PER01AD1_PER0AD14
#define PER01AD1_PER0AD121               PER01AD1_PER0AD15
#define PER01AD1_PER0AD122               PER01AD1_PER0AD16
#define PER01AD1_PER0AD123               PER01AD1_PER0AD17
#define PER01AD1_PER1AD_18               This_symb_has_been_depreciated
#define PER01AD1_PER1AD1_10              This_symb_has_been_depreciated
#define PER01AD1_PER0AD1_16              PER01AD1_PER0AD_10
#define PER01AD1_PER1AD1                 This_symb_has_been_depreciated
#define PER01AD1_PER0AD1                 This_symb_has_been_depreciated
#define PER01AD1_PER1AD18_MASK           PER01AD1_PER1AD10_MASK
#define PER01AD1_PER1AD19_MASK           PER01AD1_PER1AD11_MASK
#define PER01AD1_PER1AD110_MASK          PER01AD1_PER1AD12_MASK
#define PER01AD1_PER1AD111_MASK          PER01AD1_PER1AD13_MASK
#define PER01AD1_PER1AD112_MASK          PER01AD1_PER1AD14_MASK
#define PER01AD1_PER1AD113_MASK          PER01AD1_PER1AD15_MASK
#define PER01AD1_PER1AD114_MASK          PER01AD1_PER1AD16_MASK
#define PER01AD1_PER1AD115_MASK          PER01AD1_PER1AD17_MASK
#define PER01AD1_PER0AD116_MASK          PER01AD1_PER0AD10_MASK
#define PER01AD1_PER0AD117_MASK          PER01AD1_PER0AD11_MASK
#define PER01AD1_PER0AD118_MASK          PER01AD1_PER0AD12_MASK
#define PER01AD1_PER0AD119_MASK          PER01AD1_PER0AD13_MASK
#define PER01AD1_PER0AD120_MASK          PER01AD1_PER0AD14_MASK
#define PER01AD1_PER0AD121_MASK          PER01AD1_PER0AD15_MASK
#define PER01AD1_PER0AD122_MASK          PER01AD1_PER0AD16_MASK
#define PER01AD1_PER0AD123_MASK          PER01AD1_PER0AD17_MASK
#define PER01AD1_PER1AD_18_MASK          This_symb_has_been_depreciated
#define PER01AD1_PER1AD_18_BITNUM        This_symb_has_been_depreciated
#define PER01AD1_PER1AD1_10_MASK         This_symb_has_been_depreciated
#define PER01AD1_PER1AD1_10_BITNUM       This_symb_has_been_depreciated
#define PER01AD1_PER0AD1_16_MASK         PER01AD1_PER0AD_10_MASK
#define PER01AD1_PER0AD1_16_BITNUM       PER01AD1_PER0AD_10_BITNUM
#define ATD0CTL2_ASCIF                   ATD0CTL2_ACMPIE
#define ATD0CTL2_ASCIF_MASK              ATD0CTL2_ACMPIE_MASK
#define ATD0CTL23_ASCIF                  ATD0CTL23_ACMPIE
#define ATD0CTL23_ASCIF_MASK             ATD0CTL23_ACMPIE_MASK
#define XGMCTL_XGSWEIF                   XGMCTL_XGSWEF
#define XGMCTL_XGSWEIF_MASK              XGMCTL_XGSWEF_MASK
#define XGIF0                            XGIF_7F_70
#define XGIF0_XGIF_70                    XGIF_7F_70_XGIF_70
#define XGIF0_XGIF_71                    XGIF_7F_70_XGIF_71
#define XGIF0_XGIF_72                    XGIF_7F_70_XGIF_72
#define XGIF0_XGIF_73                    XGIF_7F_70_XGIF_73
#define XGIF0_XGIF_74                    XGIF_7F_70_XGIF_74
#define XGIF0_XGIF_75                    XGIF_7F_70_XGIF_75
#define XGIF0_XGIF_76                    XGIF_7F_70_XGIF_76
#define XGIF0_XGIF_77                    XGIF_7F_70_XGIF_77
#define XGIF0_XGIF_78                    XGIF_7F_70_XGIF_78
#define XGIF_ARR                         ((volatile word *) &XGIF_7F_70)
#define XGIF0_XGIF__70                   XGIF_7F_70_XGIF__70
#define XGIF0_XGIF_                      XGIF_7F_70_XGIF_
#define XGIF0_XGIF_70_MASK               XGIF_7F_70_XGIF_70_MASK
#define XGIF0_XGIF_71_MASK               XGIF_7F_70_XGIF_71_MASK
#define XGIF0_XGIF_72_MASK               XGIF_7F_70_XGIF_72_MASK
#define XGIF0_XGIF_73_MASK               XGIF_7F_70_XGIF_73_MASK
#define XGIF0_XGIF_74_MASK               XGIF_7F_70_XGIF_74_MASK
#define XGIF0_XGIF_75_MASK               XGIF_7F_70_XGIF_75_MASK
#define XGIF0_XGIF_76_MASK               XGIF_7F_70_XGIF_76_MASK
#define XGIF0_XGIF_77_MASK               XGIF_7F_70_XGIF_77_MASK
#define XGIF0_XGIF_78_MASK               XGIF_7F_70_XGIF_78_MASK
#define XGIF0_XGIF__70_MASK              XGIF_7F_70_XGIF__70_MASK
#define XGIF0_XGIF__70_BITNUM            XGIF_7F_70_XGIF__70_BITNUM
#define XGIF1                            XGIF_6F_60
#define XGIF1_XGIF_60                    XGIF_6F_60_XGIF_60
#define XGIF1_XGIF_61                    XGIF_6F_60_XGIF_61
#define XGIF1_XGIF_62                    XGIF_6F_60_XGIF_62
#define XGIF1_XGIF_63                    XGIF_6F_60_XGIF_63
#define XGIF1_XGIF_64                    XGIF_6F_60_XGIF_64
#define XGIF1_XGIF_65                    XGIF_6F_60_XGIF_65
#define XGIF1_XGIF_66                    XGIF_6F_60_XGIF_66
#define XGIF1_XGIF_67                    XGIF_6F_60_XGIF_67
#define XGIF1_XGIF_68                    XGIF_6F_60_XGIF_68
#define XGIF1_XGIF_69                    XGIF_6F_60_XGIF_69
#define XGIF1_XGIF_6A                    XGIF_6F_60_XGIF_6A
#define XGIF1_XGIF_6B                    XGIF_6F_60_XGIF_6B
#define XGIF1_XGIF_6C                    XGIF_6F_60_XGIF_6C
#define XGIF1_XGIF_6D                    XGIF_6F_60_XGIF_6D
#define XGIF1_XGIF_6E                    XGIF_6F_60_XGIF_6E
#define XGIF1_XGIF_6F                    XGIF_6F_60_XGIF_6F
#define XGIF1_XGIF__60                   XGIF_6F_60_XGIF__60
#define XGIF1_XGIF_                      XGIF_6F_60_XGIF_
#define XGIF1_XGIF_60_MASK               XGIF_6F_60_XGIF_60_MASK
#define XGIF1_XGIF_61_MASK               XGIF_6F_60_XGIF_61_MASK
#define XGIF1_XGIF_62_MASK               XGIF_6F_60_XGIF_62_MASK
#define XGIF1_XGIF_63_MASK               XGIF_6F_60_XGIF_63_MASK
#define XGIF1_XGIF_64_MASK               XGIF_6F_60_XGIF_64_MASK
#define XGIF1_XGIF_65_MASK               XGIF_6F_60_XGIF_65_MASK
#define XGIF1_XGIF_66_MASK               XGIF_6F_60_XGIF_66_MASK
#define XGIF1_XGIF_67_MASK               XGIF_6F_60_XGIF_67_MASK
#define XGIF1_XGIF_68_MASK               XGIF_6F_60_XGIF_68_MASK
#define XGIF1_XGIF_69_MASK               XGIF_6F_60_XGIF_69_MASK
#define XGIF1_XGIF_6A_MASK               XGIF_6F_60_XGIF_6A_MASK
#define XGIF1_XGIF_6B_MASK               XGIF_6F_60_XGIF_6B_MASK
#define XGIF1_XGIF_6C_MASK               XGIF_6F_60_XGIF_6C_MASK
#define XGIF1_XGIF_6D_MASK               XGIF_6F_60_XGIF_6D_MASK
#define XGIF1_XGIF_6E_MASK               XGIF_6F_60_XGIF_6E_MASK
#define XGIF1_XGIF_6F_MASK               XGIF_6F_60_XGIF_6F_MASK
#define XGIF1_XGIF__60_MASK              XGIF_6F_60_XGIF__60_MASK
#define XGIF1_XGIF__60_BITNUM            XGIF_6F_60_XGIF__60_BITNUM
#define XGIF2                            XGIF_5F_50
#define XGIF2_XGIF_50                    XGIF_5F_50_XGIF_50
#define XGIF2_XGIF_51                    XGIF_5F_50_XGIF_51
#define XGIF2_XGIF_52                    XGIF_5F_50_XGIF_52
#define XGIF2_XGIF_53                    XGIF_5F_50_XGIF_53
#define XGIF2_XGIF_54                    XGIF_5F_50_XGIF_54
#define XGIF2_XGIF_55                    XGIF_5F_50_XGIF_55
#define XGIF2_XGIF_56                    XGIF_5F_50_XGIF_56
#define XGIF2_XGIF_57                    XGIF_5F_50_XGIF_57
#define XGIF2_XGIF_58                    XGIF_5F_50_XGIF_58
#define XGIF2_XGIF_59                    XGIF_5F_50_XGIF_59
#define XGIF2_XGIF_5A                    XGIF_5F_50_XGIF_5A
#define XGIF2_XGIF_5B                    XGIF_5F_50_XGIF_5B
#define XGIF2_XGIF_5C                    XGIF_5F_50_XGIF_5C
#define XGIF2_XGIF_5D                    XGIF_5F_50_XGIF_5D
#define XGIF2_XGIF_5E                    XGIF_5F_50_XGIF_5E
#define XGIF2_XGIF_5F                    XGIF_5F_50_XGIF_5F
#define XGIF2_XGIF__50                   XGIF_5F_50_XGIF__50
#define XGIF2_XGIF_                      XGIF_5F_50_XGIF_
#define XGIF2_XGIF_50_MASK               XGIF_5F_50_XGIF_50_MASK
#define XGIF2_XGIF_51_MASK               XGIF_5F_50_XGIF_51_MASK
#define XGIF2_XGIF_52_MASK               XGIF_5F_50_XGIF_52_MASK
#define XGIF2_XGIF_53_MASK               XGIF_5F_50_XGIF_53_MASK
#define XGIF2_XGIF_54_MASK               XGIF_5F_50_XGIF_54_MASK
#define XGIF2_XGIF_55_MASK               XGIF_5F_50_XGIF_55_MASK
#define XGIF2_XGIF_56_MASK               XGIF_5F_50_XGIF_56_MASK
#define XGIF2_XGIF_57_MASK               XGIF_5F_50_XGIF_57_MASK
#define XGIF2_XGIF_58_MASK               XGIF_5F_50_XGIF_58_MASK
#define XGIF2_XGIF_59_MASK               XGIF_5F_50_XGIF_59_MASK
#define XGIF2_XGIF_5A_MASK               XGIF_5F_50_XGIF_5A_MASK
#define XGIF2_XGIF_5B_MASK               XGIF_5F_50_XGIF_5B_MASK
#define XGIF2_XGIF_5C_MASK               XGIF_5F_50_XGIF_5C_MASK
#define XGIF2_XGIF_5D_MASK               XGIF_5F_50_XGIF_5D_MASK
#define XGIF2_XGIF_5E_MASK               XGIF_5F_50_XGIF_5E_MASK
#define XGIF2_XGIF_5F_MASK               XGIF_5F_50_XGIF_5F_MASK
#define XGIF2_XGIF__50_MASK              XGIF_5F_50_XGIF__50_MASK
#define XGIF2_XGIF__50_BITNUM            XGIF_5F_50_XGIF__50_BITNUM
#define XGIF3                            XGIF_4F_40
#define XGIF3_XGIF_40                    XGIF_4F_40_XGIF_40
#define XGIF3_XGIF_41                    XGIF_4F_40_XGIF_41
#define XGIF3_XGIF_42                    XGIF_4F_40_XGIF_42
#define XGIF3_XGIF_43                    XGIF_4F_40_XGIF_43
#define XGIF3_XGIF_44                    XGIF_4F_40_XGIF_44
#define XGIF3_XGIF_45                    XGIF_4F_40_XGIF_45
#define XGIF3_XGIF_46                    XGIF_4F_40_XGIF_46
#define XGIF3_XGIF_47                    XGIF_4F_40_XGIF_47
#define XGIF3_XGIF_48                    XGIF_4F_40_XGIF_48
#define XGIF3_XGIF_49                    XGIF_4F_40_XGIF_49
#define XGIF3_XGIF_4A                    XGIF_4F_40_XGIF_4A
#define XGIF3_XGIF_4B                    XGIF_4F_40_XGIF_4B
#define XGIF3_XGIF_4C                    XGIF_4F_40_XGIF_4C
#define XGIF3_XGIF_4D                    XGIF_4F_40_XGIF_4D
#define XGIF3_XGIF_4E                    XGIF_4F_40_XGIF_4E
#define XGIF3_XGIF_4F                    XGIF_4F_40_XGIF_4F
#define XGIF3_XGIF__40                   XGIF_4F_40_XGIF__40
#define XGIF3_XGIF_                      XGIF_4F_40_XGIF_
#define XGIF3_XGIF_40_MASK               XGIF_4F_40_XGIF_40_MASK
#define XGIF3_XGIF_41_MASK               XGIF_4F_40_XGIF_41_MASK
#define XGIF3_XGIF_42_MASK               XGIF_4F_40_XGIF_42_MASK
#define XGIF3_XGIF_43_MASK               XGIF_4F_40_XGIF_43_MASK
#define XGIF3_XGIF_44_MASK               XGIF_4F_40_XGIF_44_MASK
#define XGIF3_XGIF_45_MASK               XGIF_4F_40_XGIF_45_MASK
#define XGIF3_XGIF_46_MASK               XGIF_4F_40_XGIF_46_MASK
#define XGIF3_XGIF_47_MASK               XGIF_4F_40_XGIF_47_MASK
#define XGIF3_XGIF_48_MASK               XGIF_4F_40_XGIF_48_MASK
#define XGIF3_XGIF_49_MASK               XGIF_4F_40_XGIF_49_MASK
#define XGIF3_XGIF_4A_MASK               XGIF_4F_40_XGIF_4A_MASK
#define XGIF3_XGIF_4B_MASK               XGIF_4F_40_XGIF_4B_MASK
#define XGIF3_XGIF_4C_MASK               XGIF_4F_40_XGIF_4C_MASK
#define XGIF3_XGIF_4D_MASK               XGIF_4F_40_XGIF_4D_MASK
#define XGIF3_XGIF_4E_MASK               XGIF_4F_40_XGIF_4E_MASK
#define XGIF3_XGIF_4F_MASK               XGIF_4F_40_XGIF_4F_MASK
#define XGIF3_XGIF__40_MASK              XGIF_4F_40_XGIF__40_MASK
#define XGIF3_XGIF__40_BITNUM            XGIF_4F_40_XGIF__40_BITNUM
#define XGIF4                            XGIF_3F_30
#define XGIF4_XGIF_30                    XGIF_3F_30_XGIF_30
#define XGIF4_XGIF_31                    XGIF_3F_30_XGIF_31
#define XGIF4_XGIF_32                    XGIF_3F_30_XGIF_32
#define XGIF4_XGIF_33                    XGIF_3F_30_XGIF_33
#define XGIF4_XGIF_34                    XGIF_3F_30_XGIF_34
#define XGIF4_XGIF_35                    XGIF_3F_30_XGIF_35
#define XGIF4_XGIF_36                    XGIF_3F_30_XGIF_36
#define XGIF4_XGIF_37                    XGIF_3F_30_XGIF_37
#define XGIF4_XGIF_38                    XGIF_3F_30_XGIF_38
#define XGIF4_XGIF_39                    XGIF_3F_30_XGIF_39
#define XGIF4_XGIF_3A                    XGIF_3F_30_XGIF_3A
#define XGIF4_XGIF_3B                    XGIF_3F_30_XGIF_3B
#define XGIF4_XGIF_3C                    XGIF_3F_30_XGIF_3C
#define XGIF4_XGIF_3D                    XGIF_3F_30_XGIF_3D
#define XGIF4_XGIF_3E                    XGIF_3F_30_XGIF_3E
#define XGIF4_XGIF_3F                    XGIF_3F_30_XGIF_3F
#define XGIF4_XGIF__30                   XGIF_3F_30_XGIF__30
#define XGIF4_XGIF_                      XGIF_3F_30_XGIF_
#define XGIF4_XGIF_30_MASK               XGIF_3F_30_XGIF_30_MASK
#define XGIF4_XGIF_31_MASK               XGIF_3F_30_XGIF_31_MASK
#define XGIF4_XGIF_32_MASK               XGIF_3F_30_XGIF_32_MASK
#define XGIF4_XGIF_33_MASK               XGIF_3F_30_XGIF_33_MASK
#define XGIF4_XGIF_34_MASK               XGIF_3F_30_XGIF_34_MASK
#define XGIF4_XGIF_35_MASK               XGIF_3F_30_XGIF_35_MASK
#define XGIF4_XGIF_36_MASK               XGIF_3F_30_XGIF_36_MASK
#define XGIF4_XGIF_37_MASK               XGIF_3F_30_XGIF_37_MASK
#define XGIF4_XGIF_38_MASK               XGIF_3F_30_XGIF_38_MASK
#define XGIF4_XGIF_39_MASK               XGIF_3F_30_XGIF_39_MASK
#define XGIF4_XGIF_3A_MASK               XGIF_3F_30_XGIF_3A_MASK
#define XGIF4_XGIF_3B_MASK               XGIF_3F_30_XGIF_3B_MASK
#define XGIF4_XGIF_3C_MASK               XGIF_3F_30_XGIF_3C_MASK
#define XGIF4_XGIF_3D_MASK               XGIF_3F_30_XGIF_3D_MASK
#define XGIF4_XGIF_3E_MASK               XGIF_3F_30_XGIF_3E_MASK
#define XGIF4_XGIF_3F_MASK               XGIF_3F_30_XGIF_3F_MASK
#define XGIF4_XGIF__30_MASK              XGIF_3F_30_XGIF__30_MASK
#define XGIF4_XGIF__30_BITNUM            XGIF_3F_30_XGIF__30_BITNUM
#define XGIF5                            XGIF_2F_20
#define XGIF5_XGIF_20                    XGIF_2F_20_XGIF_20
#define XGIF5_XGIF_21                    XGIF_2F_20_XGIF_21
#define XGIF5_XGIF_22                    XGIF_2F_20_XGIF_22
#define XGIF5_XGIF_23                    XGIF_2F_20_XGIF_23
#define XGIF5_XGIF_24                    XGIF_2F_20_XGIF_24
#define XGIF5_XGIF_25                    XGIF_2F_20_XGIF_25
#define XGIF5_XGIF_26                    XGIF_2F_20_XGIF_26
#define XGIF5_XGIF_27                    XGIF_2F_20_XGIF_27
#define XGIF5_XGIF_28                    XGIF_2F_20_XGIF_28
#define XGIF5_XGIF_29                    XGIF_2F_20_XGIF_29
#define XGIF5_XGIF_2A                    XGIF_2F_20_XGIF_2A
#define XGIF5_XGIF_2B                    XGIF_2F_20_XGIF_2B
#define XGIF5_XGIF_2C                    XGIF_2F_20_XGIF_2C
#define XGIF5_XGIF_2D                    XGIF_2F_20_XGIF_2D
#define XGIF5_XGIF_2E                    XGIF_2F_20_XGIF_2E
#define XGIF5_XGIF_2F                    XGIF_2F_20_XGIF_2F
#define XGIF5_XGIF__20                   XGIF_2F_20_XGIF__20
#define XGIF5_XGIF_                      XGIF_2F_20_XGIF_
#define XGIF5_XGIF_20_MASK               XGIF_2F_20_XGIF_20_MASK
#define XGIF5_XGIF_21_MASK               XGIF_2F_20_XGIF_21_MASK
#define XGIF5_XGIF_22_MASK               XGIF_2F_20_XGIF_22_MASK
#define XGIF5_XGIF_23_MASK               XGIF_2F_20_XGIF_23_MASK
#define XGIF5_XGIF_24_MASK               XGIF_2F_20_XGIF_24_MASK
#define XGIF5_XGIF_25_MASK               XGIF_2F_20_XGIF_25_MASK
#define XGIF5_XGIF_26_MASK               XGIF_2F_20_XGIF_26_MASK
#define XGIF5_XGIF_27_MASK               XGIF_2F_20_XGIF_27_MASK
#define XGIF5_XGIF_28_MASK               XGIF_2F_20_XGIF_28_MASK
#define XGIF5_XGIF_29_MASK               XGIF_2F_20_XGIF_29_MASK
#define XGIF5_XGIF_2A_MASK               XGIF_2F_20_XGIF_2A_MASK
#define XGIF5_XGIF_2B_MASK               XGIF_2F_20_XGIF_2B_MASK
#define XGIF5_XGIF_2C_MASK               XGIF_2F_20_XGIF_2C_MASK
#define XGIF5_XGIF_2D_MASK               XGIF_2F_20_XGIF_2D_MASK
#define XGIF5_XGIF_2E_MASK               XGIF_2F_20_XGIF_2E_MASK
