frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
#define XGIF5_XGIF_2F_MASK               XGIF_2F_20_XGIF_2F_MASK
#define XGIF5_XGIF__20_MASK              XGIF_2F_20_XGIF__20_MASK
#define XGIF5_XGIF__20_BITNUM            XGIF_2F_20_XGIF__20_BITNUM
#define XGIF6                            XGIF_1F_10
#define XGIF6_XGIF_10                    XGIF_1F_10_XGIF_10
#define XGIF6_XGIF_11                    XGIF_1F_10_XGIF_11
#define XGIF6_XGIF_12                    XGIF_1F_10_XGIF_12
#define XGIF6_XGIF_13                    XGIF_1F_10_XGIF_13
#define XGIF6_XGIF_14                    XGIF_1F_10_XGIF_14
#define XGIF6_XGIF_15                    XGIF_1F_10_XGIF_15
#define XGIF6_XGIF_16                    XGIF_1F_10_XGIF_16
#define XGIF6_XGIF_17                    XGIF_1F_10_XGIF_17
#define XGIF6_XGIF_18                    XGIF_1F_10_XGIF_18
#define XGIF6_XGIF_19                    XGIF_1F_10_XGIF_19
#define XGIF6_XGIF_1A                    XGIF_1F_10_XGIF_1A
#define XGIF6_XGIF_1B                    XGIF_1F_10_XGIF_1B
#define XGIF6_XGIF_1C                    XGIF_1F_10_XGIF_1C
#define XGIF6_XGIF_1D                    XGIF_1F_10_XGIF_1D
#define XGIF6_XGIF_1E                    XGIF_1F_10_XGIF_1E
#define XGIF6_XGIF_1F                    XGIF_1F_10_XGIF_1F
#define XGIF6_XGIF__10                   XGIF_1F_10_XGIF__10
#define XGIF6_XGIF_                      XGIF_1F_10_XGIF_
#define XGIF6_XGIF_10_MASK               XGIF_1F_10_XGIF_10_MASK
#define XGIF6_XGIF_11_MASK               XGIF_1F_10_XGIF_11_MASK
#define XGIF6_XGIF_12_MASK               XGIF_1F_10_XGIF_12_MASK
#define XGIF6_XGIF_13_MASK               XGIF_1F_10_XGIF_13_MASK
#define XGIF6_XGIF_14_MASK               XGIF_1F_10_XGIF_14_MASK
#define XGIF6_XGIF_15_MASK               XGIF_1F_10_XGIF_15_MASK
#define XGIF6_XGIF_16_MASK               XGIF_1F_10_XGIF_16_MASK
#define XGIF6_XGIF_17_MASK               XGIF_1F_10_XGIF_17_MASK
#define XGIF6_XGIF_18_MASK               XGIF_1F_10_XGIF_18_MASK
#define XGIF6_XGIF_19_MASK               XGIF_1F_10_XGIF_19_MASK
#define XGIF6_XGIF_1A_MASK               XGIF_1F_10_XGIF_1A_MASK
#define XGIF6_XGIF_1B_MASK               XGIF_1F_10_XGIF_1B_MASK
#define XGIF6_XGIF_1C_MASK               XGIF_1F_10_XGIF_1C_MASK
#define XGIF6_XGIF_1D_MASK               XGIF_1F_10_XGIF_1D_MASK
#define XGIF6_XGIF_1E_MASK               XGIF_1F_10_XGIF_1E_MASK
#define XGIF6_XGIF_1F_MASK               XGIF_1F_10_XGIF_1F_MASK
#define XGIF6_XGIF__10_MASK              XGIF_1F_10_XGIF__10_MASK
#define XGIF6_XGIF__10_BITNUM            XGIF_1F_10_XGIF__10_BITNUM
#define XGIF7                            XGIF_0F_00
#define XGIF7_XGIF_09                    XGIF_0F_00_XGIF_09
#define XGIF7_XGIF_0A                    XGIF_0F_00_XGIF_0A
#define XGIF7_XGIF_0B                    XGIF_0F_00_XGIF_0B
#define XGIF7_XGIF_0C                    XGIF_0F_00_XGIF_0C
#define XGIF7_XGIF_0D                    XGIF_0F_00_XGIF_0D
#define XGIF7_XGIF_0E                    XGIF_0F_00_XGIF_0E
#define XGIF7_XGIF_0F                    XGIF_0F_00_XGIF_0F
#define XGIF7_XGIF_09_MASK               XGIF_0F_00_XGIF_09_MASK
#define XGIF7_XGIF_0A_MASK               XGIF_0F_00_XGIF_0A_MASK
#define XGIF7_XGIF_0B_MASK               XGIF_0F_00_XGIF_0B_MASK
#define XGIF7_XGIF_0C_MASK               XGIF_0F_00_XGIF_0C_MASK
#define XGIF7_XGIF_0D_MASK               XGIF_0F_00_XGIF_0D_MASK
#define XGIF7_XGIF_0E_MASK               XGIF_0F_00_XGIF_0E_MASK
#define XGIF7_XGIF_0F_MASK               XGIF_0F_00_XGIF_0F_MASK
#define TIM_TCNTH_BIT8                   TIM_TCNTH_TCNT8
#define TIM_TCNTH_BIT9                   TIM_TCNTH_TCNT9
#define TIM_TCNTH_BIT10                  TIM_TCNTH_TCNT10
#define TIM_TCNTH_BIT11                  TIM_TCNTH_TCNT11
#define TIM_TCNTH_BIT12                  TIM_TCNTH_TCNT12
#define TIM_TCNTH_BIT13                  TIM_TCNTH_TCNT13
#define TIM_TCNTH_BIT14                  TIM_TCNTH_TCNT14
#define TIM_TCNTH_BIT15                  TIM_TCNTH_TCNT15
#define TIM_TCNTH_BIT8_MASK              TIM_TCNTH_TCNT8_MASK
#define TIM_TCNTH_BIT9_MASK              TIM_TCNTH_TCNT9_MASK
#define TIM_TCNTH_BIT10_MASK             TIM_TCNTH_TCNT10_MASK
#define TIM_TCNTH_BIT11_MASK             TIM_TCNTH_TCNT11_MASK
#define TIM_TCNTH_BIT12_MASK             TIM_TCNTH_TCNT12_MASK
#define TIM_TCNTH_BIT13_MASK             TIM_TCNTH_TCNT13_MASK
#define TIM_TCNTH_BIT14_MASK             TIM_TCNTH_TCNT14_MASK
#define TIM_TCNTH_BIT15_MASK             TIM_TCNTH_TCNT15_MASK
#define TIM_TCNTL_BIT0                   TIM_TCNTL_TCNT0
#define TIM_TCNTL_BIT1                   TIM_TCNTL_TCNT1
#define TIM_TCNTL_BIT2                   TIM_TCNTL_TCNT2
#define TIM_TCNTL_BIT3                   TIM_TCNTL_TCNT3
#define TIM_TCNTL_BIT4                   TIM_TCNTL_TCNT4
#define TIM_TCNTL_BIT5                   TIM_TCNTL_TCNT5
#define TIM_TCNTL_BIT6                   TIM_TCNTL_TCNT6
#define TIM_TCNTL_BIT7                   TIM_TCNTL_TCNT7
#define TIM_TCNTL_BIT0_MASK              TIM_TCNTL_TCNT0_MASK
#define TIM_TCNTL_BIT1_MASK              TIM_TCNTL_TCNT1_MASK
#define TIM_TCNTL_BIT2_MASK              TIM_TCNTL_TCNT2_MASK
#define TIM_TCNTL_BIT3_MASK              TIM_TCNTL_TCNT3_MASK
#define TIM_TCNTL_BIT4_MASK              TIM_TCNTL_TCNT4_MASK
#define TIM_TCNTL_BIT5_MASK              TIM_TCNTL_TCNT5_MASK
#define TIM_TCNTL_BIT6_MASK              TIM_TCNTL_TCNT6_MASK
#define TIM_TCNTL_BIT7_MASK              TIM_TCNTL_TCNT7_MASK
#define TIM_TCNT_BIT0                    TIM_TCNT_TCNT0
#define TIM_TCNT_BIT1                    TIM_TCNT_TCNT1
#define TIM_TCNT_BIT2                    TIM_TCNT_TCNT2
#define TIM_TCNT_BIT3                    TIM_TCNT_TCNT3
#define TIM_TCNT_BIT4                    TIM_TCNT_TCNT4
#define TIM_TCNT_BIT5                    TIM_TCNT_TCNT5
#define TIM_TCNT_BIT6                    TIM_TCNT_TCNT6
#define TIM_TCNT_BIT7                    TIM_TCNT_TCNT7
#define TIM_TCNT_BIT8                    TIM_TCNT_TCNT8
#define TIM_TCNT_BIT9                    TIM_TCNT_TCNT9
#define TIM_TCNT_BIT10                   TIM_TCNT_TCNT10
#define TIM_TCNT_BIT11                   TIM_TCNT_TCNT11
#define TIM_TCNT_BIT12                   TIM_TCNT_TCNT12
#define TIM_TCNT_BIT13                   TIM_TCNT_TCNT13
#define TIM_TCNT_BIT14                   TIM_TCNT_TCNT14
#define TIM_TCNT_BIT15                   TIM_TCNT_TCNT15
#define TIM_TCNT_BIT0_MASK               TIM_TCNT_TCNT0_MASK
#define TIM_TCNT_BIT1_MASK               TIM_TCNT_TCNT1_MASK
#define TIM_TCNT_BIT2_MASK               TIM_TCNT_TCNT2_MASK
#define TIM_TCNT_BIT3_MASK               TIM_TCNT_TCNT3_MASK
#define TIM_TCNT_BIT4_MASK               TIM_TCNT_TCNT4_MASK
#define TIM_TCNT_BIT5_MASK               TIM_TCNT_TCNT5_MASK
#define TIM_TCNT_BIT6_MASK               TIM_TCNT_TCNT6_MASK
#define TIM_TCNT_BIT7_MASK               TIM_TCNT_TCNT7_MASK
#define TIM_TCNT_BIT8_MASK               TIM_TCNT_TCNT8_MASK
#define TIM_TCNT_BIT9_MASK               TIM_TCNT_TCNT9_MASK
#define TIM_TCNT_BIT10_MASK              TIM_TCNT_TCNT10_MASK
#define TIM_TCNT_BIT11_MASK              TIM_TCNT_TCNT11_MASK
#define TIM_TCNT_BIT12_MASK              TIM_TCNT_TCNT12_MASK
#define TIM_TCNT_BIT13_MASK              TIM_TCNT_TCNT13_MASK
#define TIM_TCNT_BIT14_MASK              TIM_TCNT_TCNT14_MASK
#define TIM_TCNT_BIT15_MASK              TIM_TCNT_TCNT15_MASK
#define TIM_PACNT_BIT0                   TIM_PACNT_PACNT0
#define TIM_PACNT_BIT1                   TIM_PACNT_PACNT1
#define TIM_PACNT_BIT2                   TIM_PACNT_PACNT2
#define TIM_PACNT_BIT3                   TIM_PACNT_PACNT3
#define TIM_PACNT_BIT4                   TIM_PACNT_PACNT4
#define TIM_PACNT_BIT5                   TIM_PACNT_PACNT5
#define TIM_PACNT_BIT6                   TIM_PACNT_PACNT6
#define TIM_PACNT_BIT7                   TIM_PACNT_PACNT7
#define TIM_PACNT_BIT8                   TIM_PACNT_PACNT8
#define TIM_PACNT_BIT9                   TIM_PACNT_PACNT9
#define TIM_PACNT_BIT10                  TIM_PACNT_PACNT10
#define TIM_PACNT_BIT11                  TIM_PACNT_PACNT11
#define TIM_PACNT_BIT12                  TIM_PACNT_PACNT12
#define TIM_PACNT_BIT13                  TIM_PACNT_PACNT13
#define TIM_PACNT_BIT14                  TIM_PACNT_PACNT14
#define TIM_PACNT_BIT15                  TIM_PACNT_PACNT15
#define TIM_PACNT_BIT0_MASK              TIM_PACNT_PACNT0_MASK
#define TIM_PACNT_BIT1_MASK              TIM_PACNT_PACNT1_MASK
#define TIM_PACNT_BIT2_MASK              TIM_PACNT_PACNT2_MASK
#define TIM_PACNT_BIT3_MASK              TIM_PACNT_PACNT3_MASK
#define TIM_PACNT_BIT4_MASK              TIM_PACNT_PACNT4_MASK
#define TIM_PACNT_BIT5_MASK              TIM_PACNT_PACNT5_MASK
#define TIM_PACNT_BIT6_MASK              TIM_PACNT_PACNT6_MASK
#define TIM_PACNT_BIT7_MASK              TIM_PACNT_PACNT7_MASK
#define TIM_PACNT_BIT8_MASK              TIM_PACNT_PACNT8_MASK
#define TIM_PACNT_BIT9_MASK              TIM_PACNT_PACNT9_MASK
#define TIM_PACNT_BIT10_MASK             TIM_PACNT_PACNT10_MASK
#define TIM_PACNT_BIT11_MASK             TIM_PACNT_PACNT11_MASK
#define TIM_PACNT_BIT12_MASK             TIM_PACNT_PACNT12_MASK
#define TIM_PACNT_BIT13_MASK             TIM_PACNT_PACNT13_MASK
#define TIM_PACNT_BIT14_MASK             TIM_PACNT_PACNT14_MASK
#define TIM_PACNT_BIT15_MASK             TIM_PACNT_PACNT15_MASK
#define NVFPROT_NV6                      NVFPROT_RNV6
#define NVFPROT_NV6_MASK                 NVFPROT_RNV6_MASK
#define NVFSEC_NV2                       NVFSEC_RNV2
#define NVFSEC_NV3                       NVFSEC_RNV3
#define NVFSEC_NV4                       NVFSEC_RNV4
#define NVFSEC_NV5                       NVFSEC_RNV5
#define NVFSEC_NV6                       NVFSEC_RNV6
#define NVFSEC_NV_2                      NVFSEC_RNV_2
#define NVFSEC_NV                        This_symb_has_been_depreciated
#define NVFSEC_NV2_MASK                  NVFSEC_RNV2_MASK
#define NVFSEC_NV3_MASK                  NVFSEC_RNV3_MASK
#define NVFSEC_NV4_MASK                  NVFSEC_RNV4_MASK
#define NVFSEC_NV5_MASK                  NVFSEC_RNV5_MASK
#define NVFSEC_NV6_MASK                  NVFSEC_RNV6_MASK
#define NVFSEC_NV_2_MASK                 NVFSEC_RNV_2_MASK
#define NVFSEC_NV_2_BITNUM               NVFSEC_RNV_2_BITNUM
#define PITLD4_PLD0                      This_symb_has_been_depreciated
#define PITLD4_PLD1                      This_symb_has_been_depreciated
#define PITLD4_PLD2                      This_symb_has_been_depreciated
#define PITLD4_PLD3                      This_symb_has_been_depreciated
#define PITLD4_PLD4                      This_symb_has_been_depreciated
#define PITLD4_PLD5                      This_symb_has_been_depreciated
#define PITLD4_PLD6                      This_symb_has_been_depreciated
#define PITLD4_PLD7                      This_symb_has_been_depreciated
#define PITLD4_PLD8                      This_symb_has_been_depreciated
#define PITLD4_PLD9                      This_symb_has_been_depreciated
#define PITLD4_PLD10                     This_symb_has_been_depreciated
#define PITLD4_PLD11                     This_symb_has_been_depreciated
#define PITLD4_PLD12                     This_symb_has_been_depreciated
#define PITLD4_PLD13                     This_symb_has_been_depreciated
#define PITLD4_PLD14                     This_symb_has_been_depreciated
#define PITLD4_PLD15                     This_symb_has_been_depreciated
#define PITLD4_PLD0_MASK                 This_symb_has_been_depreciated
#define PITLD4_PLD1_MASK                 This_symb_has_been_depreciated
#define PITLD4_PLD2_MASK                 This_symb_has_been_depreciated
#define PITLD4_PLD3_MASK                 This_symb_has_been_depreciated
#define PITLD4_PLD4_MASK                 This_symb_has_been_depreciated
#define PITLD4_PLD5_MASK                 This_symb_has_been_depreciated
#define PITLD4_PLD6_MASK                 This_symb_has_been_depreciated
#define PITLD4_PLD7_MASK                 This_symb_has_been_depreciated
#define PITLD4_PLD8_MASK                 This_symb_has_been_depreciated
#define PITLD4_PLD9_MASK                 This_symb_has_been_depreciated
#define PITLD4_PLD10_MASK                This_symb_has_been_depreciated
#define PITLD4_PLD11_MASK                This_symb_has_been_depreciated
#define PITLD4_PLD12_MASK                This_symb_has_been_depreciated
#define PITLD4_PLD13_MASK                This_symb_has_been_depreciated
#define PITLD4_PLD14_MASK                This_symb_has_been_depreciated
#define PITLD4_PLD15_MASK                This_symb_has_been_depreciated
#define PITCNT4_PCNT0                    This_symb_has_been_depreciated
#define PITCNT4_PCNT1                    This_symb_has_been_depreciated
#define PITCNT4_PCNT2                    This_symb_has_been_depreciated
#define PITCNT4_PCNT3                    This_symb_has_been_depreciated
#define PITCNT4_PCNT4                    This_symb_has_been_depreciated
#define PITCNT4_PCNT5                    This_symb_has_been_depreciated
#define PITCNT4_PCNT6                    This_symb_has_been_depreciated
#define PITCNT4_PCNT7                    This_symb_has_been_depreciated
#define PITCNT4_PCNT8                    This_symb_has_been_depreciated
#define PITCNT4_PCNT9                    This_symb_has_been_depreciated
#define PITCNT4_PCNT10                   This_symb_has_been_depreciated
#define PITCNT4_PCNT11                   This_symb_has_been_depreciated
#define PITCNT4_PCNT12                   This_symb_has_been_depreciated
#define PITCNT4_PCNT13                   This_symb_has_been_depreciated
#define PITCNT4_PCNT14                   This_symb_has_been_depreciated
#define PITCNT4_PCNT15                   This_symb_has_been_depreciated
#define PITCNT4_PCNT0_MASK               This_symb_has_been_depreciated
#define PITCNT4_PCNT1_MASK               This_symb_has_been_depreciated
#define PITCNT4_PCNT2_MASK               This_symb_has_been_depreciated
#define PITCNT4_PCNT3_MASK               This_symb_has_been_depreciated
#define PITCNT4_PCNT4_MASK               This_symb_has_been_depreciated
#define PITCNT4_PCNT5_MASK               This_symb_has_been_depreciated
#define PITCNT4_PCNT6_MASK               This_symb_has_been_depreciated
#define PITCNT4_PCNT7_MASK               This_symb_has_been_depreciated
#define PITCNT4_PCNT8_MASK               This_symb_has_been_depreciated
#define PITCNT4_PCNT9_MASK               This_symb_has_been_depreciated
#define PITCNT4_PCNT10_MASK              This_symb_has_been_depreciated
#define PITCNT4_PCNT11_MASK              This_symb_has_been_depreciated
#define PITCNT4_PCNT12_MASK              This_symb_has_been_depreciated
#define PITCNT4_PCNT13_MASK              This_symb_has_been_depreciated
#define PITCNT4_PCNT14_MASK              This_symb_has_been_depreciated
#define PITCNT4_PCNT15_MASK              This_symb_has_been_depreciated
#define PITLD5_PLD0                      This_symb_has_been_depreciated
#define PITLD5_PLD1                      This_symb_has_been_depreciated
#define PITLD5_PLD2                      This_symb_has_been_depreciated
#define PITLD5_PLD3                      This_symb_has_been_depreciated
#define PITLD5_PLD4                      This_symb_has_been_depreciated
#define PITLD5_PLD5                      This_symb_has_been_depreciated
#define PITLD5_PLD6                      This_symb_has_been_depreciated
#define PITLD5_PLD7                      This_symb_has_been_depreciated
#define PITLD5_PLD8                      This_symb_has_been_depreciated
#define PITLD5_PLD9                      This_symb_has_been_depreciated
#define PITLD5_PLD10                     This_symb_has_been_depreciated
#define PITLD5_PLD11                     This_symb_has_been_depreciated
#define PITLD5_PLD12                     This_symb_has_been_depreciated
#define PITLD5_PLD13                     This_symb_has_been_depreciated
#define PITLD5_PLD14                     This_symb_has_been_depreciated
#define PITLD5_PLD15                     This_symb_has_been_depreciated
#define PITLD5_PLD0_MASK                 This_symb_has_been_depreciated
#define PITLD5_PLD1_MASK                 This_symb_has_been_depreciated
#define PITLD5_PLD2_MASK                 This_symb_has_been_depreciated
#define PITLD5_PLD3_MASK                 This_symb_has_been_depreciated
#define PITLD5_PLD4_MASK                 This_symb_has_been_depreciated
#define PITLD5_PLD5_MASK                 This_symb_has_been_depreciated
#define PITLD5_PLD6_MASK                 This_symb_has_been_depreciated
#define PITLD5_PLD7_MASK                 This_symb_has_been_depreciated
#define PITLD5_PLD8_MASK                 This_symb_has_been_depreciated
#define PITLD5_PLD9_MASK                 This_symb_has_been_depreciated
#define PITLD5_PLD10_MASK                This_symb_has_been_depreciated
#define PITLD5_PLD11_MASK                This_symb_has_been_depreciated
#define PITLD5_PLD12_MASK                This_symb_has_been_depreciated
#define PITLD5_PLD13_MASK                This_symb_has_been_depreciated
#define PITLD5_PLD14_MASK                This_symb_has_been_depreciated
#define PITLD5_PLD15_MASK                This_symb_has_been_depreciated
#define PITCNT5_PCNT0                    This_symb_has_been_depreciated
#define PITCNT5_PCNT1                    This_symb_has_been_depreciated
#define PITCNT5_PCNT2                    This_symb_has_been_depreciated
#define PITCNT5_PCNT3                    This_symb_has_been_depreciated
#define PITCNT5_PCNT4                    This_symb_has_been_depreciated
#define PITCNT5_PCNT5                    This_symb_has_been_depreciated
#define PITCNT5_PCNT6                    This_symb_has_been_depreciated
#define PITCNT5_PCNT7                    This_symb_has_been_depreciated
#define PITCNT5_PCNT8                    This_symb_has_been_depreciated
#define PITCNT5_PCNT9                    This_symb_has_been_depreciated
#define PITCNT5_PCNT10                   This_symb_has_been_depreciated
#define PITCNT5_PCNT11                   This_symb_has_been_depreciated
#define PITCNT5_PCNT12                   This_symb_has_been_depreciated
#define PITCNT5_PCNT13                   This_symb_has_been_depreciated
#define PITCNT5_PCNT14                   This_symb_has_been_depreciated
#define PITCNT5_PCNT15                   This_symb_has_been_depreciated
#define PITCNT5_PCNT0_MASK               This_symb_has_been_depreciated
#define PITCNT5_PCNT1_MASK               This_symb_has_been_depreciated
#define PITCNT5_PCNT2_MASK               This_symb_has_been_depreciated
#define PITCNT5_PCNT3_MASK               This_symb_has_been_depreciated
#define PITCNT5_PCNT4_MASK               This_symb_has_been_depreciated
#define PITCNT5_PCNT5_MASK               This_symb_has_been_depreciated
#define PITCNT5_PCNT6_MASK               This_symb_has_been_depreciated
#define PITCNT5_PCNT7_MASK               This_symb_has_been_depreciated
#define PITCNT5_PCNT8_MASK               This_symb_has_been_depreciated
#define PITCNT5_PCNT9_MASK               This_symb_has_been_depreciated
#define PITCNT5_PCNT10_MASK              This_symb_has_been_depreciated
#define PITCNT5_PCNT11_MASK              This_symb_has_been_depreciated
#define PITCNT5_PCNT12_MASK              This_symb_has_been_depreciated
#define PITCNT5_PCNT13_MASK              This_symb_has_been_depreciated
#define PITCNT5_PCNT14_MASK              This_symb_has_been_depreciated
#define PITCNT5_PCNT15_MASK              This_symb_has_been_depreciated
#define PITLD6_PLD0                      This_symb_has_been_depreciated
#define PITLD6_PLD1                      This_symb_has_been_depreciated
#define PITLD6_PLD2                      This_symb_has_been_depreciated
#define PITLD6_PLD3                      This_symb_has_been_depreciated
#define PITLD6_PLD4                      This_symb_has_been_depreciated
#define PITLD6_PLD5                      This_symb_has_been_depreciated
#define PITLD6_PLD6                      This_symb_has_been_depreciated
#define PITLD6_PLD7                      This_symb_has_been_depreciated
#define PITLD6_PLD8                      This_symb_has_been_depreciated
#define PITLD6_PLD9                      This_symb_has_been_depreciated
#define PITLD6_PLD10                     This_symb_has_been_depreciated
#define PITLD6_PLD11                     This_symb_has_been_depreciated
#define PITLD6_PLD12                     This_symb_has_been_depreciated
#define PITLD6_PLD13                     This_symb_has_been_depreciated
#define PITLD6_PLD14                     This_symb_has_been_depreciated
#define PITLD6_PLD15                     This_symb_has_been_depreciated
#define PITLD6_PLD0_MASK                 This_symb_has_been_depreciated
#define PITLD6_PLD1_MASK                 This_symb_has_been_depreciated
#define PITLD6_PLD2_MASK                 This_symb_has_been_depreciated
#define PITLD6_PLD3_MASK                 This_symb_has_been_depreciated
#define PITLD6_PLD4_MASK                 This_symb_has_been_depreciated
#define PITLD6_PLD5_MASK                 This_symb_has_been_depreciated
#define PITLD6_PLD6_MASK                 This_symb_has_been_depreciated
#define PITLD6_PLD7_MASK                 This_symb_has_been_depreciated
#define PITLD6_PLD8_MASK                 This_symb_has_been_depreciated
#define PITLD6_PLD9_MASK                 This_symb_has_been_depreciated
#define PITLD6_PLD10_MASK                This_symb_has_been_depreciated
#define PITLD6_PLD11_MASK                This_symb_has_been_depreciated
#define PITLD6_PLD12_MASK                This_symb_has_been_depreciated
#define PITLD6_PLD13_MASK                This_symb_has_been_depreciated
#define PITLD6_PLD14_MASK                This_symb_has_been_depreciated
#define PITLD6_PLD15_MASK                This_symb_has_been_depreciated
#define PITCNT6_PCNT0                    This_symb_has_been_depreciated
#define PITCNT6_PCNT1                    This_symb_has_been_depreciated
#define PITCNT6_PCNT2                    This_symb_has_been_depreciated
#define PITCNT6_PCNT3                    This_symb_has_been_depreciated
#define PITCNT6_PCNT4                    This_symb_has_been_depreciated
#define PITCNT6_PCNT5                    This_symb_has_been_depreciated
#define PITCNT6_PCNT6                    This_symb_has_been_depreciated
#define PITCNT6_PCNT7                    This_symb_has_been_depreciated
#define PITCNT6_PCNT8                    This_symb_has_been_depreciated
#define PITCNT6_PCNT9                    This_symb_has_been_depreciated
#define PITCNT6_PCNT10                   This_symb_has_been_depreciated
#define PITCNT6_PCNT11                   This_symb_has_been_depreciated
#define PITCNT6_PCNT12                   This_symb_has_been_depreciated
#define PITCNT6_PCNT13                   This_symb_has_been_depreciated
#define PITCNT6_PCNT14                   This_symb_has_been_depreciated
#define PITCNT6_PCNT15                   This_symb_has_been_depreciated
#define PITCNT6_PCNT0_MASK               This_symb_has_been_depreciated
#define PITCNT6_PCNT1_MASK               This_symb_has_been_depreciated
#define PITCNT6_PCNT2_MASK               This_symb_has_been_depreciated
#define PITCNT6_PCNT3_MASK               This_symb_has_been_depreciated
#define PITCNT6_PCNT4_MASK               This_symb_has_been_depreciated
#define PITCNT6_PCNT5_MASK               This_symb_has_been_depreciated
#define PITCNT6_PCNT6_MASK               This_symb_has_been_depreciated
#define PITCNT6_PCNT7_MASK               This_symb_has_been_depreciated
#define PITCNT6_PCNT8_MASK               This_symb_has_been_depreciated
#define PITCNT6_PCNT9_MASK               This_symb_has_been_depreciated
#define PITCNT6_PCNT10_MASK              This_symb_has_been_depreciated
#define PITCNT6_PCNT11_MASK              This_symb_has_been_depreciated
#define PITCNT6_PCNT12_MASK              This_symb_has_been_depreciated
#define PITCNT6_PCNT13_MASK              This_symb_has_been_depreciated
#define PITCNT6_PCNT14_MASK              This_symb_has_been_depreciated
#define PITCNT6_PCNT15_MASK              This_symb_has_been_depreciated
#define PITLD7_PLD0                      This_symb_has_been_depreciated
