frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
#define CAN1TDSR2_DB3                    CAN1TXDSR2_DB3
#define CAN1TDSR2_DB4                    CAN1TXDSR2_DB4
#define CAN1TDSR2_DB5                    CAN1TXDSR2_DB5
#define CAN1TDSR2_DB6                    CAN1TXDSR2_DB6
#define CAN1TDSR2_DB7                    CAN1TXDSR2_DB7
#define CAN1TDSR2_DB0_MASK               CAN1TXDSR2_DB0_MASK
#define CAN1TDSR2_DB1_MASK               CAN1TXDSR2_DB1_MASK
#define CAN1TDSR2_DB2_MASK               CAN1TXDSR2_DB2_MASK
#define CAN1TDSR2_DB3_MASK               CAN1TXDSR2_DB3_MASK
#define CAN1TDSR2_DB4_MASK               CAN1TXDSR2_DB4_MASK
#define CAN1TDSR2_DB5_MASK               CAN1TXDSR2_DB5_MASK
#define CAN1TDSR2_DB6_MASK               CAN1TXDSR2_DB6_MASK
#define CAN1TDSR2_DB7_MASK               CAN1TXDSR2_DB7_MASK
#define CAN1TDSR3                        CAN1TXDSR3
#define CAN1TDSR3_DB0                    CAN1TXDSR3_DB0
#define CAN1TDSR3_DB1                    CAN1TXDSR3_DB1
#define CAN1TDSR3_DB2                    CAN1TXDSR3_DB2
#define CAN1TDSR3_DB3                    CAN1TXDSR3_DB3
#define CAN1TDSR3_DB4                    CAN1TXDSR3_DB4
#define CAN1TDSR3_DB5                    CAN1TXDSR3_DB5
#define CAN1TDSR3_DB6                    CAN1TXDSR3_DB6
#define CAN1TDSR3_DB7                    CAN1TXDSR3_DB7
#define CAN1TDSR3_DB0_MASK               CAN1TXDSR3_DB0_MASK
#define CAN1TDSR3_DB1_MASK               CAN1TXDSR3_DB1_MASK
#define CAN1TDSR3_DB2_MASK               CAN1TXDSR3_DB2_MASK
#define CAN1TDSR3_DB3_MASK               CAN1TXDSR3_DB3_MASK
#define CAN1TDSR3_DB4_MASK               CAN1TXDSR3_DB4_MASK
#define CAN1TDSR3_DB5_MASK               CAN1TXDSR3_DB5_MASK
#define CAN1TDSR3_DB6_MASK               CAN1TXDSR3_DB6_MASK
#define CAN1TDSR3_DB7_MASK               CAN1TXDSR3_DB7_MASK
#define CAN1TDSR4                        CAN1TXDSR4
#define CAN1TDSR4_DB0                    CAN1TXDSR4_DB0
#define CAN1TDSR4_DB1                    CAN1TXDSR4_DB1
#define CAN1TDSR4_DB2                    CAN1TXDSR4_DB2
#define CAN1TDSR4_DB3                    CAN1TXDSR4_DB3
#define CAN1TDSR4_DB4                    CAN1TXDSR4_DB4
#define CAN1TDSR4_DB5                    CAN1TXDSR4_DB5
#define CAN1TDSR4_DB6                    CAN1TXDSR4_DB6
#define CAN1TDSR4_DB7                    CAN1TXDSR4_DB7
#define CAN1TDSR4_DB0_MASK               CAN1TXDSR4_DB0_MASK
#define CAN1TDSR4_DB1_MASK               CAN1TXDSR4_DB1_MASK
#define CAN1TDSR4_DB2_MASK               CAN1TXDSR4_DB2_MASK
#define CAN1TDSR4_DB3_MASK               CAN1TXDSR4_DB3_MASK
#define CAN1TDSR4_DB4_MASK               CAN1TXDSR4_DB4_MASK
#define CAN1TDSR4_DB5_MASK               CAN1TXDSR4_DB5_MASK
#define CAN1TDSR4_DB6_MASK               CAN1TXDSR4_DB6_MASK
#define CAN1TDSR4_DB7_MASK               CAN1TXDSR4_DB7_MASK
#define CAN1TDSR5                        CAN1TXDSR5
#define CAN1TDSR5_DB0                    CAN1TXDSR5_DB0
#define CAN1TDSR5_DB1                    CAN1TXDSR5_DB1
#define CAN1TDSR5_DB2                    CAN1TXDSR5_DB2
#define CAN1TDSR5_DB3                    CAN1TXDSR5_DB3
#define CAN1TDSR5_DB4                    CAN1TXDSR5_DB4
#define CAN1TDSR5_DB5                    CAN1TXDSR5_DB5
#define CAN1TDSR5_DB6                    CAN1TXDSR5_DB6
#define CAN1TDSR5_DB7                    CAN1TXDSR5_DB7
#define CAN1TDSR5_DB0_MASK               CAN1TXDSR5_DB0_MASK
#define CAN1TDSR5_DB1_MASK               CAN1TXDSR5_DB1_MASK
#define CAN1TDSR5_DB2_MASK               CAN1TXDSR5_DB2_MASK
#define CAN1TDSR5_DB3_MASK               CAN1TXDSR5_DB3_MASK
#define CAN1TDSR5_DB4_MASK               CAN1TXDSR5_DB4_MASK
#define CAN1TDSR5_DB5_MASK               CAN1TXDSR5_DB5_MASK
#define CAN1TDSR5_DB6_MASK               CAN1TXDSR5_DB6_MASK
#define CAN1TDSR5_DB7_MASK               CAN1TXDSR5_DB7_MASK
#define CAN1TDSR6                        CAN1TXDSR6
#define CAN1TDSR6_DB0                    CAN1TXDSR6_DB0
#define CAN1TDSR6_DB1                    CAN1TXDSR6_DB1
#define CAN1TDSR6_DB2                    CAN1TXDSR6_DB2
#define CAN1TDSR6_DB3                    CAN1TXDSR6_DB3
#define CAN1TDSR6_DB4                    CAN1TXDSR6_DB4
#define CAN1TDSR6_DB5                    CAN1TXDSR6_DB5
#define CAN1TDSR6_DB6                    CAN1TXDSR6_DB6
#define CAN1TDSR6_DB7                    CAN1TXDSR6_DB7
#define CAN1TDSR6_DB0_MASK               CAN1TXDSR6_DB0_MASK
#define CAN1TDSR6_DB1_MASK               CAN1TXDSR6_DB1_MASK
#define CAN1TDSR6_DB2_MASK               CAN1TXDSR6_DB2_MASK
#define CAN1TDSR6_DB3_MASK               CAN1TXDSR6_DB3_MASK
#define CAN1TDSR6_DB4_MASK               CAN1TXDSR6_DB4_MASK
#define CAN1TDSR6_DB5_MASK               CAN1TXDSR6_DB5_MASK
#define CAN1TDSR6_DB6_MASK               CAN1TXDSR6_DB6_MASK
#define CAN1TDSR6_DB7_MASK               CAN1TXDSR6_DB7_MASK
#define CAN1TDSR7                        CAN1TXDSR7
#define CAN1TDSR7_DB0                    CAN1TXDSR7_DB0
#define CAN1TDSR7_DB1                    CAN1TXDSR7_DB1
#define CAN1TDSR7_DB2                    CAN1TXDSR7_DB2
#define CAN1TDSR7_DB3                    CAN1TXDSR7_DB3
#define CAN1TDSR7_DB4                    CAN1TXDSR7_DB4
#define CAN1TDSR7_DB5                    CAN1TXDSR7_DB5
#define CAN1TDSR7_DB6                    CAN1TXDSR7_DB6
#define CAN1TDSR7_DB7                    CAN1TXDSR7_DB7
#define CAN1TDSR7_DB0_MASK               CAN1TXDSR7_DB0_MASK
#define CAN1TDSR7_DB1_MASK               CAN1TXDSR7_DB1_MASK
#define CAN1TDSR7_DB2_MASK               CAN1TXDSR7_DB2_MASK
#define CAN1TDSR7_DB3_MASK               CAN1TXDSR7_DB3_MASK
#define CAN1TDSR7_DB4_MASK               CAN1TXDSR7_DB4_MASK
#define CAN1TDSR7_DB5_MASK               CAN1TXDSR7_DB5_MASK
#define CAN1TDSR7_DB6_MASK               CAN1TXDSR7_DB6_MASK
#define CAN1TDSR7_DB7_MASK               CAN1TXDSR7_DB7_MASK
#define CAN1TDLR                         CAN1TXDLR
#define CAN1TDLR_DLC0                    CAN1TXDLR_DLC0
#define CAN1TDLR_DLC1                    CAN1TXDLR_DLC1
#define CAN1TDLR_DLC2                    CAN1TXDLR_DLC2
#define CAN1TDLR_DLC3                    CAN1TXDLR_DLC3
#define CAN1TDLR_DLC                     CAN1TXDLR_DLC
#define CAN1TDLR_DLC0_MASK               CAN1TXDLR_DLC0_MASK
#define CAN1TDLR_DLC1_MASK               CAN1TXDLR_DLC1_MASK
#define CAN1TDLR_DLC2_MASK               CAN1TXDLR_DLC2_MASK
#define CAN1TDLR_DLC3_MASK               CAN1TXDLR_DLC3_MASK
#define CAN1TDLR_DLC_MASK                CAN1TXDLR_DLC_MASK
#define CAN1TDLR_DLC_BITNUM              CAN1TXDLR_DLC_BITNUM
#define CAN1TTBPR                        CAN1TXTBPR
#define CAN1TTBPR_PRIO0                  CAN1TXTBPR_PRIO0
#define CAN1TTBPR_PRIO1                  CAN1TXTBPR_PRIO1
#define CAN1TTBPR_PRIO2                  CAN1TXTBPR_PRIO2
#define CAN1TTBPR_PRIO3                  CAN1TXTBPR_PRIO3
#define CAN1TTBPR_PRIO4                  CAN1TXTBPR_PRIO4
#define CAN1TTBPR_PRIO5                  CAN1TXTBPR_PRIO5
#define CAN1TTBPR_PRIO6                  CAN1TXTBPR_PRIO6
#define CAN1TTBPR_PRIO7                  CAN1TXTBPR_PRIO7
#define CAN1TTBPR_PRIO0_MASK             CAN1TXTBPR_PRIO0_MASK
#define CAN1TTBPR_PRIO1_MASK             CAN1TXTBPR_PRIO1_MASK
#define CAN1TTBPR_PRIO2_MASK             CAN1TXTBPR_PRIO2_MASK
#define CAN1TTBPR_PRIO3_MASK             CAN1TXTBPR_PRIO3_MASK
#define CAN1TTBPR_PRIO4_MASK             CAN1TXTBPR_PRIO4_MASK
#define CAN1TTBPR_PRIO5_MASK             CAN1TXTBPR_PRIO5_MASK
#define CAN1TTBPR_PRIO6_MASK             CAN1TXTBPR_PRIO6_MASK
#define CAN1TTBPR_PRIO7_MASK             CAN1TXTBPR_PRIO7_MASK
#define CAN1TTSRH                        CAN1TXTSRH
#define CAN1TTSRH_TSR8                   CAN1TXTSRH_TSR8
#define CAN1TTSRH_TSR9                   CAN1TXTSRH_TSR9
#define CAN1TTSRH_TSR10                  CAN1TXTSRH_TSR10
#define CAN1TTSRH_TSR11                  CAN1TXTSRH_TSR11
#define CAN1TTSRH_TSR12                  CAN1TXTSRH_TSR12
#define CAN1TTSRH_TSR13                  CAN1TXTSRH_TSR13
#define CAN1TTSRH_TSR14                  CAN1TXTSRH_TSR14
#define CAN1TTSRH_TSR15                  CAN1TXTSRH_TSR15
#define CAN1TTSRH_TSR8_MASK              CAN1TXTSRH_TSR8_MASK
#define CAN1TTSRH_TSR9_MASK              CAN1TXTSRH_TSR9_MASK
#define CAN1TTSRH_TSR10_MASK             CAN1TXTSRH_TSR10_MASK
#define CAN1TTSRH_TSR11_MASK             CAN1TXTSRH_TSR11_MASK
#define CAN1TTSRH_TSR12_MASK             CAN1TXTSRH_TSR12_MASK
#define CAN1TTSRH_TSR13_MASK             CAN1TXTSRH_TSR13_MASK
#define CAN1TTSRH_TSR14_MASK             CAN1TXTSRH_TSR14_MASK
#define CAN1TTSRH_TSR15_MASK             CAN1TXTSRH_TSR15_MASK
#define CAN1TTSRL                        CAN1TXTSRL
#define CAN1TTSRL_TSR0                   CAN1TXTSRL_TSR0
#define CAN1TTSRL_TSR1                   CAN1TXTSRL_TSR1
#define CAN1TTSRL_TSR2                   CAN1TXTSRL_TSR2
#define CAN1TTSRL_TSR3                   CAN1TXTSRL_TSR3
#define CAN1TTSRL_TSR4                   CAN1TXTSRL_TSR4
#define CAN1TTSRL_TSR5                   CAN1TXTSRL_TSR5
#define CAN1TTSRL_TSR6                   CAN1TXTSRL_TSR6
#define CAN1TTSRL_TSR7                   CAN1TXTSRL_TSR7
#define CAN1TTSRL_TSR0_MASK              CAN1TXTSRL_TSR0_MASK
#define CAN1TTSRL_TSR1_MASK              CAN1TXTSRL_TSR1_MASK
#define CAN1TTSRL_TSR2_MASK              CAN1TXTSRL_TSR2_MASK
#define CAN1TTSRL_TSR3_MASK              CAN1TXTSRL_TSR3_MASK
#define CAN1TTSRL_TSR4_MASK              CAN1TXTSRL_TSR4_MASK
#define CAN1TTSRL_TSR5_MASK              CAN1TXTSRL_TSR5_MASK
#define CAN1TTSRL_TSR6_MASK              CAN1TXTSRL_TSR6_MASK
#define CAN1TTSRL_TSR7_MASK              CAN1TXTSRL_TSR7_MASK
#define CAN1TTSR                         CAN1TXTSR
#define CAN1TTSR_TSR0                    CAN1TXTSR_TSR0
#define CAN1TTSR_TSR1                    CAN1TXTSR_TSR1
#define CAN1TTSR_TSR2                    CAN1TXTSR_TSR2
#define CAN1TTSR_TSR3                    CAN1TXTSR_TSR3
#define CAN1TTSR_TSR4                    CAN1TXTSR_TSR4
#define CAN1TTSR_TSR5                    CAN1TXTSR_TSR5
#define CAN1TTSR_TSR6                    CAN1TXTSR_TSR6
#define CAN1TTSR_TSR7                    CAN1TXTSR_TSR7
#define CAN1TTSR_TSR8                    CAN1TXTSR_TSR8
#define CAN1TTSR_TSR9                    CAN1TXTSR_TSR9
#define CAN1TTSR_TSR10                   CAN1TXTSR_TSR10
#define CAN1TTSR_TSR11                   CAN1TXTSR_TSR11
#define CAN1TTSR_TSR12                   CAN1TXTSR_TSR12
#define CAN1TTSR_TSR13                   CAN1TXTSR_TSR13
#define CAN1TTSR_TSR14                   CAN1TXTSR_TSR14
#define CAN1TTSR_TSR15                   CAN1TXTSR_TSR15
#define CAN1TTSR_TSR0_MASK               CAN1TXTSR_TSR0_MASK
#define CAN1TTSR_TSR1_MASK               CAN1TXTSR_TSR1_MASK
#define CAN1TTSR_TSR2_MASK               CAN1TXTSR_TSR2_MASK
#define CAN1TTSR_TSR3_MASK               CAN1TXTSR_TSR3_MASK
#define CAN1TTSR_TSR4_MASK               CAN1TXTSR_TSR4_MASK
#define CAN1TTSR_TSR5_MASK               CAN1TXTSR_TSR5_MASK
#define CAN1TTSR_TSR6_MASK               CAN1TXTSR_TSR6_MASK
#define CAN1TTSR_TSR7_MASK               CAN1TXTSR_TSR7_MASK
#define CAN1TTSR_TSR8_MASK               CAN1TXTSR_TSR8_MASK
#define CAN1TTSR_TSR9_MASK               CAN1TXTSR_TSR9_MASK
#define CAN1TTSR_TSR10_MASK              CAN1TXTSR_TSR10_MASK
#define CAN1TTSR_TSR11_MASK              CAN1TXTSR_TSR11_MASK
#define CAN1TTSR_TSR12_MASK              CAN1TXTSR_TSR12_MASK
#define CAN1TTSR_TSR13_MASK              CAN1TXTSR_TSR13_MASK
#define CAN1TTSR_TSR14_MASK              CAN1TXTSR_TSR14_MASK
#define CAN1TTSR_TSR15_MASK              CAN1TXTSR_TSR15_MASK
#define CAN2RIDR0                        CAN2RXIDR0
#define CAN2RIDR0_ID21                   CAN2RXIDR0_ID21
#define CAN2RIDR0_ID22                   CAN2RXIDR0_ID22
#define CAN2RIDR0_ID23                   CAN2RXIDR0_ID23
#define CAN2RIDR0_ID24                   CAN2RXIDR0_ID24
#define CAN2RIDR0_ID25                   CAN2RXIDR0_ID25
#define CAN2RIDR0_ID26                   CAN2RXIDR0_ID26
#define CAN2RIDR0_ID27                   CAN2RXIDR0_ID27
#define CAN2RIDR0_ID28                   CAN2RXIDR0_ID28
#define CAN2RIDR_ARR                     CAN2RXIDR_ARR
#define CAN2RIDR0_ID21_MASK              CAN2RXIDR0_ID21_MASK
#define CAN2RIDR0_ID22_MASK              CAN2RXIDR0_ID22_MASK
#define CAN2RIDR0_ID23_MASK              CAN2RXIDR0_ID23_MASK
#define CAN2RIDR0_ID24_MASK              CAN2RXIDR0_ID24_MASK
#define CAN2RIDR0_ID25_MASK              CAN2RXIDR0_ID25_MASK
#define CAN2RIDR0_ID26_MASK              CAN2RXIDR0_ID26_MASK
#define CAN2RIDR0_ID27_MASK              CAN2RXIDR0_ID27_MASK
#define CAN2RIDR0_ID28_MASK              CAN2RXIDR0_ID28_MASK
#define CAN2RIDR1                        CAN2RXIDR1
#define CAN2RIDR1_ID15                   CAN2RXIDR1_ID15
#define CAN2RIDR1_ID16                   CAN2RXIDR1_ID16
#define CAN2RIDR1_ID17                   CAN2RXIDR1_ID17
#define CAN2RIDR1_IDE                    CAN2RXIDR1_IDE
#define CAN2RIDR1_SRR                    CAN2RXIDR1_SRR
#define CAN2RIDR1_ID18                   CAN2RXIDR1_ID18
#define CAN2RIDR1_ID19                   CAN2RXIDR1_ID19
#define CAN2RIDR1_ID20                   CAN2RXIDR1_ID20
#define CAN2RIDR1_ID_15                  CAN2RXIDR1_ID_15
#define CAN2RIDR1_ID_18                  CAN2RXIDR1_ID_18
#define CAN2RIDR1_ID                     CAN2RXIDR1_ID
#define CAN2RIDR1_ID15_MASK              CAN2RXIDR1_ID15_MASK
#define CAN2RIDR1_ID16_MASK              CAN2RXIDR1_ID16_MASK
#define CAN2RIDR1_ID17_MASK              CAN2RXIDR1_ID17_MASK
#define CAN2RIDR1_IDE_MASK               CAN2RXIDR1_IDE_MASK
#define CAN2RIDR1_SRR_MASK               CAN2RXIDR1_SRR_MASK
#define CAN2RIDR1_ID18_MASK              CAN2RXIDR1_ID18_MASK
#define CAN2RIDR1_ID19_MASK              CAN2RXIDR1_ID19_MASK
#define CAN2RIDR1_ID20_MASK              CAN2RXIDR1_ID20_MASK
#define CAN2RIDR1_ID_15_MASK             CAN2RXIDR1_ID_15_MASK
#define CAN2RIDR1_ID_15_BITNUM           CAN2RXIDR1_ID_15_BITNUM
#define CAN2RIDR1_ID_18_MASK             CAN2RXIDR1_ID_18_MASK
#define CAN2RIDR1_ID_18_BITNUM           CAN2RXIDR1_ID_18_BITNUM
#define CAN2RIDR2                        CAN2RXIDR2
#define CAN2RIDR2_ID7                    CAN2RXIDR2_ID7
#define CAN2RIDR2_ID8                    CAN2RXIDR2_ID8
#define CAN2RIDR2_ID9                    CAN2RXIDR2_ID9
#define CAN2RIDR2_ID10                   CAN2RXIDR2_ID10
#define CAN2RIDR2_ID11                   CAN2RXIDR2_ID11
#define CAN2RIDR2_ID12                   CAN2RXIDR2_ID12
#define CAN2RIDR2_ID13                   CAN2RXIDR2_ID13
#define CAN2RIDR2_ID14                   CAN2RXIDR2_ID14
#define CAN2RIDR2_ID7_MASK               CAN2RXIDR2_ID7_MASK
#define CAN2RIDR2_ID8_MASK               CAN2RXIDR2_ID8_MASK
#define CAN2RIDR2_ID9_MASK               CAN2RXIDR2_ID9_MASK
#define CAN2RIDR2_ID10_MASK              CAN2RXIDR2_ID10_MASK
#define CAN2RIDR2_ID11_MASK              CAN2RXIDR2_ID11_MASK
#define CAN2RIDR2_ID12_MASK              CAN2RXIDR2_ID12_MASK
#define CAN2RIDR2_ID13_MASK              CAN2RXIDR2_ID13_MASK
#define CAN2RIDR2_ID14_MASK              CAN2RXIDR2_ID14_MASK
#define CAN2RIDR3                        CAN2RXIDR3
#define CAN2RIDR3_RTR                    CAN2RXIDR3_RTR
#define CAN2RIDR3_ID0                    CAN2RXIDR3_ID0
#define CAN2RIDR3_ID1                    CAN2RXIDR3_ID1
#define CAN2RIDR3_ID2                    CAN2RXIDR3_ID2
#define CAN2RIDR3_ID3                    CAN2RXIDR3_ID3
#define CAN2RIDR3_ID4                    CAN2RXIDR3_ID4
#define CAN2RIDR3_ID5                    CAN2RXIDR3_ID5
#define CAN2RIDR3_ID6                    CAN2RXIDR3_ID6
#define CAN2RIDR3_ID                     CAN2RXIDR3_ID
#define CAN2RIDR3_RTR_MASK               CAN2RXIDR3_RTR_MASK
#define CAN2RIDR3_ID0_MASK               CAN2RXIDR3_ID0_MASK
#define CAN2RIDR3_ID1_MASK               CAN2RXIDR3_ID1_MASK
#define CAN2RIDR3_ID2_MASK               CAN2RXIDR3_ID2_MASK
#define CAN2RIDR3_ID3_MASK               CAN2RXIDR3_ID3_MASK
#define CAN2RIDR3_ID4_MASK               CAN2RXIDR3_ID4_MASK
#define CAN2RIDR3_ID5_MASK               CAN2RXIDR3_ID5_MASK
#define CAN2RIDR3_ID6_MASK               CAN2RXIDR3_ID6_MASK
#define CAN2RIDR3_ID_MASK                CAN2RXIDR3_ID_MASK
#define CAN2RIDR3_ID_BITNUM              CAN2RXIDR3_ID_BITNUM
#define CAN2RDSR0                        CAN2RXDSR0
#define CAN2RDSR0_DB0                    CAN2RXDSR0_DB0
#define CAN2RDSR0_DB1                    CAN2RXDSR0_DB1
#define CAN2RDSR0_DB2                    CAN2RXDSR0_DB2
#define CAN2RDSR0_DB3                    CAN2RXDSR0_DB3
#define CAN2RDSR0_DB4                    CAN2RXDSR0_DB4
#define CAN2RDSR0_DB5                    CAN2RXDSR0_DB5
#define CAN2RDSR0_DB6                    CAN2RXDSR0_DB6
#define CAN2RDSR0_DB7                    CAN2RXDSR0_DB7
#define CAN2RDSR_ARR                     CAN2RXDSR_ARR
#define CAN2RDSR0_DB0_MASK               CAN2RXDSR0_DB0_MASK
#define CAN2RDSR0_DB1_MASK               CAN2RXDSR0_DB1_MASK
#define CAN2RDSR0_DB2_MASK               CAN2RXDSR0_DB2_MASK
#define CAN2RDSR0_DB3_MASK               CAN2RXDSR0_DB3_MASK
#define CAN2RDSR0_DB4_MASK               CAN2RXDSR0_DB4_MASK
#define CAN2RDSR0_DB5_MASK               CAN2RXDSR0_DB5_MASK
#define CAN2RDSR0_DB6_MASK               CAN2RXDSR0_DB6_MASK
#define CAN2RDSR0_DB7_MASK               CAN2RXDSR0_DB7_MASK
#define CAN2RDSR1                        CAN2RXDSR1
#define CAN2RDSR1_DB0                    CAN2RXDSR1_DB0
#define CAN2RDSR1_DB1                    CAN2RXDSR1_DB1
#define CAN2RDSR1_DB2                    CAN2RXDSR1_DB2
#define CAN2RDSR1_DB3                    CAN2RXDSR1_DB3
#define CAN2RDSR1_DB4                    CAN2RXDSR1_DB4
#define CAN2RDSR1_DB5                    CAN2RXDSR1_DB5
#define CAN2RDSR1_DB6                    CAN2RXDSR1_DB6
#define CAN2RDSR1_DB7                    CAN2RXDSR1_DB7
#define CAN2RDSR1_DB0_MASK               CAN2RXDSR1_DB0_MASK
#define CAN2RDSR1_DB1_MASK               CAN2RXDSR1_DB1_MASK
#define CAN2RDSR1_DB2_MASK               CAN2RXDSR1_DB2_MASK
#define CAN2RDSR1_DB3_MASK               CAN2RXDSR1_DB3_MASK
#define CAN2RDSR1_DB4_MASK               CAN2RXDSR1_DB4_MASK
#define CAN2RDSR1_DB5_MASK               CAN2RXDSR1_DB5_MASK
#define CAN2RDSR1_DB6_MASK               CAN2RXDSR1_DB6_MASK
#define CAN2RDSR1_DB7_MASK               CAN2RXDSR1_DB7_MASK
#define CAN2RDSR2                        CAN2RXDSR2
#define CAN2RDSR2_DB0                    CAN2RXDSR2_DB0
#define CAN2RDSR2_DB1                    CAN2RXDSR2_DB1
#define CAN2RDSR2_DB2                    CAN2RXDSR2_DB2
#define CAN2RDSR2_DB3                    CAN2RXDSR2_DB3
#define CAN2RDSR2_DB4                    CAN2RXDSR2_DB4
#define CAN2RDSR2_DB5                    CAN2RXDSR2_DB5
#define CAN2RDSR2_DB6                    CAN2RXDSR2_DB6
#define CAN2RDSR2_DB7                    CAN2RXDSR2_DB7
#define CAN2RDSR2_DB0_MASK               CAN2RXDSR2_DB0_MASK
#define CAN2RDSR2_DB1_MASK               CAN2RXDSR2_DB1_MASK
#define CAN2RDSR2_DB2_MASK               CAN2RXDSR2_DB2_MASK
#define CAN2RDSR2_DB3_MASK               CAN2RXDSR2_DB3_MASK
#define CAN2RDSR2_DB4_MASK               CAN2RXDSR2_DB4_MASK
#define CAN2RDSR2_DB5_MASK               CAN2RXDSR2_DB5_MASK
#define CAN2RDSR2_DB6_MASK               CAN2RXDSR2_DB6_MASK
#define CAN2RDSR2_DB7_MASK               CAN2RXDSR2_DB7_MASK
#define CAN2RDSR3                        CAN2RXDSR3
#define CAN2RDSR3_DB0                    CAN2RXDSR3_DB0
#define CAN2RDSR3_DB1                    CAN2RXDSR3_DB1
#define CAN2RDSR3_DB2                    CAN2RXDSR3_DB2
#define CAN2RDSR3_DB3                    CAN2RXDSR3_DB3
#define CAN2RDSR3_DB4                    CAN2RXDSR3_DB4
#define CAN2RDSR3_DB5                    CAN2RXDSR3_DB5
#define CAN2RDSR3_DB6                    CAN2RXDSR3_DB6
#define CAN2RDSR3_DB7                    CAN2RXDSR3_DB7
#define CAN2RDSR3_DB0_MASK               CAN2RXDSR3_DB0_MASK
#define CAN2RDSR3_DB1_MASK               CAN2RXDSR3_DB1_MASK
#define CAN2RDSR3_DB2_MASK               CAN2RXDSR3_DB2_MASK
#define CAN2RDSR3_DB3_MASK               CAN2RXDSR3_DB3_MASK
#define CAN2RDSR3_DB4_MASK               CAN2RXDSR3_DB4_MASK
#define CAN2RDSR3_DB5_MASK               CAN2RXDSR3_DB5_MASK
#define CAN2RDSR3_DB6_MASK               CAN2RXDSR3_DB6_MASK
#define CAN2RDSR3_DB7_MASK               CAN2RXDSR3_DB7_MASK
#define CAN2RDSR4                        CAN2RXDSR4
#define CAN2RDSR4_DB0                    CAN2RXDSR4_DB0
#define CAN2RDSR4_DB1                    CAN2RXDSR4_DB1
#define CAN2RDSR4_DB2                    CAN2RXDSR4_DB2
#define CAN2RDSR4_DB3                    CAN2RXDSR4_DB3
#define CAN2RDSR4_DB4                    CAN2RXDSR4_DB4
#define CAN2RDSR4_DB5                    CAN2RXDSR4_DB5
#define CAN2RDSR4_DB6                    CAN2RXDSR4_DB6
#define CAN2RDSR4_DB7                    CAN2RXDSR4_DB7
#define CAN2RDSR4_DB0_MASK               CAN2RXDSR4_DB0_MASK
#define CAN2RDSR4_DB1_MASK               CAN2RXDSR4_DB1_MASK
#define CAN2RDSR4_DB2_MASK               CAN2RXDSR4_DB2_MASK
#define CAN2RDSR4_DB3_MASK               CAN2RXDSR4_DB3_MASK
#define CAN2RDSR4_DB4_MASK               CAN2RXDSR4_DB4_MASK
#define CAN2RDSR4_DB5_MASK               CAN2RXDSR4_DB5_MASK
#define CAN2RDSR4_DB6_MASK               CAN2RXDSR4_DB6_MASK
#define CAN2RDSR4_DB7_MASK               CAN2RXDSR4_DB7_MASK
#define CAN2RDSR5                        CAN2RXDSR5
#define CAN2RDSR5_DB0                    CAN2RXDSR5_DB0
#define CAN2RDSR5_DB1                    CAN2RXDSR5_DB1
#define CAN2RDSR5_DB2                    CAN2RXDSR5_DB2
#define CAN2RDSR5_DB3                    CAN2RXDSR5_DB3
#define CAN2RDSR5_DB4                    CAN2RXDSR5_DB4
#define CAN2RDSR5_DB5                    CAN2RXDSR5_DB5
#define CAN2RDSR5_DB6                    CAN2RXDSR5_DB6
#define CAN2RDSR5_DB7                    CAN2RXDSR5_DB7
#define CAN2RDSR5_DB0_MASK               CAN2RXDSR5_DB0_MASK
#define CAN2RDSR5_DB1_MASK               CAN2RXDSR5_DB1_MASK
#define CAN2RDSR5_DB2_MASK               CAN2RXDSR5_DB2_MASK
#define CAN2RDSR5_DB3_MASK               CAN2RXDSR5_DB3_MASK
#define CAN2RDSR5_DB4_MASK               CAN2RXDSR5_DB4_MASK
#define CAN2RDSR5_DB5_MASK               CAN2RXDSR5_DB5_MASK
#define CAN2RDSR5_DB6_MASK               CAN2RXDSR5_DB6_MASK
#define CAN2RDSR5_DB7_MASK               CAN2RXDSR5_DB7_MASK
#define CAN2RDSR6                        CAN2RXDSR6
#define CAN2RDSR6_DB0                    CAN2RXDSR6_DB0
#define CAN2RDSR6_DB1                    CAN2RXDSR6_DB1
#define CAN2RDSR6_DB2                    CAN2RXDSR6_DB2
#define CAN2RDSR6_DB3                    CAN2RXDSR6_DB3
#define CAN2RDSR6_DB4                    CAN2RXDSR6_DB4
#define CAN2RDSR6_DB5                    CAN2RXDSR6_DB5
#define CAN2RDSR6_DB6                    CAN2RXDSR6_DB6
#define CAN2RDSR6_DB7                    CAN2RXDSR6_DB7
#define CAN2RDSR6_DB0_MASK               CAN2RXDSR6_DB0_MASK
#define CAN2RDSR6_DB1_MASK               CAN2RXDSR6_DB1_MASK
#define CAN2RDSR6_DB2_MASK               CAN2RXDSR6_DB2_MASK
#define CAN2RDSR6_DB3_MASK               CAN2RXDSR6_DB3_MASK
#define CAN2RDSR6_DB4_MASK               CAN2RXDSR6_DB4_MASK
#define CAN2RDSR6_DB5_MASK               CAN2RXDSR6_DB5_MASK
#define CAN2RDSR6_DB6_MASK               CAN2RXDSR6_DB6_MASK
#define CAN2RDSR6_DB7_MASK               CAN2RXDSR6_DB7_MASK
#define CAN2RDSR7                        CAN2RXDSR7
#define CAN2RDSR7_DB0                    CAN2RXDSR7_DB0
#define CAN2RDSR7_DB1                    CAN2RXDSR7_DB1
#define CAN2RDSR7_DB2                    CAN2RXDSR7_DB2
#define CAN2RDSR7_DB3                    CAN2RXDSR7_DB3
#define CAN2RDSR7_DB4                    CAN2RXDSR7_DB4
#define CAN2RDSR7_DB5                    CAN2RXDSR7_DB5
#define CAN2RDSR7_DB6                    CAN2RXDSR7_DB6
#define CAN2RDSR7_DB7                    CAN2RXDSR7_DB7
#define CAN2RDSR7_DB0_MASK               CAN2RXDSR7_DB0_MASK
#define CAN2RDSR7_DB1_MASK               CAN2RXDSR7_DB1_MASK
#define CAN2RDSR7_DB2_MASK               CAN2RXDSR7_DB2_MASK
#define CAN2RDSR7_DB3_MASK               CAN2RXDSR7_DB3_MASK
#define CAN2RDSR7_DB4_MASK               CAN2RXDSR7_DB4_MASK
#define CAN2RDSR7_DB5_MASK               CAN2RXDSR7_DB5_MASK
#define CAN2RDSR7_DB6_MASK               CAN2RXDSR7_DB6_MASK
#define CAN2RDSR7_DB7_MASK               CAN2RXDSR7_DB7_MASK
