frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
#define CAN2RDLR                         CAN2RXDLR
#define CAN2RDLR_DLC0                    CAN2RXDLR_DLC0
#define CAN2RDLR_DLC1                    CAN2RXDLR_DLC1
#define CAN2RDLR_DLC2                    CAN2RXDLR_DLC2
#define CAN2RDLR_DLC3                    CAN2RXDLR_DLC3
#define CAN2RDLR_DLC                     CAN2RXDLR_DLC
#define CAN2RDLR_DLC0_MASK               CAN2RXDLR_DLC0_MASK
#define CAN2RDLR_DLC1_MASK               CAN2RXDLR_DLC1_MASK
#define CAN2RDLR_DLC2_MASK               CAN2RXDLR_DLC2_MASK
#define CAN2RDLR_DLC3_MASK               CAN2RXDLR_DLC3_MASK
#define CAN2RDLR_DLC_MASK                CAN2RXDLR_DLC_MASK
#define CAN2RDLR_DLC_BITNUM              CAN2RXDLR_DLC_BITNUM
#define CAN2RTSRH                        CAN2RXTSRH
#define CAN2RTSRH_TSR8                   CAN2RXTSRH_TSR8
#define CAN2RTSRH_TSR9                   CAN2RXTSRH_TSR9
#define CAN2RTSRH_TSR10                  CAN2RXTSRH_TSR10
#define CAN2RTSRH_TSR11                  CAN2RXTSRH_TSR11
#define CAN2RTSRH_TSR12                  CAN2RXTSRH_TSR12
#define CAN2RTSRH_TSR13                  CAN2RXTSRH_TSR13
#define CAN2RTSRH_TSR14                  CAN2RXTSRH_TSR14
#define CAN2RTSRH_TSR15                  CAN2RXTSRH_TSR15
#define CAN2RTSRH_TSR8_MASK              CAN2RXTSRH_TSR8_MASK
#define CAN2RTSRH_TSR9_MASK              CAN2RXTSRH_TSR9_MASK
#define CAN2RTSRH_TSR10_MASK             CAN2RXTSRH_TSR10_MASK
#define CAN2RTSRH_TSR11_MASK             CAN2RXTSRH_TSR11_MASK
#define CAN2RTSRH_TSR12_MASK             CAN2RXTSRH_TSR12_MASK
#define CAN2RTSRH_TSR13_MASK             CAN2RXTSRH_TSR13_MASK
#define CAN2RTSRH_TSR14_MASK             CAN2RXTSRH_TSR14_MASK
#define CAN2RTSRH_TSR15_MASK             CAN2RXTSRH_TSR15_MASK
#define CAN2RTSRL                        CAN2RXTSRL
#define CAN2RTSRL_TSR0                   CAN2RXTSRL_TSR0
#define CAN2RTSRL_TSR1                   CAN2RXTSRL_TSR1
#define CAN2RTSRL_TSR2                   CAN2RXTSRL_TSR2
#define CAN2RTSRL_TSR3                   CAN2RXTSRL_TSR3
#define CAN2RTSRL_TSR4                   CAN2RXTSRL_TSR4
#define CAN2RTSRL_TSR5                   CAN2RXTSRL_TSR5
#define CAN2RTSRL_TSR6                   CAN2RXTSRL_TSR6
#define CAN2RTSRL_TSR7                   CAN2RXTSRL_TSR7
#define CAN2RTSRL_TSR0_MASK              CAN2RXTSRL_TSR0_MASK
#define CAN2RTSRL_TSR1_MASK              CAN2RXTSRL_TSR1_MASK
#define CAN2RTSRL_TSR2_MASK              CAN2RXTSRL_TSR2_MASK
#define CAN2RTSRL_TSR3_MASK              CAN2RXTSRL_TSR3_MASK
#define CAN2RTSRL_TSR4_MASK              CAN2RXTSRL_TSR4_MASK
#define CAN2RTSRL_TSR5_MASK              CAN2RXTSRL_TSR5_MASK
#define CAN2RTSRL_TSR6_MASK              CAN2RXTSRL_TSR6_MASK
#define CAN2RTSRL_TSR7_MASK              CAN2RXTSRL_TSR7_MASK
#define CAN2RTSR                         CAN2RXTSR
#define CAN2RTSR_TSR0                    CAN2RXTSR_TSR0
#define CAN2RTSR_TSR1                    CAN2RXTSR_TSR1
#define CAN2RTSR_TSR2                    CAN2RXTSR_TSR2
#define CAN2RTSR_TSR3                    CAN2RXTSR_TSR3
#define CAN2RTSR_TSR4                    CAN2RXTSR_TSR4
#define CAN2RTSR_TSR5                    CAN2RXTSR_TSR5
#define CAN2RTSR_TSR6                    CAN2RXTSR_TSR6
#define CAN2RTSR_TSR7                    CAN2RXTSR_TSR7
#define CAN2RTSR_TSR8                    CAN2RXTSR_TSR8
#define CAN2RTSR_TSR9                    CAN2RXTSR_TSR9
#define CAN2RTSR_TSR10                   CAN2RXTSR_TSR10
#define CAN2RTSR_TSR11                   CAN2RXTSR_TSR11
#define CAN2RTSR_TSR12                   CAN2RXTSR_TSR12
#define CAN2RTSR_TSR13                   CAN2RXTSR_TSR13
#define CAN2RTSR_TSR14                   CAN2RXTSR_TSR14
#define CAN2RTSR_TSR15                   CAN2RXTSR_TSR15
#define CAN2RTSR_TSR0_MASK               CAN2RXTSR_TSR0_MASK
#define CAN2RTSR_TSR1_MASK               CAN2RXTSR_TSR1_MASK
#define CAN2RTSR_TSR2_MASK               CAN2RXTSR_TSR2_MASK
#define CAN2RTSR_TSR3_MASK               CAN2RXTSR_TSR3_MASK
#define CAN2RTSR_TSR4_MASK               CAN2RXTSR_TSR4_MASK
#define CAN2RTSR_TSR5_MASK               CAN2RXTSR_TSR5_MASK
#define CAN2RTSR_TSR6_MASK               CAN2RXTSR_TSR6_MASK
#define CAN2RTSR_TSR7_MASK               CAN2RXTSR_TSR7_MASK
#define CAN2RTSR_TSR8_MASK               CAN2RXTSR_TSR8_MASK
#define CAN2RTSR_TSR9_MASK               CAN2RXTSR_TSR9_MASK
#define CAN2RTSR_TSR10_MASK              CAN2RXTSR_TSR10_MASK
#define CAN2RTSR_TSR11_MASK              CAN2RXTSR_TSR11_MASK
#define CAN2RTSR_TSR12_MASK              CAN2RXTSR_TSR12_MASK
#define CAN2RTSR_TSR13_MASK              CAN2RXTSR_TSR13_MASK
#define CAN2RTSR_TSR14_MASK              CAN2RXTSR_TSR14_MASK
#define CAN2RTSR_TSR15_MASK              CAN2RXTSR_TSR15_MASK
#define CAN2TIDR0                        CAN2TXIDR0
#define CAN2TIDR0_ID21                   CAN2TXIDR0_ID21
#define CAN2TIDR0_ID22                   CAN2TXIDR0_ID22
#define CAN2TIDR0_ID23                   CAN2TXIDR0_ID23
#define CAN2TIDR0_ID24                   CAN2TXIDR0_ID24
#define CAN2TIDR0_ID25                   CAN2TXIDR0_ID25
#define CAN2TIDR0_ID26                   CAN2TXIDR0_ID26
#define CAN2TIDR0_ID27                   CAN2TXIDR0_ID27
#define CAN2TIDR0_ID28                   CAN2TXIDR0_ID28
#define CAN2TIDR_ARR                     CAN2TXIDR_ARR
#define CAN2TIDR0_ID21_MASK              CAN2TXIDR0_ID21_MASK
#define CAN2TIDR0_ID22_MASK              CAN2TXIDR0_ID22_MASK
#define CAN2TIDR0_ID23_MASK              CAN2TXIDR0_ID23_MASK
#define CAN2TIDR0_ID24_MASK              CAN2TXIDR0_ID24_MASK
#define CAN2TIDR0_ID25_MASK              CAN2TXIDR0_ID25_MASK
#define CAN2TIDR0_ID26_MASK              CAN2TXIDR0_ID26_MASK
#define CAN2TIDR0_ID27_MASK              CAN2TXIDR0_ID27_MASK
#define CAN2TIDR0_ID28_MASK              CAN2TXIDR0_ID28_MASK
#define CAN2TIDR1                        CAN2TXIDR1
#define CAN2TIDR1_ID15                   CAN2TXIDR1_ID15
#define CAN2TIDR1_ID16                   CAN2TXIDR1_ID16
#define CAN2TIDR1_ID17                   CAN2TXIDR1_ID17
#define CAN2TIDR1_IDE                    CAN2TXIDR1_IDE
#define CAN2TIDR1_SRR                    CAN2TXIDR1_SRR
#define CAN2TIDR1_ID18                   CAN2TXIDR1_ID18
#define CAN2TIDR1_ID19                   CAN2TXIDR1_ID19
#define CAN2TIDR1_ID20                   CAN2TXIDR1_ID20
#define CAN2TIDR1_ID_15                  CAN2TXIDR1_ID_15
#define CAN2TIDR1_ID_18                  CAN2TXIDR1_ID_18
#define CAN2TIDR1_ID                     CAN2TXIDR1_ID
#define CAN2TIDR1_ID15_MASK              CAN2TXIDR1_ID15_MASK
#define CAN2TIDR1_ID16_MASK              CAN2TXIDR1_ID16_MASK
#define CAN2TIDR1_ID17_MASK              CAN2TXIDR1_ID17_MASK
#define CAN2TIDR1_IDE_MASK               CAN2TXIDR1_IDE_MASK
#define CAN2TIDR1_SRR_MASK               CAN2TXIDR1_SRR_MASK
#define CAN2TIDR1_ID18_MASK              CAN2TXIDR1_ID18_MASK
#define CAN2TIDR1_ID19_MASK              CAN2TXIDR1_ID19_MASK
#define CAN2TIDR1_ID20_MASK              CAN2TXIDR1_ID20_MASK
#define CAN2TIDR1_ID_15_MASK             CAN2TXIDR1_ID_15_MASK
#define CAN2TIDR1_ID_15_BITNUM           CAN2TXIDR1_ID_15_BITNUM
#define CAN2TIDR1_ID_18_MASK             CAN2TXIDR1_ID_18_MASK
#define CAN2TIDR1_ID_18_BITNUM           CAN2TXIDR1_ID_18_BITNUM
#define CAN2TIDR2                        CAN2TXIDR2
#define CAN2TIDR2_ID7                    CAN2TXIDR2_ID7
#define CAN2TIDR2_ID8                    CAN2TXIDR2_ID8
#define CAN2TIDR2_ID9                    CAN2TXIDR2_ID9
#define CAN2TIDR2_ID10                   CAN2TXIDR2_ID10
#define CAN2TIDR2_ID11                   CAN2TXIDR2_ID11
#define CAN2TIDR2_ID12                   CAN2TXIDR2_ID12
#define CAN2TIDR2_ID13                   CAN2TXIDR2_ID13
#define CAN2TIDR2_ID14                   CAN2TXIDR2_ID14
#define CAN2TIDR2_ID7_MASK               CAN2TXIDR2_ID7_MASK
#define CAN2TIDR2_ID8_MASK               CAN2TXIDR2_ID8_MASK
#define CAN2TIDR2_ID9_MASK               CAN2TXIDR2_ID9_MASK
#define CAN2TIDR2_ID10_MASK              CAN2TXIDR2_ID10_MASK
#define CAN2TIDR2_ID11_MASK              CAN2TXIDR2_ID11_MASK
#define CAN2TIDR2_ID12_MASK              CAN2TXIDR2_ID12_MASK
#define CAN2TIDR2_ID13_MASK              CAN2TXIDR2_ID13_MASK
#define CAN2TIDR2_ID14_MASK              CAN2TXIDR2_ID14_MASK
#define CAN2TIDR3                        CAN2TXIDR3
#define CAN2TIDR3_RTR                    CAN2TXIDR3_RTR
#define CAN2TIDR3_ID0                    CAN2TXIDR3_ID0
#define CAN2TIDR3_ID1                    CAN2TXIDR3_ID1
#define CAN2TIDR3_ID2                    CAN2TXIDR3_ID2
#define CAN2TIDR3_ID3                    CAN2TXIDR3_ID3
#define CAN2TIDR3_ID4                    CAN2TXIDR3_ID4
#define CAN2TIDR3_ID5                    CAN2TXIDR3_ID5
#define CAN2TIDR3_ID6                    CAN2TXIDR3_ID6
#define CAN2TIDR3_ID                     CAN2TXIDR3_ID
#define CAN2TIDR3_RTR_MASK               CAN2TXIDR3_RTR_MASK
#define CAN2TIDR3_ID0_MASK               CAN2TXIDR3_ID0_MASK
#define CAN2TIDR3_ID1_MASK               CAN2TXIDR3_ID1_MASK
#define CAN2TIDR3_ID2_MASK               CAN2TXIDR3_ID2_MASK
#define CAN2TIDR3_ID3_MASK               CAN2TXIDR3_ID3_MASK
#define CAN2TIDR3_ID4_MASK               CAN2TXIDR3_ID4_MASK
#define CAN2TIDR3_ID5_MASK               CAN2TXIDR3_ID5_MASK
#define CAN2TIDR3_ID6_MASK               CAN2TXIDR3_ID6_MASK
#define CAN2TIDR3_ID_MASK                CAN2TXIDR3_ID_MASK
#define CAN2TIDR3_ID_BITNUM              CAN2TXIDR3_ID_BITNUM
#define CAN2TDSR0                        CAN2TXDSR0
#define CAN2TDSR0_DB0                    CAN2TXDSR0_DB0
#define CAN2TDSR0_DB1                    CAN2TXDSR0_DB1
#define CAN2TDSR0_DB2                    CAN2TXDSR0_DB2
#define CAN2TDSR0_DB3                    CAN2TXDSR0_DB3
#define CAN2TDSR0_DB4                    CAN2TXDSR0_DB4
#define CAN2TDSR0_DB5                    CAN2TXDSR0_DB5
#define CAN2TDSR0_DB6                    CAN2TXDSR0_DB6
#define CAN2TDSR0_DB7                    CAN2TXDSR0_DB7
#define CAN2TDSR_ARR                     CAN2TXDSR_ARR
#define CAN2TDSR0_DB0_MASK               CAN2TXDSR0_DB0_MASK
#define CAN2TDSR0_DB1_MASK               CAN2TXDSR0_DB1_MASK
#define CAN2TDSR0_DB2_MASK               CAN2TXDSR0_DB2_MASK
#define CAN2TDSR0_DB3_MASK               CAN2TXDSR0_DB3_MASK
#define CAN2TDSR0_DB4_MASK               CAN2TXDSR0_DB4_MASK
#define CAN2TDSR0_DB5_MASK               CAN2TXDSR0_DB5_MASK
#define CAN2TDSR0_DB6_MASK               CAN2TXDSR0_DB6_MASK
#define CAN2TDSR0_DB7_MASK               CAN2TXDSR0_DB7_MASK
#define CAN2TDSR1                        CAN2TXDSR1
#define CAN2TDSR1_DB0                    CAN2TXDSR1_DB0
#define CAN2TDSR1_DB1                    CAN2TXDSR1_DB1
#define CAN2TDSR1_DB2                    CAN2TXDSR1_DB2
#define CAN2TDSR1_DB3                    CAN2TXDSR1_DB3
#define CAN2TDSR1_DB4                    CAN2TXDSR1_DB4
#define CAN2TDSR1_DB5                    CAN2TXDSR1_DB5
#define CAN2TDSR1_DB6                    CAN2TXDSR1_DB6
#define CAN2TDSR1_DB7                    CAN2TXDSR1_DB7
#define CAN2TDSR1_DB0_MASK               CAN2TXDSR1_DB0_MASK
#define CAN2TDSR1_DB1_MASK               CAN2TXDSR1_DB1_MASK
#define CAN2TDSR1_DB2_MASK               CAN2TXDSR1_DB2_MASK
#define CAN2TDSR1_DB3_MASK               CAN2TXDSR1_DB3_MASK
#define CAN2TDSR1_DB4_MASK               CAN2TXDSR1_DB4_MASK
#define CAN2TDSR1_DB5_MASK               CAN2TXDSR1_DB5_MASK
#define CAN2TDSR1_DB6_MASK               CAN2TXDSR1_DB6_MASK
#define CAN2TDSR1_DB7_MASK               CAN2TXDSR1_DB7_MASK
#define CAN2TDSR2                        CAN2TXDSR2
#define CAN2TDSR2_DB0                    CAN2TXDSR2_DB0
#define CAN2TDSR2_DB1                    CAN2TXDSR2_DB1
#define CAN2TDSR2_DB2                    CAN2TXDSR2_DB2
#define CAN2TDSR2_DB3                    CAN2TXDSR2_DB3
#define CAN2TDSR2_DB4                    CAN2TXDSR2_DB4
#define CAN2TDSR2_DB5                    CAN2TXDSR2_DB5
#define CAN2TDSR2_DB6                    CAN2TXDSR2_DB6
#define CAN2TDSR2_DB7                    CAN2TXDSR2_DB7
#define CAN2TDSR2_DB0_MASK               CAN2TXDSR2_DB0_MASK
#define CAN2TDSR2_DB1_MASK               CAN2TXDSR2_DB1_MASK
#define CAN2TDSR2_DB2_MASK               CAN2TXDSR2_DB2_MASK
#define CAN2TDSR2_DB3_MASK               CAN2TXDSR2_DB3_MASK
#define CAN2TDSR2_DB4_MASK               CAN2TXDSR2_DB4_MASK
#define CAN2TDSR2_DB5_MASK               CAN2TXDSR2_DB5_MASK
#define CAN2TDSR2_DB6_MASK               CAN2TXDSR2_DB6_MASK
#define CAN2TDSR2_DB7_MASK               CAN2TXDSR2_DB7_MASK
#define CAN2TDSR3                        CAN2TXDSR3
#define CAN2TDSR3_DB0                    CAN2TXDSR3_DB0
#define CAN2TDSR3_DB1                    CAN2TXDSR3_DB1
#define CAN2TDSR3_DB2                    CAN2TXDSR3_DB2
#define CAN2TDSR3_DB3                    CAN2TXDSR3_DB3
#define CAN2TDSR3_DB4                    CAN2TXDSR3_DB4
#define CAN2TDSR3_DB5                    CAN2TXDSR3_DB5
#define CAN2TDSR3_DB6                    CAN2TXDSR3_DB6
#define CAN2TDSR3_DB7                    CAN2TXDSR3_DB7
#define CAN2TDSR3_DB0_MASK               CAN2TXDSR3_DB0_MASK
#define CAN2TDSR3_DB1_MASK               CAN2TXDSR3_DB1_MASK
#define CAN2TDSR3_DB2_MASK               CAN2TXDSR3_DB2_MASK
#define CAN2TDSR3_DB3_MASK               CAN2TXDSR3_DB3_MASK
#define CAN2TDSR3_DB4_MASK               CAN2TXDSR3_DB4_MASK
#define CAN2TDSR3_DB5_MASK               CAN2TXDSR3_DB5_MASK
#define CAN2TDSR3_DB6_MASK               CAN2TXDSR3_DB6_MASK
#define CAN2TDSR3_DB7_MASK               CAN2TXDSR3_DB7_MASK
#define CAN2TDSR4                        CAN2TXDSR4
#define CAN2TDSR4_DB0                    CAN2TXDSR4_DB0
#define CAN2TDSR4_DB1                    CAN2TXDSR4_DB1
#define CAN2TDSR4_DB2                    CAN2TXDSR4_DB2
#define CAN2TDSR4_DB3                    CAN2TXDSR4_DB3
#define CAN2TDSR4_DB4                    CAN2TXDSR4_DB4
#define CAN2TDSR4_DB5                    CAN2TXDSR4_DB5
#define CAN2TDSR4_DB6                    CAN2TXDSR4_DB6
#define CAN2TDSR4_DB7                    CAN2TXDSR4_DB7
#define CAN2TDSR4_DB0_MASK               CAN2TXDSR4_DB0_MASK
#define CAN2TDSR4_DB1_MASK               CAN2TXDSR4_DB1_MASK
#define CAN2TDSR4_DB2_MASK               CAN2TXDSR4_DB2_MASK
#define CAN2TDSR4_DB3_MASK               CAN2TXDSR4_DB3_MASK
#define CAN2TDSR4_DB4_MASK               CAN2TXDSR4_DB4_MASK
#define CAN2TDSR4_DB5_MASK               CAN2TXDSR4_DB5_MASK
#define CAN2TDSR4_DB6_MASK               CAN2TXDSR4_DB6_MASK
#define CAN2TDSR4_DB7_MASK               CAN2TXDSR4_DB7_MASK
#define CAN2TDSR5                        CAN2TXDSR5
#define CAN2TDSR5_DB0                    CAN2TXDSR5_DB0
#define CAN2TDSR5_DB1                    CAN2TXDSR5_DB1
#define CAN2TDSR5_DB2                    CAN2TXDSR5_DB2
#define CAN2TDSR5_DB3                    CAN2TXDSR5_DB3
#define CAN2TDSR5_DB4                    CAN2TXDSR5_DB4
#define CAN2TDSR5_DB5                    CAN2TXDSR5_DB5
#define CAN2TDSR5_DB6                    CAN2TXDSR5_DB6
#define CAN2TDSR5_DB7                    CAN2TXDSR5_DB7
#define CAN2TDSR5_DB0_MASK               CAN2TXDSR5_DB0_MASK
#define CAN2TDSR5_DB1_MASK               CAN2TXDSR5_DB1_MASK
#define CAN2TDSR5_DB2_MASK               CAN2TXDSR5_DB2_MASK
#define CAN2TDSR5_DB3_MASK               CAN2TXDSR5_DB3_MASK
#define CAN2TDSR5_DB4_MASK               CAN2TXDSR5_DB4_MASK
#define CAN2TDSR5_DB5_MASK               CAN2TXDSR5_DB5_MASK
#define CAN2TDSR5_DB6_MASK               CAN2TXDSR5_DB6_MASK
#define CAN2TDSR5_DB7_MASK               CAN2TXDSR5_DB7_MASK
#define CAN2TDSR6                        CAN2TXDSR6
#define CAN2TDSR6_DB0                    CAN2TXDSR6_DB0
#define CAN2TDSR6_DB1                    CAN2TXDSR6_DB1
#define CAN2TDSR6_DB2                    CAN2TXDSR6_DB2
#define CAN2TDSR6_DB3                    CAN2TXDSR6_DB3
#define CAN2TDSR6_DB4                    CAN2TXDSR6_DB4
#define CAN2TDSR6_DB5                    CAN2TXDSR6_DB5
#define CAN2TDSR6_DB6                    CAN2TXDSR6_DB6
#define CAN2TDSR6_DB7                    CAN2TXDSR6_DB7
#define CAN2TDSR6_DB0_MASK               CAN2TXDSR6_DB0_MASK
#define CAN2TDSR6_DB1_MASK               CAN2TXDSR6_DB1_MASK
#define CAN2TDSR6_DB2_MASK               CAN2TXDSR6_DB2_MASK
#define CAN2TDSR6_DB3_MASK               CAN2TXDSR6_DB3_MASK
#define CAN2TDSR6_DB4_MASK               CAN2TXDSR6_DB4_MASK
#define CAN2TDSR6_DB5_MASK               CAN2TXDSR6_DB5_MASK
#define CAN2TDSR6_DB6_MASK               CAN2TXDSR6_DB6_MASK
#define CAN2TDSR6_DB7_MASK               CAN2TXDSR6_DB7_MASK
#define CAN2TDSR7                        CAN2TXDSR7
#define CAN2TDSR7_DB0                    CAN2TXDSR7_DB0
#define CAN2TDSR7_DB1                    CAN2TXDSR7_DB1
#define CAN2TDSR7_DB2                    CAN2TXDSR7_DB2
#define CAN2TDSR7_DB3                    CAN2TXDSR7_DB3
#define CAN2TDSR7_DB4                    CAN2TXDSR7_DB4
#define CAN2TDSR7_DB5                    CAN2TXDSR7_DB5
#define CAN2TDSR7_DB6                    CAN2TXDSR7_DB6
#define CAN2TDSR7_DB7                    CAN2TXDSR7_DB7
#define CAN2TDSR7_DB0_MASK               CAN2TXDSR7_DB0_MASK
#define CAN2TDSR7_DB1_MASK               CAN2TXDSR7_DB1_MASK
#define CAN2TDSR7_DB2_MASK               CAN2TXDSR7_DB2_MASK
#define CAN2TDSR7_DB3_MASK               CAN2TXDSR7_DB3_MASK
#define CAN2TDSR7_DB4_MASK               CAN2TXDSR7_DB4_MASK
#define CAN2TDSR7_DB5_MASK               CAN2TXDSR7_DB5_MASK
#define CAN2TDSR7_DB6_MASK               CAN2TXDSR7_DB6_MASK
#define CAN2TDSR7_DB7_MASK               CAN2TXDSR7_DB7_MASK
#define CAN2TDLR                         CAN2TXDLR
#define CAN2TDLR_DLC0                    CAN2TXDLR_DLC0
#define CAN2TDLR_DLC1                    CAN2TXDLR_DLC1
#define CAN2TDLR_DLC2                    CAN2TXDLR_DLC2
#define CAN2TDLR_DLC3                    CAN2TXDLR_DLC3
#define CAN2TDLR_DLC                     CAN2TXDLR_DLC
#define CAN2TDLR_DLC0_MASK               CAN2TXDLR_DLC0_MASK
#define CAN2TDLR_DLC1_MASK               CAN2TXDLR_DLC1_MASK
#define CAN2TDLR_DLC2_MASK               CAN2TXDLR_DLC2_MASK
#define CAN2TDLR_DLC3_MASK               CAN2TXDLR_DLC3_MASK
#define CAN2TDLR_DLC_MASK                CAN2TXDLR_DLC_MASK
#define CAN2TDLR_DLC_BITNUM              CAN2TXDLR_DLC_BITNUM
#define CAN2TTBPR                        CAN2TXTBPR
#define CAN2TTBPR_PRIO0                  CAN2TXTBPR_PRIO0
#define CAN2TTBPR_PRIO1                  CAN2TXTBPR_PRIO1
#define CAN2TTBPR_PRIO2                  CAN2TXTBPR_PRIO2
#define CAN2TTBPR_PRIO3                  CAN2TXTBPR_PRIO3
#define CAN2TTBPR_PRIO4                  CAN2TXTBPR_PRIO4
#define CAN2TTBPR_PRIO5                  CAN2TXTBPR_PRIO5
#define CAN2TTBPR_PRIO6                  CAN2TXTBPR_PRIO6
#define CAN2TTBPR_PRIO7                  CAN2TXTBPR_PRIO7
#define CAN2TTBPR_PRIO0_MASK             CAN2TXTBPR_PRIO0_MASK
#define CAN2TTBPR_PRIO1_MASK             CAN2TXTBPR_PRIO1_MASK
#define CAN2TTBPR_PRIO2_MASK             CAN2TXTBPR_PRIO2_MASK
#define CAN2TTBPR_PRIO3_MASK             CAN2TXTBPR_PRIO3_MASK
#define CAN2TTBPR_PRIO4_MASK             CAN2TXTBPR_PRIO4_MASK
#define CAN2TTBPR_PRIO5_MASK             CAN2TXTBPR_PRIO5_MASK
#define CAN2TTBPR_PRIO6_MASK             CAN2TXTBPR_PRIO6_MASK
#define CAN2TTBPR_PRIO7_MASK             CAN2TXTBPR_PRIO7_MASK
#define CAN2TTSRH                        CAN2TXTSRH
#define CAN2TTSRH_TSR8                   CAN2TXTSRH_TSR8
#define CAN2TTSRH_TSR9                   CAN2TXTSRH_TSR9
#define CAN2TTSRH_TSR10                  CAN2TXTSRH_TSR10
#define CAN2TTSRH_TSR11                  CAN2TXTSRH_TSR11
#define CAN2TTSRH_TSR12                  CAN2TXTSRH_TSR12
#define CAN2TTSRH_TSR13                  CAN2TXTSRH_TSR13
#define CAN2TTSRH_TSR14                  CAN2TXTSRH_TSR14
#define CAN2TTSRH_TSR15                  CAN2TXTSRH_TSR15
#define CAN2TTSRH_TSR8_MASK              CAN2TXTSRH_TSR8_MASK
#define CAN2TTSRH_TSR9_MASK              CAN2TXTSRH_TSR9_MASK
#define CAN2TTSRH_TSR10_MASK             CAN2TXTSRH_TSR10_MASK
#define CAN2TTSRH_TSR11_MASK             CAN2TXTSRH_TSR11_MASK
#define CAN2TTSRH_TSR12_MASK             CAN2TXTSRH_TSR12_MASK
#define CAN2TTSRH_TSR13_MASK             CAN2TXTSRH_TSR13_MASK
#define CAN2TTSRH_TSR14_MASK             CAN2TXTSRH_TSR14_MASK
#define CAN2TTSRH_TSR15_MASK             CAN2TXTSRH_TSR15_MASK
#define CAN2TTSRL                        CAN2TXTSRL
#define CAN2TTSRL_TSR0                   CAN2TXTSRL_TSR0
#define CAN2TTSRL_TSR1                   CAN2TXTSRL_TSR1
#define CAN2TTSRL_TSR2                   CAN2TXTSRL_TSR2
#define CAN2TTSRL_TSR3                   CAN2TXTSRL_TSR3
#define CAN2TTSRL_TSR4                   CAN2TXTSRL_TSR4
#define CAN2TTSRL_TSR5                   CAN2TXTSRL_TSR5
#define CAN2TTSRL_TSR6                   CAN2TXTSRL_TSR6
#define CAN2TTSRL_TSR7                   CAN2TXTSRL_TSR7
#define CAN2TTSRL_TSR0_MASK              CAN2TXTSRL_TSR0_MASK
#define CAN2TTSRL_TSR1_MASK              CAN2TXTSRL_TSR1_MASK
#define CAN2TTSRL_TSR2_MASK              CAN2TXTSRL_TSR2_MASK
#define CAN2TTSRL_TSR3_MASK              CAN2TXTSRL_TSR3_MASK
#define CAN2TTSRL_TSR4_MASK              CAN2TXTSRL_TSR4_MASK
#define CAN2TTSRL_TSR5_MASK              CAN2TXTSRL_TSR5_MASK
#define CAN2TTSRL_TSR6_MASK              CAN2TXTSRL_TSR6_MASK
#define CAN2TTSRL_TSR7_MASK              CAN2TXTSRL_TSR7_MASK
#define CAN2TTSR                         CAN2TXTSR
#define CAN2TTSR_TSR0                    CAN2TXTSR_TSR0
#define CAN2TTSR_TSR1                    CAN2TXTSR_TSR1
#define CAN2TTSR_TSR2                    CAN2TXTSR_TSR2
#define CAN2TTSR_TSR3                    CAN2TXTSR_TSR3
#define CAN2TTSR_TSR4                    CAN2TXTSR_TSR4
#define CAN2TTSR_TSR5                    CAN2TXTSR_TSR5
#define CAN2TTSR_TSR6                    CAN2TXTSR_TSR6
#define CAN2TTSR_TSR7                    CAN2TXTSR_TSR7
#define CAN2TTSR_TSR8                    CAN2TXTSR_TSR8
#define CAN2TTSR_TSR9                    CAN2TXTSR_TSR9
#define CAN2TTSR_TSR10                   CAN2TXTSR_TSR10
#define CAN2TTSR_TSR11                   CAN2TXTSR_TSR11
#define CAN2TTSR_TSR12                   CAN2TXTSR_TSR12
#define CAN2TTSR_TSR13                   CAN2TXTSR_TSR13
#define CAN2TTSR_TSR14                   CAN2TXTSR_TSR14
#define CAN2TTSR_TSR15                   CAN2TXTSR_TSR15
#define CAN2TTSR_TSR0_MASK               CAN2TXTSR_TSR0_MASK
#define CAN2TTSR_TSR1_MASK               CAN2TXTSR_TSR1_MASK
#define CAN2TTSR_TSR2_MASK               CAN2TXTSR_TSR2_MASK
#define CAN2TTSR_TSR3_MASK               CAN2TXTSR_TSR3_MASK
#define CAN2TTSR_TSR4_MASK               CAN2TXTSR_TSR4_MASK
#define CAN2TTSR_TSR5_MASK               CAN2TXTSR_TSR5_MASK
#define CAN2TTSR_TSR6_MASK               CAN2TXTSR_TSR6_MASK
#define CAN2TTSR_TSR7_MASK               CAN2TXTSR_TSR7_MASK
#define CAN2TTSR_TSR8_MASK               CAN2TXTSR_TSR8_MASK
#define CAN2TTSR_TSR9_MASK               CAN2TXTSR_TSR9_MASK
#define CAN2TTSR_TSR10_MASK              CAN2TXTSR_TSR10_MASK
#define CAN2TTSR_TSR11_MASK              CAN2TXTSR_TSR11_MASK
#define CAN2TTSR_TSR12_MASK              CAN2TXTSR_TSR12_MASK
#define CAN2TTSR_TSR13_MASK              CAN2TXTSR_TSR13_MASK
#define CAN2TTSR_TSR14_MASK              CAN2TXTSR_TSR14_MASK
#define CAN2TTSR_TSR15_MASK              CAN2TXTSR_TSR15_MASK
#define CAN3RIDR0                        CAN3RXIDR0
#define CAN3RIDR0_ID21                   CAN3RXIDR0_ID21
#define CAN3RIDR0_ID22                   CAN3RXIDR0_ID22
#define CAN3RIDR0_ID23                   CAN3RXIDR0_ID23
#define CAN3RIDR0_ID24                   CAN3RXIDR0_ID24
#define CAN3RIDR0_ID25                   CAN3RXIDR0_ID25
#define CAN3RIDR0_ID26                   CAN3RXIDR0_ID26
#define CAN3RIDR0_ID27                   CAN3RXIDR0_ID27
#define CAN3RIDR0_ID28                   CAN3RXIDR0_ID28
#define CAN3RIDR_ARR                     CAN3RXIDR_ARR
#define CAN3RIDR0_ID21_MASK              CAN3RXIDR0_ID21_MASK
#define CAN3RIDR0_ID22_MASK              CAN3RXIDR0_ID22_MASK
#define CAN3RIDR0_ID23_MASK              CAN3RXIDR0_ID23_MASK
#define CAN3RIDR0_ID24_MASK              CAN3RXIDR0_ID24_MASK
#define CAN3RIDR0_ID25_MASK              CAN3RXIDR0_ID25_MASK
#define CAN3RIDR0_ID26_MASK              CAN3RXIDR0_ID26_MASK
#define CAN3RIDR0_ID27_MASK              CAN3RXIDR0_ID27_MASK
#define CAN3RIDR0_ID28_MASK              CAN3RXIDR0_ID28_MASK
