frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xep768.h
#define CAN3RIDR1                        CAN3RXIDR1
#define CAN3RIDR1_ID15                   CAN3RXIDR1_ID15
#define CAN3RIDR1_ID16                   CAN3RXIDR1_ID16
#define CAN3RIDR1_ID17                   CAN3RXIDR1_ID17
#define CAN3RIDR1_IDE                    CAN3RXIDR1_IDE
#define CAN3RIDR1_SRR                    CAN3RXIDR1_SRR
#define CAN3RIDR1_ID18                   CAN3RXIDR1_ID18
#define CAN3RIDR1_ID19                   CAN3RXIDR1_ID19
#define CAN3RIDR1_ID20                   CAN3RXIDR1_ID20
#define CAN3RIDR1_ID_15                  CAN3RXIDR1_ID_15
#define CAN3RIDR1_ID_18                  CAN3RXIDR1_ID_18
#define CAN3RIDR1_ID                     CAN3RXIDR1_ID
#define CAN3RIDR1_ID15_MASK              CAN3RXIDR1_ID15_MASK
#define CAN3RIDR1_ID16_MASK              CAN3RXIDR1_ID16_MASK
#define CAN3RIDR1_ID17_MASK              CAN3RXIDR1_ID17_MASK
#define CAN3RIDR1_IDE_MASK               CAN3RXIDR1_IDE_MASK
#define CAN3RIDR1_SRR_MASK               CAN3RXIDR1_SRR_MASK
#define CAN3RIDR1_ID18_MASK              CAN3RXIDR1_ID18_MASK
#define CAN3RIDR1_ID19_MASK              CAN3RXIDR1_ID19_MASK
#define CAN3RIDR1_ID20_MASK              CAN3RXIDR1_ID20_MASK
#define CAN3RIDR1_ID_15_MASK             CAN3RXIDR1_ID_15_MASK
#define CAN3RIDR1_ID_15_BITNUM           CAN3RXIDR1_ID_15_BITNUM
#define CAN3RIDR1_ID_18_MASK             CAN3RXIDR1_ID_18_MASK
#define CAN3RIDR1_ID_18_BITNUM           CAN3RXIDR1_ID_18_BITNUM
#define CAN3RIDR2                        CAN3RXIDR2
#define CAN3RIDR2_ID7                    CAN3RXIDR2_ID7
#define CAN3RIDR2_ID8                    CAN3RXIDR2_ID8
#define CAN3RIDR2_ID9                    CAN3RXIDR2_ID9
#define CAN3RIDR2_ID10                   CAN3RXIDR2_ID10
#define CAN3RIDR2_ID11                   CAN3RXIDR2_ID11
#define CAN3RIDR2_ID12                   CAN3RXIDR2_ID12
#define CAN3RIDR2_ID13                   CAN3RXIDR2_ID13
#define CAN3RIDR2_ID14                   CAN3RXIDR2_ID14
#define CAN3RIDR2_ID7_MASK               CAN3RXIDR2_ID7_MASK
#define CAN3RIDR2_ID8_MASK               CAN3RXIDR2_ID8_MASK
#define CAN3RIDR2_ID9_MASK               CAN3RXIDR2_ID9_MASK
#define CAN3RIDR2_ID10_MASK              CAN3RXIDR2_ID10_MASK
#define CAN3RIDR2_ID11_MASK              CAN3RXIDR2_ID11_MASK
#define CAN3RIDR2_ID12_MASK              CAN3RXIDR2_ID12_MASK
#define CAN3RIDR2_ID13_MASK              CAN3RXIDR2_ID13_MASK
#define CAN3RIDR2_ID14_MASK              CAN3RXIDR2_ID14_MASK
#define CAN3RIDR3                        CAN3RXIDR3
#define CAN3RIDR3_RTR                    CAN3RXIDR3_RTR
#define CAN3RIDR3_ID0                    CAN3RXIDR3_ID0
#define CAN3RIDR3_ID1                    CAN3RXIDR3_ID1
#define CAN3RIDR3_ID2                    CAN3RXIDR3_ID2
#define CAN3RIDR3_ID3                    CAN3RXIDR3_ID3
#define CAN3RIDR3_ID4                    CAN3RXIDR3_ID4
#define CAN3RIDR3_ID5                    CAN3RXIDR3_ID5
#define CAN3RIDR3_ID6                    CAN3RXIDR3_ID6
#define CAN3RIDR3_ID                     CAN3RXIDR3_ID
#define CAN3RIDR3_RTR_MASK               CAN3RXIDR3_RTR_MASK
#define CAN3RIDR3_ID0_MASK               CAN3RXIDR3_ID0_MASK
#define CAN3RIDR3_ID1_MASK               CAN3RXIDR3_ID1_MASK
#define CAN3RIDR3_ID2_MASK               CAN3RXIDR3_ID2_MASK
#define CAN3RIDR3_ID3_MASK               CAN3RXIDR3_ID3_MASK
#define CAN3RIDR3_ID4_MASK               CAN3RXIDR3_ID4_MASK
#define CAN3RIDR3_ID5_MASK               CAN3RXIDR3_ID5_MASK
#define CAN3RIDR3_ID6_MASK               CAN3RXIDR3_ID6_MASK
#define CAN3RIDR3_ID_MASK                CAN3RXIDR3_ID_MASK
#define CAN3RIDR3_ID_BITNUM              CAN3RXIDR3_ID_BITNUM
#define CAN3RDSR0                        CAN3RXDSR0
#define CAN3RDSR0_DB0                    CAN3RXDSR0_DB0
#define CAN3RDSR0_DB1                    CAN3RXDSR0_DB1
#define CAN3RDSR0_DB2                    CAN3RXDSR0_DB2
#define CAN3RDSR0_DB3                    CAN3RXDSR0_DB3
#define CAN3RDSR0_DB4                    CAN3RXDSR0_DB4
#define CAN3RDSR0_DB5                    CAN3RXDSR0_DB5
#define CAN3RDSR0_DB6                    CAN3RXDSR0_DB6
#define CAN3RDSR0_DB7                    CAN3RXDSR0_DB7
#define CAN3RDSR_ARR                     CAN3RXDSR_ARR
#define CAN3RDSR0_DB0_MASK               CAN3RXDSR0_DB0_MASK
#define CAN3RDSR0_DB1_MASK               CAN3RXDSR0_DB1_MASK
#define CAN3RDSR0_DB2_MASK               CAN3RXDSR0_DB2_MASK
#define CAN3RDSR0_DB3_MASK               CAN3RXDSR0_DB3_MASK
#define CAN3RDSR0_DB4_MASK               CAN3RXDSR0_DB4_MASK
#define CAN3RDSR0_DB5_MASK               CAN3RXDSR0_DB5_MASK
#define CAN3RDSR0_DB6_MASK               CAN3RXDSR0_DB6_MASK
#define CAN3RDSR0_DB7_MASK               CAN3RXDSR0_DB7_MASK
#define CAN3RDSR1                        CAN3RXDSR1
#define CAN3RDSR1_DB0                    CAN3RXDSR1_DB0
#define CAN3RDSR1_DB1                    CAN3RXDSR1_DB1
#define CAN3RDSR1_DB2                    CAN3RXDSR1_DB2
#define CAN3RDSR1_DB3                    CAN3RXDSR1_DB3
#define CAN3RDSR1_DB4                    CAN3RXDSR1_DB4
#define CAN3RDSR1_DB5                    CAN3RXDSR1_DB5
#define CAN3RDSR1_DB6                    CAN3RXDSR1_DB6
#define CAN3RDSR1_DB7                    CAN3RXDSR1_DB7
#define CAN3RDSR1_DB0_MASK               CAN3RXDSR1_DB0_MASK
#define CAN3RDSR1_DB1_MASK               CAN3RXDSR1_DB1_MASK
#define CAN3RDSR1_DB2_MASK               CAN3RXDSR1_DB2_MASK
#define CAN3RDSR1_DB3_MASK               CAN3RXDSR1_DB3_MASK
#define CAN3RDSR1_DB4_MASK               CAN3RXDSR1_DB4_MASK
#define CAN3RDSR1_DB5_MASK               CAN3RXDSR1_DB5_MASK
#define CAN3RDSR1_DB6_MASK               CAN3RXDSR1_DB6_MASK
#define CAN3RDSR1_DB7_MASK               CAN3RXDSR1_DB7_MASK
#define CAN3RDSR2                        CAN3RXDSR2
#define CAN3RDSR2_DB0                    CAN3RXDSR2_DB0
#define CAN3RDSR2_DB1                    CAN3RXDSR2_DB1
#define CAN3RDSR2_DB2                    CAN3RXDSR2_DB2
#define CAN3RDSR2_DB3                    CAN3RXDSR2_DB3
#define CAN3RDSR2_DB4                    CAN3RXDSR2_DB4
#define CAN3RDSR2_DB5                    CAN3RXDSR2_DB5
#define CAN3RDSR2_DB6                    CAN3RXDSR2_DB6
#define CAN3RDSR2_DB7                    CAN3RXDSR2_DB7
#define CAN3RDSR2_DB0_MASK               CAN3RXDSR2_DB0_MASK
#define CAN3RDSR2_DB1_MASK               CAN3RXDSR2_DB1_MASK
#define CAN3RDSR2_DB2_MASK               CAN3RXDSR2_DB2_MASK
#define CAN3RDSR2_DB3_MASK               CAN3RXDSR2_DB3_MASK
#define CAN3RDSR2_DB4_MASK               CAN3RXDSR2_DB4_MASK
#define CAN3RDSR2_DB5_MASK               CAN3RXDSR2_DB5_MASK
#define CAN3RDSR2_DB6_MASK               CAN3RXDSR2_DB6_MASK
#define CAN3RDSR2_DB7_MASK               CAN3RXDSR2_DB7_MASK
#define CAN3RDSR3                        CAN3RXDSR3
#define CAN3RDSR3_DB0                    CAN3RXDSR3_DB0
#define CAN3RDSR3_DB1                    CAN3RXDSR3_DB1
#define CAN3RDSR3_DB2                    CAN3RXDSR3_DB2
#define CAN3RDSR3_DB3                    CAN3RXDSR3_DB3
#define CAN3RDSR3_DB4                    CAN3RXDSR3_DB4
#define CAN3RDSR3_DB5                    CAN3RXDSR3_DB5
#define CAN3RDSR3_DB6                    CAN3RXDSR3_DB6
#define CAN3RDSR3_DB7                    CAN3RXDSR3_DB7
#define CAN3RDSR3_DB0_MASK               CAN3RXDSR3_DB0_MASK
#define CAN3RDSR3_DB1_MASK               CAN3RXDSR3_DB1_MASK
#define CAN3RDSR3_DB2_MASK               CAN3RXDSR3_DB2_MASK
#define CAN3RDSR3_DB3_MASK               CAN3RXDSR3_DB3_MASK
#define CAN3RDSR3_DB4_MASK               CAN3RXDSR3_DB4_MASK
#define CAN3RDSR3_DB5_MASK               CAN3RXDSR3_DB5_MASK
#define CAN3RDSR3_DB6_MASK               CAN3RXDSR3_DB6_MASK
#define CAN3RDSR3_DB7_MASK               CAN3RXDSR3_DB7_MASK
#define CAN3RDSR4                        CAN3RXDSR4
#define CAN3RDSR4_DB0                    CAN3RXDSR4_DB0
#define CAN3RDSR4_DB1                    CAN3RXDSR4_DB1
#define CAN3RDSR4_DB2                    CAN3RXDSR4_DB2
#define CAN3RDSR4_DB3                    CAN3RXDSR4_DB3
#define CAN3RDSR4_DB4                    CAN3RXDSR4_DB4
#define CAN3RDSR4_DB5                    CAN3RXDSR4_DB5
#define CAN3RDSR4_DB6                    CAN3RXDSR4_DB6
#define CAN3RDSR4_DB7                    CAN3RXDSR4_DB7
#define CAN3RDSR4_DB0_MASK               CAN3RXDSR4_DB0_MASK
#define CAN3RDSR4_DB1_MASK               CAN3RXDSR4_DB1_MASK
#define CAN3RDSR4_DB2_MASK               CAN3RXDSR4_DB2_MASK
#define CAN3RDSR4_DB3_MASK               CAN3RXDSR4_DB3_MASK
#define CAN3RDSR4_DB4_MASK               CAN3RXDSR4_DB4_MASK
#define CAN3RDSR4_DB5_MASK               CAN3RXDSR4_DB5_MASK
#define CAN3RDSR4_DB6_MASK               CAN3RXDSR4_DB6_MASK
#define CAN3RDSR4_DB7_MASK               CAN3RXDSR4_DB7_MASK
#define CAN3RDSR5                        CAN3RXDSR5
#define CAN3RDSR5_DB0                    CAN3RXDSR5_DB0
#define CAN3RDSR5_DB1                    CAN3RXDSR5_DB1
#define CAN3RDSR5_DB2                    CAN3RXDSR5_DB2
#define CAN3RDSR5_DB3                    CAN3RXDSR5_DB3
#define CAN3RDSR5_DB4                    CAN3RXDSR5_DB4
#define CAN3RDSR5_DB5                    CAN3RXDSR5_DB5
#define CAN3RDSR5_DB6                    CAN3RXDSR5_DB6
#define CAN3RDSR5_DB7                    CAN3RXDSR5_DB7
#define CAN3RDSR5_DB0_MASK               CAN3RXDSR5_DB0_MASK
#define CAN3RDSR5_DB1_MASK               CAN3RXDSR5_DB1_MASK
#define CAN3RDSR5_DB2_MASK               CAN3RXDSR5_DB2_MASK
#define CAN3RDSR5_DB3_MASK               CAN3RXDSR5_DB3_MASK
#define CAN3RDSR5_DB4_MASK               CAN3RXDSR5_DB4_MASK
#define CAN3RDSR5_DB5_MASK               CAN3RXDSR5_DB5_MASK
#define CAN3RDSR5_DB6_MASK               CAN3RXDSR5_DB6_MASK
#define CAN3RDSR5_DB7_MASK               CAN3RXDSR5_DB7_MASK
#define CAN3RDSR6                        CAN3RXDSR6
#define CAN3RDSR6_DB0                    CAN3RXDSR6_DB0
#define CAN3RDSR6_DB1                    CAN3RXDSR6_DB1
#define CAN3RDSR6_DB2                    CAN3RXDSR6_DB2
#define CAN3RDSR6_DB3                    CAN3RXDSR6_DB3
#define CAN3RDSR6_DB4                    CAN3RXDSR6_DB4
#define CAN3RDSR6_DB5                    CAN3RXDSR6_DB5
#define CAN3RDSR6_DB6                    CAN3RXDSR6_DB6
#define CAN3RDSR6_DB7                    CAN3RXDSR6_DB7
#define CAN3RDSR6_DB0_MASK               CAN3RXDSR6_DB0_MASK
#define CAN3RDSR6_DB1_MASK               CAN3RXDSR6_DB1_MASK
#define CAN3RDSR6_DB2_MASK               CAN3RXDSR6_DB2_MASK
#define CAN3RDSR6_DB3_MASK               CAN3RXDSR6_DB3_MASK
#define CAN3RDSR6_DB4_MASK               CAN3RXDSR6_DB4_MASK
#define CAN3RDSR6_DB5_MASK               CAN3RXDSR6_DB5_MASK
#define CAN3RDSR6_DB6_MASK               CAN3RXDSR6_DB6_MASK
#define CAN3RDSR6_DB7_MASK               CAN3RXDSR6_DB7_MASK
#define CAN3RDSR7                        CAN3RXDSR7
#define CAN3RDSR7_DB0                    CAN3RXDSR7_DB0
#define CAN3RDSR7_DB1                    CAN3RXDSR7_DB1
#define CAN3RDSR7_DB2                    CAN3RXDSR7_DB2
#define CAN3RDSR7_DB3                    CAN3RXDSR7_DB3
#define CAN3RDSR7_DB4                    CAN3RXDSR7_DB4
#define CAN3RDSR7_DB5                    CAN3RXDSR7_DB5
#define CAN3RDSR7_DB6                    CAN3RXDSR7_DB6
#define CAN3RDSR7_DB7                    CAN3RXDSR7_DB7
#define CAN3RDSR7_DB0_MASK               CAN3RXDSR7_DB0_MASK
#define CAN3RDSR7_DB1_MASK               CAN3RXDSR7_DB1_MASK
#define CAN3RDSR7_DB2_MASK               CAN3RXDSR7_DB2_MASK
#define CAN3RDSR7_DB3_MASK               CAN3RXDSR7_DB3_MASK
#define CAN3RDSR7_DB4_MASK               CAN3RXDSR7_DB4_MASK
#define CAN3RDSR7_DB5_MASK               CAN3RXDSR7_DB5_MASK
#define CAN3RDSR7_DB6_MASK               CAN3RXDSR7_DB6_MASK
#define CAN3RDSR7_DB7_MASK               CAN3RXDSR7_DB7_MASK
#define CAN3RDLR                         CAN3RXDLR
#define CAN3RDLR_DLC0                    CAN3RXDLR_DLC0
#define CAN3RDLR_DLC1                    CAN3RXDLR_DLC1
#define CAN3RDLR_DLC2                    CAN3RXDLR_DLC2
#define CAN3RDLR_DLC3                    CAN3RXDLR_DLC3
#define CAN3RDLR_DLC                     CAN3RXDLR_DLC
#define CAN3RDLR_DLC0_MASK               CAN3RXDLR_DLC0_MASK
#define CAN3RDLR_DLC1_MASK               CAN3RXDLR_DLC1_MASK
#define CAN3RDLR_DLC2_MASK               CAN3RXDLR_DLC2_MASK
#define CAN3RDLR_DLC3_MASK               CAN3RXDLR_DLC3_MASK
#define CAN3RDLR_DLC_MASK                CAN3RXDLR_DLC_MASK
#define CAN3RDLR_DLC_BITNUM              CAN3RXDLR_DLC_BITNUM
#define CAN3RTSRH                        CAN3RXTSRH
#define CAN3RTSRH_TSR8                   CAN3RXTSRH_TSR8
#define CAN3RTSRH_TSR9                   CAN3RXTSRH_TSR9
#define CAN3RTSRH_TSR10                  CAN3RXTSRH_TSR10
#define CAN3RTSRH_TSR11                  CAN3RXTSRH_TSR11
#define CAN3RTSRH_TSR12                  CAN3RXTSRH_TSR12
#define CAN3RTSRH_TSR13                  CAN3RXTSRH_TSR13
#define CAN3RTSRH_TSR14                  CAN3RXTSRH_TSR14
#define CAN3RTSRH_TSR15                  CAN3RXTSRH_TSR15
#define CAN3RTSRH_TSR8_MASK              CAN3RXTSRH_TSR8_MASK
#define CAN3RTSRH_TSR9_MASK              CAN3RXTSRH_TSR9_MASK
#define CAN3RTSRH_TSR10_MASK             CAN3RXTSRH_TSR10_MASK
#define CAN3RTSRH_TSR11_MASK             CAN3RXTSRH_TSR11_MASK
#define CAN3RTSRH_TSR12_MASK             CAN3RXTSRH_TSR12_MASK
#define CAN3RTSRH_TSR13_MASK             CAN3RXTSRH_TSR13_MASK
#define CAN3RTSRH_TSR14_MASK             CAN3RXTSRH_TSR14_MASK
#define CAN3RTSRH_TSR15_MASK             CAN3RXTSRH_TSR15_MASK
#define CAN3RTSRL                        CAN3RXTSRL
#define CAN3RTSRL_TSR0                   CAN3RXTSRL_TSR0
#define CAN3RTSRL_TSR1                   CAN3RXTSRL_TSR1
#define CAN3RTSRL_TSR2                   CAN3RXTSRL_TSR2
#define CAN3RTSRL_TSR3                   CAN3RXTSRL_TSR3
#define CAN3RTSRL_TSR4                   CAN3RXTSRL_TSR4
#define CAN3RTSRL_TSR5                   CAN3RXTSRL_TSR5
#define CAN3RTSRL_TSR6                   CAN3RXTSRL_TSR6
#define CAN3RTSRL_TSR7                   CAN3RXTSRL_TSR7
#define CAN3RTSRL_TSR0_MASK              CAN3RXTSRL_TSR0_MASK
#define CAN3RTSRL_TSR1_MASK              CAN3RXTSRL_TSR1_MASK
#define CAN3RTSRL_TSR2_MASK              CAN3RXTSRL_TSR2_MASK
#define CAN3RTSRL_TSR3_MASK              CAN3RXTSRL_TSR3_MASK
#define CAN3RTSRL_TSR4_MASK              CAN3RXTSRL_TSR4_MASK
#define CAN3RTSRL_TSR5_MASK              CAN3RXTSRL_TSR5_MASK
#define CAN3RTSRL_TSR6_MASK              CAN3RXTSRL_TSR6_MASK
#define CAN3RTSRL_TSR7_MASK              CAN3RXTSRL_TSR7_MASK
#define CAN3RTSR                         CAN3RXTSR
#define CAN3RTSR_TSR0                    CAN3RXTSR_TSR0
#define CAN3RTSR_TSR1                    CAN3RXTSR_TSR1
#define CAN3RTSR_TSR2                    CAN3RXTSR_TSR2
#define CAN3RTSR_TSR3                    CAN3RXTSR_TSR3
#define CAN3RTSR_TSR4                    CAN3RXTSR_TSR4
#define CAN3RTSR_TSR5                    CAN3RXTSR_TSR5
#define CAN3RTSR_TSR6                    CAN3RXTSR_TSR6
#define CAN3RTSR_TSR7                    CAN3RXTSR_TSR7
#define CAN3RTSR_TSR8                    CAN3RXTSR_TSR8
#define CAN3RTSR_TSR9                    CAN3RXTSR_TSR9
#define CAN3RTSR_TSR10                   CAN3RXTSR_TSR10
#define CAN3RTSR_TSR11                   CAN3RXTSR_TSR11
#define CAN3RTSR_TSR12                   CAN3RXTSR_TSR12
#define CAN3RTSR_TSR13                   CAN3RXTSR_TSR13
#define CAN3RTSR_TSR14                   CAN3RXTSR_TSR14
#define CAN3RTSR_TSR15                   CAN3RXTSR_TSR15
#define CAN3RTSR_TSR0_MASK               CAN3RXTSR_TSR0_MASK
#define CAN3RTSR_TSR1_MASK               CAN3RXTSR_TSR1_MASK
#define CAN3RTSR_TSR2_MASK               CAN3RXTSR_TSR2_MASK
#define CAN3RTSR_TSR3_MASK               CAN3RXTSR_TSR3_MASK
#define CAN3RTSR_TSR4_MASK               CAN3RXTSR_TSR4_MASK
#define CAN3RTSR_TSR5_MASK               CAN3RXTSR_TSR5_MASK
#define CAN3RTSR_TSR6_MASK               CAN3RXTSR_TSR6_MASK
#define CAN3RTSR_TSR7_MASK               CAN3RXTSR_TSR7_MASK
#define CAN3RTSR_TSR8_MASK               CAN3RXTSR_TSR8_MASK
#define CAN3RTSR_TSR9_MASK               CAN3RXTSR_TSR9_MASK
#define CAN3RTSR_TSR10_MASK              CAN3RXTSR_TSR10_MASK
#define CAN3RTSR_TSR11_MASK              CAN3RXTSR_TSR11_MASK
#define CAN3RTSR_TSR12_MASK              CAN3RXTSR_TSR12_MASK
#define CAN3RTSR_TSR13_MASK              CAN3RXTSR_TSR13_MASK
#define CAN3RTSR_TSR14_MASK              CAN3RXTSR_TSR14_MASK
#define CAN3RTSR_TSR15_MASK              CAN3RXTSR_TSR15_MASK
#define CAN3TIDR0                        CAN3TXIDR0
#define CAN3TIDR0_ID21                   CAN3TXIDR0_ID21
#define CAN3TIDR0_ID22                   CAN3TXIDR0_ID22
#define CAN3TIDR0_ID23                   CAN3TXIDR0_ID23
#define CAN3TIDR0_ID24                   CAN3TXIDR0_ID24
#define CAN3TIDR0_ID25                   CAN3TXIDR0_ID25
#define CAN3TIDR0_ID26                   CAN3TXIDR0_ID26
#define CAN3TIDR0_ID27                   CAN3TXIDR0_ID27
#define CAN3TIDR0_ID28                   CAN3TXIDR0_ID28
#define CAN3TIDR_ARR                     CAN3TXIDR_ARR
#define CAN3TIDR0_ID21_MASK              CAN3TXIDR0_ID21_MASK
#define CAN3TIDR0_ID22_MASK              CAN3TXIDR0_ID22_MASK
#define CAN3TIDR0_ID23_MASK              CAN3TXIDR0_ID23_MASK
#define CAN3TIDR0_ID24_MASK              CAN3TXIDR0_ID24_MASK
#define CAN3TIDR0_ID25_MASK              CAN3TXIDR0_ID25_MASK
#define CAN3TIDR0_ID26_MASK              CAN3TXIDR0_ID26_MASK
#define CAN3TIDR0_ID27_MASK              CAN3TXIDR0_ID27_MASK
#define CAN3TIDR0_ID28_MASK              CAN3TXIDR0_ID28_MASK
#define CAN3TIDR1                        CAN3TXIDR1
#define CAN3TIDR1_ID15                   CAN3TXIDR1_ID15
#define CAN3TIDR1_ID16                   CAN3TXIDR1_ID16
#define CAN3TIDR1_ID17                   CAN3TXIDR1_ID17
#define CAN3TIDR1_IDE                    CAN3TXIDR1_IDE
#define CAN3TIDR1_SRR                    CAN3TXIDR1_SRR
#define CAN3TIDR1_ID18                   CAN3TXIDR1_ID18
#define CAN3TIDR1_ID19                   CAN3TXIDR1_ID19
#define CAN3TIDR1_ID20                   CAN3TXIDR1_ID20
#define CAN3TIDR1_ID_15                  CAN3TXIDR1_ID_15
#define CAN3TIDR1_ID_18                  CAN3TXIDR1_ID_18
#define CAN3TIDR1_ID                     CAN3TXIDR1_ID
#define CAN3TIDR1_ID15_MASK              CAN3TXIDR1_ID15_MASK
#define CAN3TIDR1_ID16_MASK              CAN3TXIDR1_ID16_MASK
#define CAN3TIDR1_ID17_MASK              CAN3TXIDR1_ID17_MASK
#define CAN3TIDR1_IDE_MASK               CAN3TXIDR1_IDE_MASK
#define CAN3TIDR1_SRR_MASK               CAN3TXIDR1_SRR_MASK
#define CAN3TIDR1_ID18_MASK              CAN3TXIDR1_ID18_MASK
#define CAN3TIDR1_ID19_MASK              CAN3TXIDR1_ID19_MASK
#define CAN3TIDR1_ID20_MASK              CAN3TXIDR1_ID20_MASK
#define CAN3TIDR1_ID_15_MASK             CAN3TXIDR1_ID_15_MASK
#define CAN3TIDR1_ID_15_BITNUM           CAN3TXIDR1_ID_15_BITNUM
#define CAN3TIDR1_ID_18_MASK             CAN3TXIDR1_ID_18_MASK
#define CAN3TIDR1_ID_18_BITNUM           CAN3TXIDR1_ID_18_BITNUM
#define CAN3TIDR2                        CAN3TXIDR2
#define CAN3TIDR2_ID7                    CAN3TXIDR2_ID7
#define CAN3TIDR2_ID8                    CAN3TXIDR2_ID8
#define CAN3TIDR2_ID9                    CAN3TXIDR2_ID9
#define CAN3TIDR2_ID10                   CAN3TXIDR2_ID10
#define CAN3TIDR2_ID11                   CAN3TXIDR2_ID11
#define CAN3TIDR2_ID12                   CAN3TXIDR2_ID12
#define CAN3TIDR2_ID13                   CAN3TXIDR2_ID13
#define CAN3TIDR2_ID14                   CAN3TXIDR2_ID14
#define CAN3TIDR2_ID7_MASK               CAN3TXIDR2_ID7_MASK
#define CAN3TIDR2_ID8_MASK               CAN3TXIDR2_ID8_MASK
#define CAN3TIDR2_ID9_MASK               CAN3TXIDR2_ID9_MASK
#define CAN3TIDR2_ID10_MASK              CAN3TXIDR2_ID10_MASK
#define CAN3TIDR2_ID11_MASK              CAN3TXIDR2_ID11_MASK
#define CAN3TIDR2_ID12_MASK              CAN3TXIDR2_ID12_MASK
#define CAN3TIDR2_ID13_MASK              CAN3TXIDR2_ID13_MASK
#define CAN3TIDR2_ID14_MASK              CAN3TXIDR2_ID14_MASK
#define CAN3TIDR3                        CAN3TXIDR3
#define CAN3TIDR3_RTR                    CAN3TXIDR3_RTR
#define CAN3TIDR3_ID0                    CAN3TXIDR3_ID0
#define CAN3TIDR3_ID1                    CAN3TXIDR3_ID1
#define CAN3TIDR3_ID2                    CAN3TXIDR3_ID2
#define CAN3TIDR3_ID3                    CAN3TXIDR3_ID3
#define CAN3TIDR3_ID4                    CAN3TXIDR3_ID4
#define CAN3TIDR3_ID5                    CAN3TXIDR3_ID5
#define CAN3TIDR3_ID6                    CAN3TXIDR3_ID6
#define CAN3TIDR3_ID                     CAN3TXIDR3_ID
#define CAN3TIDR3_RTR_MASK               CAN3TXIDR3_RTR_MASK
#define CAN3TIDR3_ID0_MASK               CAN3TXIDR3_ID0_MASK
#define CAN3TIDR3_ID1_MASK               CAN3TXIDR3_ID1_MASK
#define CAN3TIDR3_ID2_MASK               CAN3TXIDR3_ID2_MASK
#define CAN3TIDR3_ID3_MASK               CAN3TXIDR3_ID3_MASK
#define CAN3TIDR3_ID4_MASK               CAN3TXIDR3_ID4_MASK
#define CAN3TIDR3_ID5_MASK               CAN3TXIDR3_ID5_MASK
#define CAN3TIDR3_ID6_MASK               CAN3TXIDR3_ID6_MASK
#define CAN3TIDR3_ID_MASK                CAN3TXIDR3_ID_MASK
#define CAN3TIDR3_ID_BITNUM              CAN3TXIDR3_ID_BITNUM
#define CAN3TDSR0                        CAN3TXDSR0
#define CAN3TDSR0_DB0                    CAN3TXDSR0_DB0
#define CAN3TDSR0_DB1                    CAN3TXDSR0_DB1
#define CAN3TDSR0_DB2                    CAN3TXDSR0_DB2
#define CAN3TDSR0_DB3                    CAN3TXDSR0_DB3
#define CAN3TDSR0_DB4                    CAN3TXDSR0_DB4
#define CAN3TDSR0_DB5                    CAN3TXDSR0_DB5
#define CAN3TDSR0_DB6                    CAN3TXDSR0_DB6
#define CAN3TDSR0_DB7                    CAN3TXDSR0_DB7
#define CAN3TDSR_ARR                     CAN3TXDSR_ARR
#define CAN3TDSR0_DB0_MASK               CAN3TXDSR0_DB0_MASK
#define CAN3TDSR0_DB1_MASK               CAN3TXDSR0_DB1_MASK
#define CAN3TDSR0_DB2_MASK               CAN3TXDSR0_DB2_MASK
#define CAN3TDSR0_DB3_MASK               CAN3TXDSR0_DB3_MASK
#define CAN3TDSR0_DB4_MASK               CAN3TXDSR0_DB4_MASK
#define CAN3TDSR0_DB5_MASK               CAN3TXDSR0_DB5_MASK
#define CAN3TDSR0_DB6_MASK               CAN3TXDSR0_DB6_MASK
#define CAN3TDSR0_DB7_MASK               CAN3TXDSR0_DB7_MASK
#define CAN3TDSR1                        CAN3TXDSR1
#define CAN3TDSR1_DB0                    CAN3TXDSR1_DB0
#define CAN3TDSR1_DB1                    CAN3TXDSR1_DB1
#define CAN3TDSR1_DB2                    CAN3TXDSR1_DB2
#define CAN3TDSR1_DB3                    CAN3TXDSR1_DB3
#define CAN3TDSR1_DB4                    CAN3TXDSR1_DB4
#define CAN3TDSR1_DB5                    CAN3TXDSR1_DB5
#define CAN3TDSR1_DB6                    CAN3TXDSR1_DB6
#define CAN3TDSR1_DB7                    CAN3TXDSR1_DB7
#define CAN3TDSR1_DB0_MASK               CAN3TXDSR1_DB0_MASK
#define CAN3TDSR1_DB1_MASK               CAN3TXDSR1_DB1_MASK
#define CAN3TDSR1_DB2_MASK               CAN3TXDSR1_DB2_MASK
#define CAN3TDSR1_DB3_MASK               CAN3TXDSR1_DB3_MASK
#define CAN3TDSR1_DB4_MASK               CAN3TXDSR1_DB4_MASK
#define CAN3TDSR1_DB5_MASK               CAN3TXDSR1_DB5_MASK
#define CAN3TDSR1_DB6_MASK               CAN3TXDSR1_DB6_MASK
#define CAN3TDSR1_DB7_MASK               CAN3TXDSR1_DB7_MASK
#define CAN3TDSR2                        CAN3TXDSR2
#define CAN3TDSR2_DB0                    CAN3TXDSR2_DB0
#define CAN3TDSR2_DB1                    CAN3TXDSR2_DB1
#define CAN3TDSR2_DB2                    CAN3TXDSR2_DB2
#define CAN3TDSR2_DB3                    CAN3TXDSR2_DB3
#define CAN3TDSR2_DB4                    CAN3TXDSR2_DB4
#define CAN3TDSR2_DB5                    CAN3TXDSR2_DB5
#define CAN3TDSR2_DB6                    CAN3TXDSR2_DB6
#define CAN3TDSR2_DB7                    CAN3TXDSR2_DB7
#define CAN3TDSR2_DB0_MASK               CAN3TXDSR2_DB0_MASK
#define CAN3TDSR2_DB1_MASK               CAN3TXDSR2_DB1_MASK
#define CAN3TDSR2_DB2_MASK               CAN3TXDSR2_DB2_MASK
#define CAN3TDSR2_DB3_MASK               CAN3TXDSR2_DB3_MASK
#define CAN3TDSR2_DB4_MASK               CAN3TXDSR2_DB4_MASK
#define CAN3TDSR2_DB5_MASK               CAN3TXDSR2_DB5_MASK
#define CAN3TDSR2_DB6_MASK               CAN3TXDSR2_DB6_MASK
#define CAN3TDSR2_DB7_MASK               CAN3TXDSR2_DB7_MASK
#define CAN3TDSR3                        CAN3TXDSR3
#define CAN3TDSR3_DB0                    CAN3TXDSR3_DB0
